{"id": "VR-SJT-0001", "type": "situational_test", "domain": "teamwork", "scenario": "Your team member Aicha consistently misses deadlines, affecting the project timeline. The team lead hasn't addressed this yet. What should you do?", "choices": ["Ignore it since it's not your responsibility", "Offer to help Aicha with her workload and time management", "Immediately report Aicha to HR for poor performance", "Complain about Aicha to other team members"], "answer_index": 1, "answer": "Offer to help Aicha with her workload and time management", "explanation": "Supporting a struggling teammate demonstrates collaborative spirit and may resolve the issue constructively. Ignoring problems or gossiping undermines team cohesion, while escalating too quickly skips potential solutions.", "difficulty": "easy", "tags": ["SJT", "teamwork", "collaboration"], "translations": {}}
{"id": "VR-SJT-0002", "type": "situational_test", "domain": "leadership", "scenario": "As project manager, you discover that two critical tasks assigned to different team members have significant overlap, potentially causing conflicts. How do you handle this?", "choices": ["Let the team members figure it out themselves", "Immediately reassign both tasks to one person", "Call a meeting to clarify responsibilities and prevent duplication", "Remove the overlapping portions without consulting anyone"], "answer_index": 2, "answer": "Call a meeting to clarify responsibilities and prevent duplication", "explanation": "Proactive communication and clear role definition prevent conflicts and ensure efficient work distribution. Avoiding the issue or making unilateral decisions without input can lead to confusion and resentment.", "difficulty": "medium", "tags": ["SJT", "leadership", "project_management"], "translations": {}}
{"id": "VR-SJT-0003", "type": "situational_test", "domain": "communication", "scenario": "During a client presentation, your colleague Youssef makes a significant factual error. The client looks confused. What should you do?", "choices": ["Let the error slide to avoid embarrassing Youssef", "Politely correct the information and provide accurate details", "Interrupt loudly to point out the mistake", "Send the client an email later without telling Youssef"], "answer_index": 1, "answer": "Politely correct the information and provide accurate details", "explanation": "Professional integrity requires accurate information. Tactful correction maintains credibility while respecting your colleague. Ignoring errors misleads clients, while harsh correction damages team relationships.", "difficulty": "easy", "tags": ["SJT", "communication", "professionalism"], "translations": {}}
{"id": "VR-SJT-0004", "type": "situational_test", "domain": "customer_service", "scenario": "A frustrated customer, Mr. Bennani, is demanding an immediate refund for a service that doesn't qualify under your company's policy. He's threatening to leave negative reviews. How do you respond?", "choices": ["Refuse the refund and end the conversation", "Explain the policy calmly and offer alternative solutions", "Immediately grant the refund to avoid negative publicity", "Transfer him to multiple departments to avoid dealing with it"], "answer_index": 1, "answer": "Explain the policy calmly and offer alternative solutions", "explanation": "Professional customer service involves clear communication about policies while exploring alternatives that satisfy both parties. Avoiding the issue or immediately caving to threats sets poor precedents.", "difficulty": "medium", "tags": ["SJT", "customer_service", "conflict_resolution"], "translations": {}}
{"id": "VR-SJT-0005", "type": "situational_test", "domain": "ethics", "scenario": "Your supervisor asks you to manipulate data in a report to make the company's performance look better for investors. What do you do?", "choices": ["Comply to avoid conflict with your supervisor", "Refuse and document the request for potential reporting", "Manipulate the data but keep the original for yourself", "Quit immediately without explanation"], "answer_index": 1, "answer": "Refuse and document the request for potential reporting", "explanation": "Ethical integrity requires refusing unethical requests and maintaining documentation. Compliance with unethical demands is professionally and legally dangerous, while extreme reactions like quitting may not be necessary initially.", "difficulty": "hard", "tags": ["SJT", "ethics", "integrity"], "translations": {}}
{"id": "VR-SJT-0006", "type": "situational_test", "domain": "inclusivity", "scenario": "During a team brainstorming session, you notice that Fatima, who speaks with an accent, is being interrupted frequently by other team members. What should you do?", "choices": ["Let the meeting continue naturally", "Actively invite Fatima to share her ideas and ensure she's heard", "Point out rudely that people are interrupting", "Speak for Fatima to help her out"], "answer_index": 1, "answer": "Actively invite Fatima to share her ideas and ensure she's heard", "explanation": "Inclusive leadership means ensuring all voices are heard. Creating space for participation demonstrates respect and values diverse perspectives. Ignoring the issue perpetuates exclusion, while inappropriate interventions can be patronizing.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "diversity"], "translations": {}}
{"id": "VR-SJT-0007", "type": "situational_test", "domain": "conflict", "scenario": "Two team members, Omar and Sarah, have a heated argument during a project meeting about the best approach to take. The tension is affecting the whole team. How do you intervene?", "choices": ["Ignore it and hope they resolve it themselves", "Facilitate a structured discussion to understand both perspectives", "Side with whoever you think is right", "Immediately separate them and assign them to different projects"], "answer_index": 1, "answer": "Facilitate a structured discussion to understand both perspectives", "explanation": "Effective conflict resolution involves helping parties communicate constructively. Facilitation can transform disagreement into productive dialogue. Avoiding the issue or taking sides escalates tensions.", "difficulty": "medium", "tags": ["SJT", "conflict", "mediation"], "translations": {}}
{"id": "VR-SJT-0008", "type": "situational_test", "domain": "safety", "scenario": "You notice a colleague working in the warehouse without required safety equipment. The supervisor is not around. What should you do?", "choices": ["Mind your own business to avoid conflict", "Immediately remind them about safety requirements and offer to help find equipment", "Report them to management immediately", "Make jokes about their carelessness"], "answer_index": 1, "answer": "Immediately remind them about safety requirements and offer to help find equipment", "explanation": "Safety is everyone's responsibility. Direct, helpful intervention can prevent accidents. Ignoring safety violations puts people at risk, while making jokes trivializes serious concerns.", "difficulty": "easy", "tags": ["SJT", "safety", "workplace_safety"], "translations": {}}
{"id": "VR-SJT-0009", "type": "situational_test", "domain": "teamwork", "scenario": "Your team is behind schedule on a critical project. Khalid suggests working unpaid overtime to catch up, but Amina argues this sets a bad precedent. How do you contribute to this discussion?", "choices": ["Stay silent to avoid choosing sides", "Propose exploring efficient work methods and possibly requesting deadline extension", "Immediately agree with whoever speaks first", "Insist that unpaid overtime is the only solution"], "answer_index": 1, "answer": "Propose exploring efficient work methods and possibly requesting deadline extension", "explanation": "Constructive problem-solving involves exploring multiple solutions that respect both work-life balance and project needs. This approach demonstrates leadership thinking and consideration for team welfare.", "difficulty": "medium", "tags": ["SJT", "teamwork", "work_life_balance"], "translations": {}}
{"id": "VR-SJT-0010", "type": "situational_test", "domain": "leadership", "scenario": "You're leading a diverse team where cultural differences are causing misunderstandings about work styles and communication. How do you address this?", "choices": ["Ignore the differences and focus only on work output", "Organize team-building activities to explore and appreciate different perspectives", "Impose one standard way of working for everyone", "Reassign people to minimize cultural mixing"], "answer_index": 1, "answer": "Organize team-building activities to explore and appreciate different perspectives", "explanation": "Effective leadership leverages diversity as a strength. Creating opportunities for mutual understanding and appreciation improves team cohesion and performance. Ignoring or suppressing differences wastes valuable perspectives.", "difficulty": "hard", "tags": ["SJT", "leadership", "diversity_management"], "translations": {}}
{"id": "VR-SJT-0011", "type": "situational_test", "domain": "communication", "scenario": "You need to deliver disappointing news to your team about budget cuts affecting their projects. How do you communicate this?", "choices": ["Send a brief email with minimal details", "Hold a meeting to explain the situation transparently and discuss next steps", "Let your supervisor handle all communication", "Announce it casually during another meeting"], "answer_index": 1, "answer": "Hold a meeting to explain the situation transparently and discuss next steps", "explanation": "Transparent communication about difficult news builds trust and allows for collaborative problem-solving. Face-to-face discussions show respect and enable questions. Avoiding or minimizing communication creates uncertainty and rumors.", "difficulty": "easy", "tags": ["SJT", "communication", "transparency"], "translations": {}}
{"id": "VR-SJT-0012", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mrs. Alaoui, is upset because a promised delivery was delayed due to circumstances beyond your company's control. She demands compensation. How do you handle this?", "choices": ["Tell her it's not your company's fault and offer nothing", "Acknowledge her frustration and explain options within your authority", "Promise full compensation immediately without checking policies", "Transfer her to multiple departments to avoid responsibility"], "answer_index": 1, "answer": "Acknowledge her frustration and explain options within your authority", "explanation": "Empathetic customer service involves acknowledging concerns and working within established guidelines to find solutions. Dismissing concerns damages relationships, while unauthorized promises create problems.", "difficulty": "medium", "tags": ["SJT", "customer_service", "empathy"], "translations": {}}
{"id": "VR-SJT-0013", "type": "situational_test", "domain": "ethics", "scenario": "You discover that a close friend and colleague, Rachid, has been padding his expense reports with personal purchases. What should you do?", "choices": ["Ignore it since you're friends", "Privately discuss your concerns with Rachid first", "Immediately report it to management", "Help cover for him to protect your friendship"], "answer_index": 1, "answer": "Privately discuss your concerns with Rachid first", "explanation": "Ethical situations often benefit from direct communication first, giving people a chance to correct behavior. This balances personal relationships with professional integrity. Ignoring or covering up perpetuates unethical behavior.", "difficulty": "hard", "tags": ["SJT", "ethics", "personal_relationships"], "translations": {}}
{"id": "VR-SJT-0014", "type": "situational_test", "domain": "inclusivity", "scenario": "During hiring discussions, a colleague suggests that hiring Nadia might be risky because 'women her age might have family priorities.' How do you respond?", "choices": ["Agree to avoid conflict", "Challenge this bias and redirect focus to job qualifications", "Stay silent but feel uncomfortable", "Make a joke to lighten the mood"], "answer_index": 1, "answer": "Challenge this bias and redirect focus to job qualifications", "explanation": "Professional responsibility includes challenging discriminatory thinking. Focusing on qualifications ensures fair hiring practices. Silence or agreement perpetuates bias and potentially illegal discrimination.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "bias_prevention"], "translations": {}}
{"id": "VR-SJT-0015", "type": "situational_test", "domain": "conflict", "scenario": "Your department is split into two groups with opposing views on implementing a new software system. The conflict is affecting productivity. How do you help resolve this?", "choices": ["Pick the side you think is right", "Organize a structured evaluation of both options with clear criteria", "Wait for management to decide", "Suggest compromising by using both systems"], "answer_index": 1, "answer": "Organize a structured evaluation of both options with clear criteria", "explanation": "Systematic evaluation helps move from emotional positions to evidence-based decisions. This approach respects both sides while focusing on objective outcomes. Taking sides or avoiding decisions prolongs conflict.", "difficulty": "hard", "tags": ["SJT", "conflict", "decision_making"], "translations": {}}
{"id": "VR-SJT-0016", "type": "situational_test", "domain": "safety", "scenario": "You observe a spill in the hallway that could cause someone to slip, but you're already late for an important meeting. What do you do?", "choices": ["Hurry past and hope someone else handles it", "Take a moment to clean it up or mark it as a hazard", "Report it to custodial staff later", "Point it out to the next person you see"], "answer_index": 1, "answer": "Take a moment to clean it up or mark it as a hazard", "explanation": "Immediate action on safety hazards prevents accidents. The few minutes spent addressing the hazard could prevent serious injury. Safety responsibilities supersede meeting schedules in most situations.", "difficulty": "easy", "tags": ["SJT", "safety", "personal_responsibility"], "translations": {}}
{"id": "VR-SJT-0017", "type": "situational_test", "domain": "teamwork", "scenario": "Your team member Hamza is struggling with a new technology that everyone else has mastered. He seems embarrassed to ask for help. How do you approach this?", "choices": ["Let him figure it out to build independence", "Privately offer assistance and suggest learning resources", "Point out his struggles in the next team meeting", "Complete his work for him to save time"], "answer_index": 1, "answer": "Privately offer assistance and suggest learning resources", "explanation": "Supportive teamwork involves helping colleagues develop skills while preserving their dignity. Private assistance shows respect and builds team capability. Public criticism or doing work for others doesn't help long-term development.", "difficulty": "easy", "tags": ["SJT", "teamwork", "mentoring"], "translations": {}}
{"id": "VR-SJT-0018", "type": "situational_test", "domain": "leadership", "scenario": "Your team has consistently exceeded targets, but you notice signs of burnout. Upper management wants to increase targets further. How do you respond?", "choices": ["Accept the new targets without question", "Present data on team performance and advocate for sustainable goals", "Refuse the new targets outright", "Secretly tell your team to slow down"], "answer_index": 1, "answer": "Present data on team performance and advocate for sustainable goals", "explanation": "Effective leadership involves advocating for team welfare while maintaining organizational relationships. Data-driven arguments are more persuasive than emotional appeals. Refusing outright or working against the organization creates bigger problems.", "difficulty": "hard", "tags": ["SJT", "leadership", "advocacy"], "translations": {}}
{"id": "VR-SJT-0019", "type": "situational_test", "domain": "communication", "scenario": "You receive a harsh email from a colleague, Yasmine, criticizing your work in front of several other recipients. How do you respond?", "choices": ["Reply immediately with an equally harsh response", "Respond professionally and suggest discussing the concerns privately", "Ignore the email completely", "Forward it to your supervisor with complaints"], "answer_index": 1, "answer": "Respond professionally and suggest discussing the concerns privately", "explanation": "Professional communication maintains dignity while addressing concerns constructively. Private discussion often resolves issues more effectively than public exchanges. Escalating immediately or responding emotionally damages working relationships.", "difficulty": "medium", "tags": ["SJT", "communication", "conflict_de-escalation"], "translations": {}}
{"id": "VR-SJT-0020", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mr. Tazi, calls repeatedly with the same complaint that has already been resolved according to your records. He insists the problem persists. What do you do?", "choices": ["Tell him the records show it's resolved and end the call", "Listen to his concerns and investigate further to ensure resolution", "Transfer him to someone else immediately", "Get frustrated and explain he's wrong"], "answer_index": 1, "answer": "Listen to his concerns and investigate further to ensure resolution", "explanation": "Quality customer service involves thorough investigation even when records suggest resolution. Customers may experience issues not captured in systems. Dismissing concerns or transferring problems doesn't serve customer needs.", "difficulty": "easy", "tags": ["SJT", "customer_service", "problem_solving"], "translations": {}}
{"id": "VR-SJT-0021", "type": "situational_test", "domain": "ethics", "scenario": "You're offered a gift from a vendor worth approximately 500 MAD. Your company policy prohibits gifts over 200 MAD. The vendor says it's just a token of appreciation. What do you do?", "choices": ["Accept it since it's meant as appreciation", "Politely decline and explain your company's gift policy", "Accept it but don't tell anyone", "Report the vendor for attempted bribery"], "answer_index": 1, "answer": "Politely decline and explain your company's gift policy", "explanation": "Ethical behavior requires following company policies regarding gifts, which exist to prevent conflicts of interest. Polite explanation maintains business relationships while upholding standards. Accepting violates policy, while reporting may be excessive for this situation.", "difficulty": "medium", "tags": ["SJT", "ethics", "policy_compliance"], "translations": {}}
{"id": "VR-SJT-0022", "type": "situational_test", "domain": "inclusivity", "scenario": "You notice that team social events consistently exclude team members who don't drink alcohol for religious reasons. What should you do?", "choices": ["Don't interfere with social traditions", "Suggest planning inclusive events that accommodate everyone", "Tell the excluded members to be more flexible", "Organize separate events for different groups"], "answer_index": 1, "answer": "Suggest planning inclusive events that accommodate everyone", "explanation": "Inclusive workplaces ensure all team members can participate in team-building activities. Planning accommodating events strengthens team cohesion. Exclusion damages team relationships and may create legal issues.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "religious_accommodation"], "translations": {}}
{"id": "VR-SJT-0023", "type": "situational_test", "domain": "conflict", "scenario": "Laila and Karim from different departments blame each other for a project delay. Both have valid points and the situation is affecting inter-departmental relations. How do you help?", "choices": ["Stay out of inter-departmental issues", "Facilitate a joint meeting to focus on solutions rather than blame", "Support whichever person you know better", "Escalate to senior management immediately"], "answer_index": 1, "answer": "Facilitate a joint meeting to focus on solutions rather than blame", "explanation": "Constructive conflict resolution focuses on solutions and future prevention rather than assigning blame. Facilitation helps parties move beyond positions to address underlying issues. Avoiding or escalating too quickly misses opportunities for resolution.", "difficulty": "medium", "tags": ["SJT", "conflict", "cross_departmental"], "translations": {}}
{"id": "VR-SJT-0024", "type": "situational_test", "domain": "safety", "scenario": "During a fire drill, you notice some employees are not taking it seriously and remaining at their desks. What should you do?", "choices": ["Let security handle it", "Firmly but politely encourage everyone to participate in the safety drill", "Report the non-participants to HR", "Continue with your own evacuation"], "answer_index": 1, "answer": "Firmly but politely encourage everyone to participate in the safety drill", "explanation": "Safety is everyone's responsibility. Encouraging participation in safety procedures helps build a culture of safety awareness. Ignoring non-compliance puts everyone at risk during real emergencies.", "difficulty": "easy", "tags": ["SJT", "safety", "emergency_procedures"], "translations": {}}
{"id": "VR-SJT-0025", "type": "situational_test", "domain": "teamwork", "scenario": "Your team is working on a high-pressure project. Maryam suggests a creative but risky approach that could either save significant time or cause major delays. How do you contribute to the decision?", "choices": ["Automatically oppose risky approaches", "Help the team systematically evaluate the risks and benefits", "Support it enthusiastically without analysis", "Let others decide while staying neutral"], "answer_index": 1, "answer": "Help the team systematically evaluate the risks and benefits", "explanation": "Good teamwork involves contributing analytical thinking to team decisions. Systematic evaluation helps teams make informed choices about risks. Automatic opposition or support without analysis doesn't add value to team decision-making.", "difficulty": "medium", "tags": ["SJT", "teamwork", "risk_assessment"], "translations": {}}
{"id": "VR-SJT-0026", "type": "situational_test", "domain": "leadership", "scenario": "One of your direct reports, Amine, consistently produces excellent work but has a negative attitude that's affecting team morale. How do you address this?", "choices": ["Ignore the attitude since the work quality is good", "Have a private conversation about the impact of attitude on the team", "Immediately issue a formal warning", "Reassign them to work alone"], "answer_index": 1, "answer": "Have a private conversation about the impact of attitude on the team", "explanation": "Effective leadership addresses performance issues holistically, including both work quality and team impact. Private discussion allows for understanding underlying issues and collaborative solutions. Ignoring problems or immediately escalating misses coaching opportunities.", "difficulty": "hard", "tags": ["SJT", "leadership", "performance_management"], "translations": {}}
{"id": "VR-SJT-0027", "type": "situational_test", "domain": "communication", "scenario": "You need to explain a complex technical process to stakeholders with varying levels of technical knowledge. How do you approach this?", "choices": ["Use highly technical language to show expertise", "Adapt your communication style to your audience and check for understanding", "Assume everyone has the same knowledge level", "Only present to technical people"], "answer_index": 1, "answer": "Adapt your communication style to your audience and check for understanding", "explanation": "Effective communication requires audience awareness and adaptation. Checking for understanding ensures your message is received correctly. Using inappropriate language levels or excluding stakeholders reduces communication effectiveness.", "difficulty": "easy", "tags": ["SJT", "communication", "technical_communication"], "translations": {}}
{"id": "VR-SJT-0028", "type": "situational_test", "domain": "customer_service", "scenario": "A long-term client, Mrs. Ouali, requests a service modification that would require breaking standard procedures. She emphasizes her loyalty and threatens to take her business elsewhere. How do you respond?", "choices": ["Break the procedures to keep the important client", "Explain why procedures exist and explore alternative solutions within guidelines", "Immediately refuse without explanation", "Promise to break rules but don't follow through"], "answer_index": 1, "answer": "Explain why procedures exist and explore alternative solutions within guidelines", "explanation": "Professional service involves working within established guidelines while finding creative solutions. Explaining rationale and exploring alternatives shows respect for both policies and customer needs. Breaking rules or making false promises creates larger problems.", "difficulty": "hard", "tags": ["SJT", "customer_service", "policy_vs_flexibility"], "translations": {}}
{"id": "VR-SJT-0029", "type": "situational_test", "domain": "ethics", "scenario": "You accidentally receive confidential salary information about your colleagues while helping with administrative tasks. What should you do?", "choices": ["Share interesting findings with close colleagues", "Immediately stop looking and return the information without discussing it", "Use the information to negotiate your own salary", "Keep quiet but remember the information for future use"], "answer_index": 1, "answer": "Immediately stop looking and return the information without discussing it", "explanation": "Professional ethics requires respecting confidential information. Immediate action to stop accessing and secure return of confidential data demonstrates integrity. Using or sharing confidential information violates trust and professional standards.", "difficulty": "easy", "tags": ["SJT", "ethics", "confidentiality"], "translations": {}}
{"id": "VR-SJT-0030", "type": "situational_test", "domain": "inclusivity", "scenario": "During a project planning meeting, you notice that suggestions from international team members are being dismissed more quickly than those from local staff. What do you do?", "choices": ["Accept that local staff might understand better", "Actively ensure all suggestions are given equal consideration", "Privately complain to international team members", "Point out the bias aggressively"], "answer_index": 1, "answer": "Actively ensure all suggestions are given equal consideration", "explanation": "Inclusive leadership involves ensuring equitable participation and consideration of all team members' contributions. Diverse perspectives strengthen decision-making. Accepting or ignoring bias perpetuates inequality and wastes valuable input.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "cultural_bias"], "translations": {}}
{"id": "VR-SJT-0031", "type": "situational_test", "domain": "conflict", "scenario": "Two departments are in conflict over resource allocation for the next quarter. Both have legitimate needs but resources are limited. How do you help resolve this?", "choices": ["Support your own department's interests", "Facilitate a data-driven discussion about priorities and trade-offs", "Suggest splitting resources equally regardless of needs", "Avoid involvement in resource conflicts"], "answer_index": 1, "answer": "Facilitate a data-driven discussion about priorities and trade-offs", "explanation": "Effective resource conflict resolution uses objective criteria and transparent decision-making. Data-driven discussions help move beyond emotional positions to rational allocation. Bias, arbitrary splits, or avoidance don't serve organizational interests.", "difficulty": "hard", "tags": ["SJT", "conflict", "resource_management"], "translations": {}}
{"id": "VR-SJT-0032", "type": "situational_test", "domain": "teamwork", "scenario": "Your team needs to complete a critical task, but the person with the most expertise, Salma, is overwhelmed with other responsibilities. How do you help?", "choices": ["Insist Salma prioritize your team's task", "Work with the team to redistribute workload and support Salma", "Assign the task to someone less qualified", "Complain to management about Salma's availability"], "answer_index": 1, "answer": "Work with the team to redistribute workload and support Salma", "explanation": "Collaborative teamwork involves finding solutions that help both the team and individual members. Redistributing workload leverages team resources effectively. Demanding priority or complaining doesn't solve underlying capacity issues.", "difficulty": "easy", "tags": ["SJT", "teamwork", "workload_management"], "translations": {}}
{"id": "VR-SJT-0033", "type": "situational_test", "domain": "leadership", "scenario": "Your organization is implementing major changes that your team is resisting. You personally have some concerns about the changes but need to lead the implementation. How do you proceed?", "choices": ["Publicly voice your concerns to validate team resistance", "Model professional acceptance while privately addressing concerns through proper channels", "Pretend to be fully supportive without any reservations", "Passively implement without engaging with team concerns"], "answer_index": 1, "answer": "Model professional acceptance while privately addressing concerns through proper channels", "explanation": "Leadership during change requires balancing personal opinions with professional responsibilities. Modeling acceptance while using appropriate channels for concerns demonstrates integrity and professionalism. Public resistance undermines implementation, while dishonesty damages credibility.", "difficulty": "hard", "tags": ["SJT", "leadership", "change_management"], "translations": {}}
{"id": "VR-SJT-0034", "type": "situational_test", "domain": "communication", "scenario": "You realize you made an error in a report that has already been distributed to key stakeholders. The error could affect their decision-making. What do you do?", "choices": ["Hope no one notices the error", "Immediately send a correction to all recipients with a clear explanation", "Wait to see if anyone asks about it", "Blame the error on someone else"], "answer_index": 1, "answer": "Immediately send a correction to all recipients with a clear explanation", "explanation": "Professional integrity requires promptly correcting errors that could affect others' decisions. Quick correction demonstrates accountability and reliability. Hiding errors or shifting blame damages professional credibility and relationships.", "difficulty": "easy", "tags": ["SJT", "communication", "accountability"], "translations": {}}
{"id": "VR-SJT-0035", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mr. Rahali, is using inappropriate language and being disrespectful to you during a service call. How do you handle this situation?", "choices": ["Respond with equal hostility", "Set professional boundaries calmly and focus on resolving their issue", "Immediately hang up", "Accept the abuse to maintain customer satisfaction"], "answer_index": 1, "answer": "Set professional boundaries calmly and focus on resolving their issue", "explanation": "Professional customer service maintains respect while attempting to help. Setting boundaries protects both parties and often de-escalates situations. Accepting abuse or responding hostilely doesn't serve anyone's interests effectively.", "difficulty": "medium", "tags": ["SJT", "customer_service", "boundary_setting"], "translations": {}}
{"id": "VR-SJT-0036", "type": "situational_test", "domain": "ethics", "scenario": "You witness a supervisor showing favoritism by giving the best assignments to employees who socialize with them outside work. What should you do?", "choices": ["Start socializing with the supervisor to get better assignments", "Document observations and report through appropriate channels", "Complain openly to other employees", "Ignore it since it doesn't directly affect you"], "answer_index": 1, "answer": "Document observations and report through appropriate channels", "explanation": "Workplace fairness requires addressing favoritism through proper channels. Documentation provides evidence for appropriate authorities to investigate. Participating in favoritism perpetuates the problem, while ignoring it allows unfair practices to continue.", "difficulty": "medium", "tags": ["SJT", "ethics", "workplace_fairness"], "translations": {}}
{"id": "VR-SJT-0037", "type": "situational_test", "domain": "inclusivity", "scenario": "You're organizing a team lunch and discover that the chosen restaurant doesn't accommodate dietary restrictions for several team members (halal, vegetarian, etc.). What do you do?", "choices": ["Keep the reservation since most people can eat there", "Find a restaurant that accommodates everyone's dietary needs", "Tell people with restrictions to eat beforehand", "Cancel the lunch entirely"], "answer_index": 1, "answer": "Find a restaurant that accommodates everyone's dietary needs", "explanation": "Inclusive planning ensures all team members can participate fully in team activities. Finding accommodating venues strengthens team relationships and demonstrates respect for diversity. Exclusion or cancellation doesn't serve team-building purposes.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "dietary_accommodation"], "translations": {}}
{"id": "VR-SJT-0038", "type": "situational_test", "domain": "conflict", "scenario": "You're mediating a dispute between Ahmed and Zineb about project methodology. Both are experts but have fundamentally different approaches. How do you proceed?", "choices": ["Choose the approach from the more senior person", "Help them find a hybrid approach that incorporates both perspectives", "Flip a coin to decide", "Let them argue it out without intervention"], "answer_index": 1, "answer": "Help them find a hybrid approach that incorporates both perspectives", "explanation": "Expert conflict often benefits from combining different perspectives rather than choosing sides. Facilitated synthesis can produce superior solutions. Arbitrary decisions or avoiding facilitation waste expertise and damage relationships.", "difficulty": "medium", "tags": ["SJT", "conflict", "expert_mediation"], "translations": {}}
{"id": "VR-SJT-0039", "type": "situational_test", "domain": "safety", "scenario": "You discover that a safety protocol is being regularly ignored because it slows down production. Management seems aware but hasn't acted. What do you do?", "choices": ["Follow everyone else and ignore the protocol", "Continue following safety protocols and document safety violations", "Complain informally to colleagues", "Speed up your own work to compensate"], "answer_index": 1, "answer": "Continue following safety protocols and document safety violations", "explanation": "Safety protocols exist to prevent accidents and legal liability. Individual compliance and documentation provide protection and evidence for addressing systemic issues. Ignoring safety or informal complaints don't address serious risks.", "difficulty": "hard", "tags": ["SJT", "safety", "protocol_compliance"], "translations": {}}
{"id": "VR-SJT-0040", "type": "situational_test", "domain": "teamwork", "scenario": "During a brainstorming session, Chaimaa proposes an idea that you think has been tried before and failed. How do you respond?", "choices": ["Immediately shoot down the idea as previously failed", "Share your knowledge constructively and explore what might be different now", "Stay silent to avoid discouraging creativity", "Support the idea even though you think it won't work"], "answer_index": 1, "answer": "Share your knowledge constructively and explore what might be different now", "explanation": "Constructive team contribution involves sharing relevant experience while remaining open to new possibilities. Circumstances change and ideas can be refined. Shutting down ideas or staying silent doesn't help team decision-making.", "difficulty": "easy", "tags": ["SJT", "teamwork", "idea_evaluation"], "translations": {}}
{"id": "VR-SJT-0041", "type": "situational_test", "domain": "leadership", "scenario": "Your team member Noureddine approaches you confidentially about feeling discriminated against by another supervisor. He's unsure about filing a formal complaint. How do you support him?", "choices": ["Tell him to handle it himself", "Listen supportively and help him understand his options and resources", "Immediately confront the other supervisor", "Discourage him from making waves"], "answer_index": 1, "answer": "Listen supportively and help him understand his options and resources", "explanation": "Supportive leadership involves helping team members navigate difficult situations while respecting their autonomy. Providing information about options and resources empowers informed decision-making. Dismissing concerns or taking unauthorized action doesn't serve the person's interests.", "difficulty": "hard", "tags": ["SJT", "leadership", "discrimination_support"], "translations": {}}
{"id": "VR-SJT-0042", "type": "situational_test", "domain": "communication", "scenario": "You need to present quarterly results that show your department underperformed against targets. How do you frame this communication?", "choices": ["Focus only on external factors that caused problems", "Present the facts honestly and include improvement plans", "Minimize the significance of missing targets", "Blame specific team members for the shortfall"], "answer_index": 1, "answer": "Present the facts honestly and include improvement plans", "explanation": "Professional communication about poor performance requires honesty and forward-looking solutions. Accountability and improvement planning demonstrate leadership and commitment. Blame, minimization, or excuse-making damages credibility and trust.", "difficulty": "medium", "tags": ["SJT", "communication", "performance_reporting"], "translations": {}}
{"id": "VR-SJT-0043", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mrs. Benali, complains about poor service from your company last month. You weren't involved, but your records show the complaint was already addressed and resolved. She remains unsatisfied. What do you do?", "choices": ["Tell her the matter is closed", "Review the previous resolution and see if additional steps are warranted", "Transfer her to the person who handled it originally", "Offer compensation to make her go away"], "answer_index": 1, "answer": "Review the previous resolution and see if additional steps are warranted", "explanation": "Quality customer service involves investigating persistent concerns even when previous action was taken. Customers may have legitimate ongoing issues not fully addressed initially. Dismissing concerns or offering inappropriate compensation doesn't serve long-term relationships.", "difficulty": "easy", "tags": ["SJT", "customer_service", "follow_up"], "translations": {}}
{"id": "VR-SJT-0044", "type": "situational_test", "domain": "ethics", "scenario": "Your company is bidding on a contract and you learn confidential information about a competitor's bid through a mutual contact. Using this information could help you win. What do you do?", "choices": ["Use the information since it was offered freely", "Decline to use the confidential information and compete fairly", "Share the information with your team", "Use it but don't tell anyone how you got it"], "answer_index": 1, "answer": "Decline to use the confidential information and compete fairly", "explanation": "Ethical business practices require fair competition without using improperly obtained confidential information. This maintains industry integrity and legal compliance. Using confidential competitor information could violate laws and damage business relationships.", "difficulty": "hard", "tags": ["SJT", "ethics", "fair_competition"], "translations": {}}
{"id": "VR-SJT-0045", "type": "situational_test", "domain": "inclusivity", "scenario": "You notice that newer team members, including Imane who recently graduated, aren't invited to informal knowledge-sharing sessions that could help their development. What do you do?", "choices": ["Let experienced staff manage their own informal groups", "Suggest including newer members and facilitating knowledge transfer", "Tell newer members they need to be more assertive", "Create separate sessions for new employees only"], "answer_index": 1, "answer": "Suggest including newer members and facilitating knowledge transfer", "explanation": "Inclusive development involves ensuring all team members have access to learning opportunities. Facilitating inclusion accelerates team development and knowledge sharing. Exclusion or segregation limits organizational learning and growth.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "knowledge_sharing"], "translations": {}}
{"id": "VR-SJT-0046", "type": "situational_test", "domain": "conflict", "scenario": "Your project team is deadlocked between two technical solutions. The deadline is approaching and the conflict is preventing progress. How do you break the deadlock?", "choices": ["Make an executive decision without consultation", "Establish decision criteria and evaluate options systematically", "Delay the decision until after the deadline", "Let the team vote without structured evaluation"], "answer_index": 1, "answer": "Establish decision criteria and evaluate options systematically", "explanation": "Structured decision-making helps teams move beyond deadlock by focusing on objective evaluation. Clear criteria enable rational comparison of options. Arbitrary decisions, delays, or unstructured voting don't resolve underlying disagreements effectively.", "difficulty": "medium", "tags": ["SJT", "conflict", "decision_deadlock"], "translations": {}}
{"id": "VR-SJT-0047", "type": "situational_test", "domain": "teamwork", "scenario": "Driss, a remote team member, seems disconnected from team activities and rarely participates in virtual meetings. How do you address this?", "choices": ["Ignore it since remote work is naturally isolating", "Reach out individually to understand barriers and offer support", "Complain about remote worker engagement to management", "Insist on mandatory camera-on policies for all meetings"], "answer_index": 1, "answer": "Reach out individually to understand barriers and offer support", "explanation": "Inclusive teamwork involves actively supporting all team members regardless of work location. Individual outreach can identify specific barriers and solutions for remote engagement. Ignoring or mandating without understanding doesn't address underlying issues.", "difficulty": "easy", "tags": ["SJT", "teamwork", "remote_inclusion"], "translations": {}}
{"id": "VR-SJT-0048", "type": "situational_test", "domain": "leadership", "scenario": "You need to implement a new process that will temporarily increase workload but improve long-term efficiency. Your team is already busy and resistant to change. How do you lead this implementation?", "choices": ["Implement without discussion to avoid resistance", "Involve the team in planning implementation to address concerns", "Delay implementation until the team is less busy", "Threaten consequences for non-compliance"], "answer_index": 1, "answer": "Involve the team in planning implementation to address concerns", "explanation": "Change leadership involves engaging team members in planning to address concerns and leverage their expertise. Participation increases buy-in and identifies implementation challenges. Authoritarian or avoidant approaches typically increase resistance and reduce effectiveness.", "difficulty": "hard", "tags": ["SJT", "leadership", "change_implementation"], "translations": {}}
{"id": "VR-SJT-0049", "type": "situational_test", "domain": "communication", "scenario": "You disagree with a decision made in a meeting with senior leadership present. Your expertise suggests a different approach would be better. How do you communicate your perspective?", "choices": ["Stay silent to avoid contradicting leadership", "Respectfully present your perspective with supporting rationale", "Aggressively argue against the decision", "Complain about the decision after the meeting"], "answer_index": 1, "answer": "Respectfully present your perspective with supporting rationale", "explanation": "Professional communication includes respectfully sharing expertise even when it differs from senior positions. Well-reasoned input helps organizations make better decisions. Silence wastes valuable expertise, while aggressive or backdoor communication is unprofessional.", "difficulty": "medium", "tags": ["SJT", "communication", "speaking_up"], "translations": {}}
{"id": "VR-SJT-0050", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mr. Idrissi, wants to return a product that's slightly outside your return policy timeframe but claims he wasn't informed about the time limit. The product is in perfect condition. How do you handle this?", "choices": ["Strictly enforce the policy regardless of circumstances", "Consider the circumstances and find a customer-friendly solution within reason", "Immediately approve the return without question", "Make the customer prove he wasn't informed about the policy"], "answer_index": 1, "answer": "Consider the circumstances and find a customer-friendly solution within reason", "explanation": "Good customer service balances policy compliance with reasonable flexibility for genuine circumstances. Considering context while maintaining general standards serves both customer needs and business interests. Rigid enforcement or automatic approval don't optimize outcomes.", "difficulty": "easy", "tags": ["SJT", "customer_service", "policy_flexibility"], "translations": {}}
{"id": "VR-SJT-0051", "type": "situational_test", "domain": "teamwork", "scenario": "Your teammate Khadija is working from home and seems disconnected from the team's daily activities. She completes her tasks but doesn't participate in informal discussions that help team cohesion. How do you address this?", "choices": ["Let her work in isolation since she's productive", "Proactively include her in team communications and check in regularly", "Complain to management about remote worker engagement", "Ignore her since remote workers are naturally less involved"], "answer_index": 1, "answer": "Proactively include her in team communications and check in regularly", "explanation": "Inclusive teamwork means actively engaging all members regardless of work location. Regular check-ins and intentional inclusion help maintain team bonds and ensure everyone feels valued and connected.", "difficulty": "easy", "tags": ["SJT", "teamwork", "remote_work"], "translations": {}}
{"id": "VR-SJT-0052", "type": "situational_test", "domain": "leadership", "scenario": "Your team has been consistently high-performing, but you notice increasing signs of stress and potential burnout among members. Productivity is still good but team morale seems low. How do you address this?", "choices": ["Ignore it since productivity is still good", "Implement wellness initiatives and reassess workload distribution", "Push harder to maintain high performance standards", "Wait for team members to complain before acting"], "answer_index": 1, "answer": "Implement wellness initiatives and reassess workload distribution", "explanation": "Proactive leadership addresses team wellbeing before it affects performance. Sustainable high performance requires attention to team morale and stress levels. Waiting for problems to escalate or ignoring early warning signs risks team burnout.", "difficulty": "medium", "tags": ["SJT", "leadership", "team_wellness"], "translations": {}}
{"id": "VR-SJT-0053", "type": "situational_test", "domain": "communication", "scenario": "During a client call, you realize your colleague Samir provided incorrect information in a previous meeting. The client is making decisions based on this wrong information. What do you do?", "choices": ["Continue with the call and address it privately later", "Politely correct the information and clarify the accurate details", "Wait until after the call to send corrected information", "Let the client proceed with the wrong information"], "answer_index": 1, "answer": "Politely correct the information and clarify the accurate details", "explanation": "Professional integrity requires immediate correction of misinformation that could affect client decisions. Tactful correction maintains trust and prevents poor outcomes while respecting colleague relationships.", "difficulty": "medium", "tags": ["SJT", "communication", "error_correction"], "translations": {}}
{"id": "VR-SJT-0054", "type": "situational_test", "domain": "customer_service", "scenario": "Mrs. Lahlou calls upset because her order was delivered to the wrong address due to a system error. She needs the items urgently for an event tomorrow. How do you handle this?", "choices": ["Tell her it's not your fault and she'll have to wait", "Apologize and expedite a replacement delivery while investigating the error", "Offer a refund but explain delivery isn't possible", "Transfer her to someone else to handle"], "answer_index": 1, "answer": "Apologize and expedite a replacement delivery while investigating the error", "explanation": "Effective customer service takes ownership of problems regardless of cause and focuses on solutions. Expediting resolution while investigating prevents future issues and demonstrates commitment to customer satisfaction.", "difficulty": "easy", "tags": ["SJT", "customer_service", "problem_resolution"], "translations": {}}
{"id": "VR-SJT-0055", "type": "situational_test", "domain": "ethics", "scenario": "You discover that your department's budget reports have been consistently overstating expenses to secure larger budget allocations next year. Your supervisor seems aware of this practice. What do you do?", "choices": ["Participate since everyone else is doing it", "Document the discrepancies and report through appropriate channels", "Confront your supervisor directly and demand changes", "Look for another job to avoid the situation"], "answer_index": 1, "answer": "Document the discrepancies and report through appropriate channels", "explanation": "Financial integrity requires reporting fraudulent practices through proper channels. Documentation provides evidence for investigation. Participating in fraud or avoiding reporting perpetuates unethical behavior and potential legal violations.", "difficulty": "hard", "tags": ["SJT", "ethics", "financial_integrity"], "translations": {}}
{"id": "VR-SJT-0056", "type": "situational_test", "domain": "inclusivity", "scenario": "You notice that meeting times consistently conflict with prayer times for your Muslim colleagues, causing them to miss important discussions. What should you do?", "choices": ["Keep current meeting times since they work for most people", "Suggest adjusting meeting schedules to accommodate religious observances", "Tell the affected colleagues to prioritize work over religious practices", "Hold separate meetings for those who can't attend"], "answer_index": 1, "answer": "Suggest adjusting meeting schedules to accommodate religious observances", "explanation": "Inclusive workplace practices involve accommodating religious observances when possible. Adjusting schedules demonstrates respect for diversity and ensures all team members can participate fully in important discussions.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "religious_accommodation"], "translations": {}}
{"id": "VR-SJT-0057", "type": "situational_test", "domain": "conflict", "scenario": "Mehdi and Layla are in a heated disagreement about budget allocation for their respective projects. Both have valid arguments but the tension is affecting the entire team's productivity. How do you intervene?", "choices": ["Let them work it out themselves", "Facilitate a structured discussion focused on objective criteria and shared goals", "Support the person you think is right", "Escalate to senior management immediately"], "answer_index": 1, "answer": "Facilitate a structured discussion focused on objective criteria and shared goals", "explanation": "Effective conflict resolution uses structured approaches to move from emotional positions to rational evaluation. Focusing on objective criteria and shared organizational goals helps find mutually acceptable solutions.", "difficulty": "medium", "tags": ["SJT", "conflict", "budget_disputes"], "translations": {}}
{"id": "VR-SJT-0058", "type": "situational_test", "domain": "safety", "scenario": "You observe a colleague taking shortcuts with safety procedures to meet a tight deadline. The shortcuts haven't caused accidents yet but increase risk significantly. What do you do?", "choices": ["Report them to management immediately", "Talk to them about the risks and offer to help find safer alternatives", "Ignore it since no accidents have occurred", "Take similar shortcuts to help meet the deadline"], "answer_index": 1, "answer": "Talk to them about the risks and offer to help find safer alternatives", "explanation": "Peer intervention in safety matters is most effective when it's supportive and solution-focused. Offering alternatives shows concern for both safety and deadline pressures while maintaining colleague relationships.", "difficulty": "medium", "tags": ["SJT", "safety", "deadline_pressure"], "translations": {}}
{"id": "VR-SJT-0059", "type": "situational_test", "domain": "teamwork", "scenario": "Yassine, a new team member, has great technical skills but struggles with the team's collaborative working style. He prefers to work independently and rarely shares progress updates. How do you help?", "choices": ["Let him work his way since he's technically competent", "Pair him with a mentor and gradually introduce collaborative practices", "Force him to participate in all team activities immediately", "Recommend reassigning him to individual projects"], "answer_index": 1, "answer": "Pair him with a mentor and gradually introduce collaborative practices", "explanation": "Effective team integration requires patience and support. Mentoring and gradual introduction to collaborative practices helps people adapt while leveraging their strengths. Forcing immediate change or isolation doesn't build long-term team success.", "difficulty": "easy", "tags": ["SJT", "teamwork", "onboarding"], "translations": {}}
{"id": "VR-SJT-0060", "type": "situational_test", "domain": "leadership", "scenario": "A major client is threatening to cancel their contract due to dissatisfaction with service quality. Your team is partially responsible, but other departments contributed to the problems. How do you respond?", "choices": ["Blame other departments to protect your team", "Take full accountability and focus on comprehensive solutions", "Minimize your team's role in the problems", "Suggest the client is being unreasonable"], "answer_index": 1, "answer": "Take full accountability and focus on comprehensive solutions", "explanation": "Crisis leadership requires taking responsibility and focusing on solutions rather than blame. Comprehensive problem-solving that addresses all contributing factors demonstrates leadership and increases chances of client retention.", "difficulty": "hard", "tags": ["SJT", "leadership", "crisis_management"], "translations": {}}
{"id": "VR-SJT-0061", "type": "situational_test", "domain": "communication", "scenario": "You need to announce layoffs affecting several team members. Some affected employees are friends, and others are high performers. How do you communicate this decision?", "choices": ["Avoid the conversation and let HR handle everything", "Communicate with transparency, empathy, and support for affected individuals", "Announce it quickly to get it over with", "Give advance warning only to your friends"], "answer_index": 1, "answer": "Communicate with transparency, empathy, and support for affected individuals", "explanation": "Difficult communications require transparency, empathy, and fairness. Providing support and clear information while treating all affected individuals equally maintains trust and demonstrates professional integrity during challenging times.", "difficulty": "hard", "tags": ["SJT", "communication", "layoffs"], "translations": {}}
{"id": "VR-SJT-0062", "type": "situational_test", "domain": "customer_service", "scenario": "A VIP customer, Mr. Benjelloun, is demanding immediate service that would require skipping ahead of other waiting customers. He emphasizes his importance to the company. How do you respond?", "choices": ["Immediately prioritize him to keep the VIP happy", "Explain the service process and offer alternative solutions within the system", "Tell him he has to wait like everyone else", "Have a manager decide what to do"], "answer_index": 1, "answer": "Explain the service process and offer alternative solutions within the system", "explanation": "Professional service maintains fairness while seeking creative solutions. Explaining processes and offering alternatives respects all customers while acknowledging VIP status through appropriate channels rather than unfair queue-jumping.", "difficulty": "medium", "tags": ["SJT", "customer_service", "vip_handling"], "translations": {}}
{"id": "VR-SJT-0063", "type": "situational_test", "domain": "ethics", "scenario": "A vendor offers you expensive event tickets as appreciation for your business relationship. Accepting them might influence future purchasing decisions. What do you do?", "choices": ["Accept them since they're a gift", "Politely decline and explain potential conflict of interest", "Accept but pay for them at market value", "Accept them but don't attend the event"], "answer_index": 1, "answer": "Politely decline and explain potential conflict of interest", "explanation": "Ethical business relationships require avoiding situations that could create conflicts of interest. Declining gifts that might influence decisions maintains professional integrity and protects both parties from ethical complications.", "difficulty": "easy", "tags": ["SJT", "ethics", "conflict_of_interest"], "translations": {}}
{"id": "VR-SJT-0064", "type": "situational_test", "domain": "inclusivity", "scenario": "During team presentations, you notice that ideas from younger team members like Salma are often dismissed quickly, while similar ideas from senior members get serious consideration. How do you address this?", "choices": ["Accept that experience matters in evaluation", "Actively advocate for equal consideration of all ideas regardless of source", "Tell younger members their ideas need more development", "Focus only on your own contributions"], "answer_index": 1, "answer": "Actively advocate for equal consideration of all ideas regardless of source", "explanation": "Inclusive environments ensure ideas are evaluated on merit rather than source. Advocating for equal consideration helps prevent age bias and ensures valuable contributions aren't lost due to unconscious discrimination.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "age_bias"], "translations": {}}
{"id": "VR-SJT-0065", "type": "situational_test", "domain": "conflict", "scenario": "The marketing and sales departments are in constant conflict over lead quality and follow-up procedures. This ongoing tension is affecting company performance. How would you help resolve this?", "choices": ["Stay out of inter-departmental politics", "Organize a joint workshop to align on shared goals and processes", "Support whichever department you work with more", "Let senior management handle departmental conflicts"], "answer_index": 1, "answer": "Organize a joint workshop to align on shared goals and processes", "explanation": "Systemic conflicts require collaborative solutions that address root causes. Joint workshops help departments understand each other's perspectives and develop aligned processes that serve shared organizational goals.", "difficulty": "hard", "tags": ["SJT", "conflict", "inter_departmental"], "translations": {}}
{"id": "VR-SJT-0066", "type": "situational_test", "domain": "safety", "scenario": "During a busy period, you notice that the emergency exit is blocked by equipment and supplies. Moving them would take time and disrupt ongoing work. What do you do?", "choices": ["Leave it until the busy period ends", "Immediately clear the emergency exit regardless of disruption", "Report it to facilities but continue working", "Work around it since emergencies are unlikely"], "answer_index": 1, "answer": "Immediately clear the emergency exit regardless of disruption", "explanation": "Emergency exits must remain clear at all times as they are critical for life safety. No work priority supersedes basic safety requirements. Delays in addressing safety violations put everyone at risk.", "difficulty": "easy", "tags": ["SJT", "safety", "emergency_procedures"], "translations": {}}
{"id": "VR-SJT-0067", "type": "situational_test", "domain": "teamwork", "scenario": "Your team is celebrating a successful project completion, but team member Hakim, who contributed significantly, can't attend due to a family obligation. How do you ensure he's included in the recognition?", "choices": ["Proceed with the celebration as planned", "Find ways to include him virtually and acknowledge his contributions publicly", "Postpone the celebration until he can attend", "Give him recognition separately later"], "answer_index": 1, "answer": "Find ways to include him virtually and acknowledge his contributions publicly", "explanation": "Inclusive team recognition ensures all contributors are acknowledged regardless of attendance. Virtual inclusion and public recognition show that the team values all members and their contributions equally.", "difficulty": "easy", "tags": ["SJT", "teamwork", "recognition"], "translations": {}}
{"id": "VR-SJT-0068", "type": "situational_test", "domain": "leadership", "scenario": "You discover that a policy you advocated for and implemented is causing unintended negative consequences for your team. Team members are frustrated but haven't directly confronted you. How do you handle this?", "choices": ["Wait for team members to voice complaints directly", "Proactively acknowledge the issues and work with the team to find solutions", "Defend the policy and explain why it's necessary", "Quietly modify the policy without acknowledging problems"], "answer_index": 1, "answer": "Proactively acknowledge the issues and work with the team to find solutions", "explanation": "Leadership accountability involves recognizing and addressing problems even when they stem from your own decisions. Proactive acknowledgment and collaborative problem-solving demonstrate integrity and commitment to team success.", "difficulty": "hard", "tags": ["SJT", "leadership", "accountability"], "translations": {}}
{"id": "VR-SJT-0069", "type": "situational_test", "domain": "communication", "scenario": "You receive a project update email with significant errors from colleague Zineb. The email was sent to multiple stakeholders including senior management. How do you respond?", "choices": ["Reply to all pointing out the errors immediately", "Contact Zineb privately first, then send a careful correction to stakeholders", "Ignore the errors and let others figure it out", "Send a separate email with correct information without mentioning the errors"], "answer_index": 1, "answer": "Contact Zineb privately first, then send a careful correction to stakeholders", "explanation": "Professional communication balances accuracy with respect for colleagues. Private consultation allows for understanding and collaborative correction, while ensuring stakeholders receive accurate information promptly.", "difficulty": "medium", "tags": ["SJT", "communication", "colleague_errors"], "translations": {}}
{"id": "VR-SJT-0070", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mrs. Fakir, is requesting a service that your company doesn't typically provide, but you know it's technically possible with some effort. She's willing to pay extra. How do you respond?", "choices": ["Refuse because it's not a standard service", "Explore the possibility and discuss feasibility with relevant teams", "Promise to deliver it without checking feasibility", "Suggest she find another company"], "answer_index": 1, "answer": "Explore the possibility and discuss feasibility with relevant teams", "explanation": "Customer-focused service involves exploring solutions for unique requests when possible. Investigating feasibility shows commitment to customer needs while ensuring realistic promises based on actual capabilities.", "difficulty": "easy", "tags": ["SJT", "customer_service", "custom_solutions"], "translations": {}}
{"id": "VR-SJT-0071", "type": "situational_test", "domain": "ethics", "scenario": "You learn that a competitor's employee is willing to share confidential information about their upcoming product launch in exchange for job consideration. What do you do?", "choices": ["Accept the information since they offered it", "Decline the information and report the approach to your ethics department", "Listen to the information but don't use it", "Use the information but don't hire the person"], "answer_index": 1, "answer": "Decline the information and report the approach to your ethics department", "explanation": "Ethical business practices prohibit accepting confidential competitor information obtained improperly. Reporting such approaches protects your company from legal and ethical violations while maintaining industry integrity.", "difficulty": "hard", "tags": ["SJT", "ethics", "competitor_intelligence"], "translations": {}}
{"id": "VR-SJT-0072", "type": "situational_test", "domain": "inclusivity", "scenario": "You're planning a company retreat and discover that the selected venue is not wheelchair accessible, which would exclude team member Kamal who uses a wheelchair. The venue is already booked and changing would be expensive. What do you do?", "choices": ["Keep the venue and apologize to Kamal", "Change to an accessible venue regardless of cost", "Offer to have Kamal participate remotely", "Ask Kamal to pay the difference for venue change"], "answer_index": 1, "answer": "Change to an accessible venue regardless of cost", "explanation": "Inclusive planning requires ensuring all team members can participate fully. Accessibility is not optional and the cost of inclusion is an investment in team equity and legal compliance. Exclusion damages team relationships and may violate disability laws.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "accessibility"], "translations": {}}
{"id": "VR-SJT-0073", "type": "situational_test", "domain": "conflict", "scenario": "Nadia and Hassan are both excellent performers but have personality conflicts that create tension during joint projects. Their conflict is starting to affect project outcomes. How do you address this?", "choices": ["Assign them to separate projects permanently", "Facilitate conflict resolution focused on work collaboration", "Ignore it since they're both good performers", "Let them work it out themselves"], "answer_index": 1, "answer": "Facilitate conflict resolution focused on work collaboration", "explanation": "Performance conflicts require active intervention to maintain team effectiveness. Facilitated resolution helps individuals find ways to collaborate professionally despite personal differences, preserving both talent and project outcomes.", "difficulty": "medium", "tags": ["SJT", "conflict", "personality_conflicts"], "translations": {}}
{"id": "VR-SJT-0074", "type": "situational_test", "domain": "safety", "scenario": "A client insists on visiting a work area that requires safety equipment, but claims they don't have time for the safety briefing and equipment fitting. They're an important client. What do you do?", "choices": ["Allow the visit to maintain client relations", "Insist on full safety compliance regardless of client status", "Give a quick verbal briefing instead of the full procedure", "Let them visit only 'safe' areas without equipment"], "answer_index": 1, "answer": "Insist on full safety compliance regardless of client status", "explanation": "Safety requirements apply to everyone without exception. Client status doesn't override safety protocols designed to prevent injuries. Maintaining safety standards protects both visitors and the organization from liability.", "difficulty": "easy", "tags": ["SJT", "safety", "client_safety"], "translations": {}}
{"id": "VR-SJT-0075", "type": "situational_test", "domain": "teamwork", "scenario": "Your team member Rajae has been making excellent contributions but recently seems disengaged and less participative in team discussions. Her work quality remains good. How do you approach this?", "choices": ["Ignore it since her work quality is still good", "Have a private conversation to understand if she needs support", "Address it publicly in the next team meeting", "Report your concerns to HR immediately"], "answer_index": 1, "answer": "Have a private conversation to understand if she needs support", "explanation": "Changes in engagement often signal underlying issues that supportive conversation can address. Private discussion shows care for team members as individuals and may reveal ways to help or accommodate changing circumstances.", "difficulty": "easy", "tags": ["SJT", "teamwork", "member_support"], "translations": {}}
{"id": "VR-SJT-0076", "type": "situational_test", "domain": "leadership", "scenario": "Your organization is implementing new technology that will eliminate several job positions. As a leader, you need to manage the transition while maintaining team morale and productivity. How do you approach this?", "choices": ["Keep the changes secret until the last moment", "Communicate transparently about changes and support affected employees", "Focus only on the benefits of new technology", "Let HR handle all communications about job impacts"], "answer_index": 1, "answer": "Communicate transparently about changes and support affected employees", "explanation": "Change leadership requires honest communication and support for affected individuals. Transparency builds trust and allows for planning, while support demonstrates organizational values during difficult transitions.", "difficulty": "hard", "tags": ["SJT", "leadership", "organizational_change"], "translations": {}}
{"id": "VR-SJT-0077", "type": "situational_test", "domain": "communication", "scenario": "You made a promise to a client about delivery dates that you now realize cannot be met due to supply chain issues beyond your control. The client has planned their operations around your promised timeline. How do you communicate this?", "choices": ["Wait until the last moment to inform them", "Immediately contact them with honest explanation and alternative solutions", "Try to find someone else to blame for the delay", "Deliver partially and explain the rest will come later"], "answer_index": 1, "answer": "Immediately contact them with honest explanation and alternative solutions", "explanation": "Professional integrity requires prompt, honest communication about problems with proactive solution-seeking. Early notification allows clients to adjust their plans and demonstrates reliability even when facing challenges.", "difficulty": "medium", "tags": ["SJT", "communication", "delivery_delays"], "translations": {}}
{"id": "VR-SJT-0078", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mr. Bouazza, is angry about a billing error that caused him embarrassment when his payment was declined publicly. The error was genuine and has been corrected. How do you address his emotional distress?", "choices": ["Tell him the error is fixed and that should be enough", "Acknowledge his embarrassment, apologize sincerely, and discuss additional remedies", "Blame the billing system and distance yourself from responsibility", "Offer a small discount and hope he moves on"], "answer_index": 1, "answer": "Acknowledge his embarrassment, apologize sincerely, and discuss additional remedies", "explanation": "Service recovery requires acknowledging emotional impact beyond just fixing technical problems. Sincere apologies and discussion of appropriate remedies demonstrate understanding of customer experience and commitment to relationship repair.", "difficulty": "medium", "tags": ["SJT", "customer_service", "service_recovery"], "translations": {}}
{"id": "VR-SJT-0079", "type": "situational_test", "domain": "ethics", "scenario": "You notice that expense reports from your department consistently include questionable items that technically meet policy requirements but violate the spirit of expense guidelines. What do you do?", "choices": ["Continue since they technically comply with policy", "Raise concerns about expense practices with appropriate leadership", "Start including similar items in your own expenses", "Ignore it since it's not your responsibility"], "answer_index": 1, "answer": "Raise concerns about expense practices with appropriate leadership", "explanation": "Ethical responsibility extends beyond technical compliance to include the spirit of policies. Raising concerns about practices that violate intended guidelines helps maintain organizational integrity and prevents escalation of problematic behavior.", "difficulty": "medium", "tags": ["SJT", "ethics", "expense_policies"], "translations": {}}
{"id": "VR-SJT-0080", "type": "situational_test", "domain": "inclusivity", "scenario": "You discover that job postings for your team consistently use language that may discourage diverse candidates (e.g., 'ninja', 'rockstar', 'aggressive'). What should you do?", "choices": ["Keep the language since it attracts confident candidates", "Suggest revising job postings to use more inclusive language", "Add a diversity statement to balance the language", "Let HR handle all posting language decisions"], "answer_index": 1, "answer": "Suggest revising job postings to use more inclusive language", "explanation": "Inclusive hiring starts with inclusive job postings. Language that may discourage diverse candidates limits talent acquisition and contradicts diversity goals. Proactive revision demonstrates commitment to inclusive practices.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "hiring_practices"], "translations": {}}
{"id": "VR-SJT-0081", "type": "situational_test", "domain": "conflict", "scenario": "Two departments are deadlocked over resource allocation for a critical project. Both have legitimate needs but limited resources mean only one can be fully funded. How do you help resolve this?", "choices": ["Support the department with the loudest voice", "Facilitate a data-driven evaluation of project impacts and organizational priorities", "Suggest splitting resources equally", "Let senior management make the decision without input"], "answer_index": 1, "answer": "Facilitate a data-driven evaluation of project impacts and organizational priorities", "explanation": "Resource conflicts require objective evaluation based on organizational impact and strategic priorities. Data-driven analysis helps move beyond departmental advocacy to decisions that serve overall organizational goals.", "difficulty": "hard", "tags": ["SJT", "conflict", "resource_allocation"], "translations": {}}
{"id": "VR-SJT-0082", "type": "situational_test", "domain": "teamwork", "scenario": "Fouad, a highly skilled team member, prefers to work alone and often completes tasks without consulting others, even when collaboration would improve outcomes. How do you address this?", "choices": ["Let him work alone since he's effective", "Coach him on the value of collaboration and create structured collaboration opportunities", "Force him to work only on team assignments", "Assign him only to individual projects"], "answer_index": 1, "answer": "Coach him on the value of collaboration and create structured collaboration opportunities", "explanation": "Individual contributors can be coached to see collaboration benefits through structured opportunities and clear value demonstration. This approach leverages individual strengths while building team capabilities.", "difficulty": "medium", "tags": ["SJT", "teamwork", "individual_contributors"], "translations": {}}
{"id": "VR-SJT-0083", "type": "situational_test", "domain": "leadership", "scenario": "You need to deliver news that a popular company benefit is being eliminated due to budget constraints. The team will likely react negatively. How do you communicate this decision?", "choices": ["Deliver the news quickly and move on", "Provide context, acknowledge disappointment, and discuss what benefits remain", "Blame upper management for the decision", "Delay the announcement as long as possible"], "answer_index": 1, "answer": "Provide context, acknowledge disappointment, and discuss what benefits remain", "explanation": "Difficult announcements require context, empathy, and focus on what remains positive. Acknowledging legitimate disappointment while providing rationale helps maintain trust and team relationships during challenging decisions.", "difficulty": "easy", "tags": ["SJT", "leadership", "benefit_changes"], "translations": {}}
{"id": "VR-SJT-0084", "type": "situational_test", "domain": "communication", "scenario": "You're presenting quarterly results to stakeholders and the data shows your department significantly underperformed. Some stakeholders seem hostile. How do you present this information?", "choices": ["Focus only on external factors that caused problems", "Present data honestly while emphasizing improvement plans and lessons learned", "Minimize the significance of the poor performance", "Deflect attention to other departments' performance"], "answer_index": 1, "answer": "Present data honestly while emphasizing improvement plans and lessons learned", "explanation": "Professional accountability requires honest presentation of poor results combined with forward-looking improvement strategies. This approach maintains credibility while demonstrating learning and commitment to better performance.", "difficulty": "hard", "tags": ["SJT", "communication", "performance_accountability"], "translations": {}}
{"id": "VR-SJT-0085", "type": "situational_test", "domain": "customer_service", "scenario": "A long-standing customer, Mrs. Tahiri, has become increasingly demanding and rude to staff members. Her business is valuable but her behavior is affecting team morale. How do you handle this?", "choices": ["Accept the behavior since she's a valuable customer", "Set professional boundaries while maintaining service quality", "Refuse to serve her anymore", "Assign only senior staff to handle her"], "answer_index": 1, "answer": "Set professional boundaries while maintaining service quality", "explanation": "Professional relationships require mutual respect. Setting boundaries protects staff while maintaining service quality. Accepting abusive behavior damages team morale and sets poor precedents for appropriate conduct.", "difficulty": "medium", "tags": ["SJT", "customer_service", "difficult_customers"], "translations": {}}
{"id": "VR-SJT-0086", "type": "situational_test", "domain": "ethics", "scenario": "During recruitment, you learn personal information about a candidate's family situation that makes you concerned about their availability, even though they haven't disclosed this and it's not relevant to job requirements. How do you proceed?", "choices": ["Use the information to inform your hiring decision", "Ignore the personal information and focus only on job-related qualifications", "Ask the candidate directly about the situation", "Share the information with other interviewers"], "answer_index": 1, "answer": "Ignore the personal information and focus only on job-related qualifications", "explanation": "Ethical hiring requires focusing only on job-relevant qualifications and ignoring personal information that could lead to discrimination. Using irrelevant personal information in hiring decisions violates professional standards and may be illegal.", "difficulty": "easy", "tags": ["SJT", "ethics", "hiring_discrimination"], "translations": {}}
{"id": "VR-SJT-0087", "type": "situational_test", "domain": "inclusivity", "scenario": "You notice that informal networking opportunities in your organization tend to exclude employees who have caregiving responsibilities and can't participate in after-hours socializing. What do you do?", "choices": ["Keep current networking as it works for most people", "Advocate for diverse networking opportunities that accommodate different schedules", "Tell caregivers they need to make work networking a priority", "Create separate networking events for different groups"], "answer_index": 1, "answer": "Advocate for diverse networking opportunities that accommodate different schedules", "explanation": "Inclusive professional development ensures all employees have access to networking opportunities regardless of personal circumstances. Diverse scheduling accommodates different life situations and prevents systematic exclusion from career development.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "networking_access"], "translations": {}}
{"id": "VR-SJT-0088", "type": "situational_test", "domain": "conflict", "scenario": "Your project team is split between two technical approaches with passionate advocates on both sides. The deadline is approaching and the debate is preventing progress. How do you break the deadlock?", "choices": ["Choose the approach recommended by the most senior person", "Establish clear decision criteria and evaluate both options systematically", "Flip a coin to make a quick decision", "Implement both approaches in parallel"], "answer_index": 1, "answer": "Establish clear decision criteria and evaluate both options systematically", "explanation": "Technical deadlocks require structured decision-making based on objective criteria. Systematic evaluation helps teams move beyond emotional advocacy to rational choices that serve project goals.", "difficulty": "medium", "tags": ["SJT", "conflict", "technical_decisions"], "translations": {}}
{"id": "VR-SJT-0089", "type": "situational_test", "domain": "safety", "scenario": "You notice that safety training completion rates in your department are very low because employees say they're too busy with urgent work. Management hasn't enforced completion. What do you do?", "choices": ["Continue focusing on urgent work since safety training can wait", "Advocate for mandatory safety training completion with management support", "Complete only your own training", "Suggest optional safety training to make it more appealing"], "answer_index": 1, "answer": "Advocate for mandatory safety training completion with management support", "explanation": "Safety training is non-negotiable for workplace protection. Advocating for enforcement ensures all employees receive necessary safety knowledge. Work urgency doesn't override safety requirements which prevent accidents and legal liability.", "difficulty": "easy", "tags": ["SJT", "safety", "training_compliance"], "translations": {}}
{"id": "VR-SJT-0090", "type": "situational_test", "domain": "teamwork", "scenario": "Your team is under pressure to deliver a project quickly. Team member Nawal suggests cutting quality checks to save time, arguing that problems can be fixed later. How do you respond?", "choices": ["Support the suggestion to meet the deadline", "Advocate for maintaining quality standards and exploring other time-saving options", "Let the team vote on whether to cut quality checks", "Secretly maintain quality checks without telling anyone"], "answer_index": 1, "answer": "Advocate for maintaining quality standards and exploring other time-saving options", "explanation": "Quality standards protect long-term project success and organizational reputation. Advocating for standards while exploring alternatives demonstrates commitment to excellence and creative problem-solving under pressure.", "difficulty": "easy", "tags": ["SJT", "teamwork", "quality_standards"], "translations": {}}
{"id": "VR-SJT-0091", "type": "situational_test", "domain": "leadership", "scenario": "A star performer in your team, Anass, is being recruited by competitors and has confided that he's considering leaving due to limited advancement opportunities. How do you respond?", "choices": ["Accept that good people leave and start looking for replacements", "Work with him to identify advancement paths and address his concerns", "Try to convince him to stay without addressing underlying issues", "Counteract with immediate promotion promises you can't guarantee"], "answer_index": 1, "answer": "Work with him to identify advancement paths and address his concerns", "explanation": "Retention of top talent requires addressing underlying concerns about career development. Collaborative exploration of advancement opportunities shows investment in employee growth and may reveal achievable solutions.", "difficulty": "hard", "tags": ["SJT", "leadership", "talent_retention"], "translations": {}}
{"id": "VR-SJT-0092", "type": "situational_test", "domain": "communication", "scenario": "You discover that information you shared in confidence with a colleague has been spread to others in the organization. This breach of confidence could affect your reputation. How do you address this?", "choices": ["Confront them publicly about the breach", "Have a private conversation about the importance of confidentiality", "Stop sharing any information with anyone", "Spread negative information about them in return"], "answer_index": 1, "answer": "Have a private conversation about the importance of confidentiality", "explanation": "Breaches of confidence require direct but professional discussion about trust and communication expectations. Private conversation allows for understanding and relationship repair while clearly establishing boundaries for future interactions.", "difficulty": "medium", "tags": ["SJT", "communication", "confidentiality"], "translations": {}}
{"id": "VR-SJT-0093", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mr. Radi, wants to make a purchase that you believe is not in his best interest based on his stated needs and budget. He insists on proceeding. How do you handle this?", "choices": ["Complete the sale since he's insisting", "Provide honest advice about better alternatives while respecting his autonomy", "Refuse to complete the sale", "Complete the sale but add extra services"], "answer_index": 1, "answer": "Provide honest advice about better alternatives while respecting his autonomy", "explanation": "Ethical customer service balances honest advice with customer autonomy. Providing information about better alternatives demonstrates integrity and customer focus while respecting the customer's right to make their own decisions.", "difficulty": "easy", "tags": ["SJT", "customer_service", "ethical_sales"], "translations": {}}
{"id": "VR-SJT-0094", "type": "situational_test", "domain": "ethics", "scenario": "You accidentally receive access to confidential salary information for all employees in your department. You notice significant pay disparities that seem unfair. What should you do?", "choices": ["Use the information to negotiate your own salary", "Immediately report the security breach and pay disparities to appropriate authorities", "Share the information with affected colleagues", "Keep the information but use it to help others indirectly"], "answer_index": 1, "answer": "Immediately report the security breach and pay disparities to appropriate authorities", "explanation": "Accidental access to confidential information requires immediate reporting to address both security issues and potential fairness problems. Proper channels can investigate disparities while maintaining confidentiality and legal compliance.", "difficulty": "hard", "tags": ["SJT", "ethics", "pay_equity"], "translations": {}}
{"id": "VR-SJT-0095", "type": "situational_test", "domain": "inclusivity", "scenario": "Your team's social media celebrations consistently feature the same types of employees (young, single, outgoing) while quieter or different team members are rarely highlighted. What do you do?", "choices": ["Continue with current approach since it generates good engagement", "Advocate for more diverse representation in team communications", "Tell overlooked employees to be more social", "Create separate communications for different employee types"], "answer_index": 1, "answer": "Advocate for more diverse representation in team communications", "explanation": "Inclusive communication represents the full diversity of team members and their contributions. Ensuring varied representation in external communications demonstrates organizational values and helps all employees feel valued and recognized.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "representation"], "translations": {}}
{"id": "VR-SJT-0096", "type": "situational_test", "domain": "conflict", "scenario": "Samira and Khalil from different shifts have conflicting views on handover procedures. Their disagreement is causing errors and affecting 24-hour operations. How do you help resolve this?", "choices": ["Let each shift handle procedures their own way", "Facilitate development of standardized procedures both shifts can support", "Side with the day shift since they handle more volume", "Have management impose procedures without input"], "answer_index": 1, "answer": "Facilitate development of standardized procedures both shifts can support", "explanation": "Operational conflicts require collaborative solutions that ensure consistency across shifts. Facilitating joint development of procedures ensures buy-in from all parties and creates sustainable solutions for continuous operations.", "difficulty": "medium", "tags": ["SJT", "conflict", "operational_procedures"], "translations": {}}
{"id": "VR-SJT-0097", "type": "situational_test", "domain": "safety", "scenario": "A safety inspector identifies several violations in your work area during a routine check. Fixing them immediately would disrupt production significantly during a critical delivery period. What do you do?", "choices": ["Ask the inspector to overlook violations temporarily", "Immediately address all safety violations regardless of production impact", "Fix only the most serious violations now", "Challenge the inspector's findings to buy time"], "answer_index": 1, "answer": "Immediately address all safety violations regardless of production impact", "explanation": "Safety violations must be addressed immediately as they pose risks to employee safety and legal compliance. Production considerations never override safety requirements. Delays in addressing violations increase risks and potential liability.", "difficulty": "easy", "tags": ["SJT", "safety", "regulatory_compliance"], "translations": {}}
{"id": "VR-SJT-0098", "type": "situational_test", "domain": "teamwork", "scenario": "Your team member Badr is going through a difficult personal situation that's affecting his work performance. Other team members are starting to complain about picking up extra work. How do you handle this?", "choices": ["Tell Badr he needs to separate personal and professional life", "Work with the team to provide temporary support while respecting Badr's privacy", "Redistribute Badr's work permanently to other team members", "Report Badr's performance issues to management"], "answer_index": 1, "answer": "Work with the team to provide temporary support while respecting Badr's privacy", "explanation": "Supportive teamwork involves helping colleagues through difficult times while managing team dynamics. Temporary support arrangements show compassion while maintaining team function and respecting individual privacy.", "difficulty": "medium", "tags": ["SJT", "teamwork", "personal_support"], "translations": {}}
{"id": "VR-SJT-0099", "type": "situational_test", "domain": "leadership", "scenario": "Your organization is merging with another company, creating uncertainty and anxiety among your team members. Rumors are spreading faster than official communications. How do you lead during this transition?", "choices": ["Stay silent until official announcements are made", "Provide regular updates with available information and address concerns openly", "Focus only on current work and ignore merger discussions", "Share rumors you've heard to keep team informed"], "answer_index": 1, "answer": "Provide regular updates with available information and address concerns openly", "explanation": "Transition leadership requires transparent communication within appropriate bounds. Regular updates and open discussion of concerns helps manage anxiety and rumors while maintaining trust and team stability during uncertain times.", "difficulty": "hard", "tags": ["SJT", "leadership", "organizational_transition"], "translations": {}}
{"id": "VR-SJT-0100", "type": "situational_test", "domain": "communication", "scenario": "You realize that a decision you supported and communicated to stakeholders was based on incomplete information and may not be the best choice. What do you do?", "choices": ["Proceed with the decision to maintain consistency", "Acknowledge the new information and recommend reconsidering the decision", "Quietly try to influence the decision without acknowledging the error", "Wait to see if the decision works out before saying anything"], "answer_index": 1, "answer": "Acknowledge the new information and recommend reconsidering the decision", "explanation": "Professional integrity requires acknowledging when new information suggests different approaches. Taking responsibility for communication based on incomplete information while advocating for better decisions demonstrates accountability and commitment to optimal outcomes.", "difficulty": "medium", "tags": ["SJT", "communication", "decision_revision"], "translations": {}}
{"id": "VR-SJT-0101", "type": "situational_test", "domain": "teamwork", "scenario": "Your team member Laila is struggling with her workload and missing deadlines. She seems overwhelmed but hasn't asked for help directly.", "choices": ["Wait for her to ask for help directly", "Offer assistance and ask how you can help redistribute tasks", "Complain to your manager about her performance", "Do her work without telling anyone"], "answer_index": 1, "answer": "Offer assistance and ask how you can help redistribute tasks", "explanation": "Proactive support and collaboration strengthen teamwork. Offering help before being asked shows team solidarity and can prevent project delays while supporting colleague wellbeing.", "difficulty": "easy", "tags": ["SJT", "teamwork", "support"], "translations": {}}
{"id": "VR-SJT-0102", "type": "situational_test", "domain": "leadership", "scenario": "As project manager, you discover that Youssef, a key team member, has been inflating his time reports to cover personal activities during work hours.", "choices": ["Give him a verbal warning and monitor quietly", "Document the evidence and address it formally through HR procedures", "Publicly call him out in the next team meeting", "Reduce his responsibilities without explanation"], "answer_index": 1, "answer": "Document the evidence and address it formally through HR procedures", "explanation": "Leadership requires addressing integrity issues through proper formal channels to ensure fair process and maintain team trust. Documentation protects both the organization and the individual's rights.", "difficulty": "hard", "tags": ["SJT", "leadership", "integrity"], "translations": {}}
{"id": "VR-SJT-0103", "type": "situational_test", "domain": "communication", "scenario": "During a video conference with international clients, your colleague Aicha repeatedly interrupts and dominates the conversation, not allowing others to contribute.", "choices": ["Ignore it and address it after the meeting", "Send a private message asking her to allow others to speak", "Interrupt her to redirect the conversation", "Mute her microphone without warning"], "answer_index": 1, "answer": "Send a private message asking her to allow others to speak", "explanation": "Discrete intervention maintains professionalism while addressing disruptive behavior. Private communication avoids embarrassing the colleague while protecting the meeting's effectiveness and client relationships.", "difficulty": "medium", "tags": ["SJT", "communication", "meeting_management"], "translations": {}}
{"id": "VR-SJT-0104", "type": "situational_test", "domain": "customer_service", "scenario": "A customer named Mr. Benali is upset because his order was delayed. He's speaking loudly and attracting attention from other customers.", "choices": ["Tell him to calm down before you can help", "Listen actively, apologize for the inconvenience, and offer a solution", "Match his energy level to show you understand", "Direct him to customer service without engaging"], "answer_index": 1, "answer": "Listen actively, apologize for the inconvenience, and offer a solution", "explanation": "Active listening and solution-focused approach de-escalates situations effectively. Acknowledging the customer's frustration while working toward resolution demonstrates professionalism and commitment to service.", "difficulty": "easy", "tags": ["SJT", "customer_service", "de_escalation"], "translations": {}}
{"id": "VR-SJT-0105", "type": "situational_test", "domain": "ethics", "scenario": "You discover that your manager Rachid has been accepting expensive gifts from suppliers and giving them preferential treatment in contract negotiations.", "choices": ["Confront Rachid privately and ask him to stop", "Report this to the ethics hotline or higher management with documentation", "Demand he share the benefits with the team", "Keep quiet but refuse to work on supplier-related projects"], "answer_index": 1, "answer": "Report this to the ethics hotline or higher management with documentation", "explanation": "Corruption must be reported through proper channels to protect organizational integrity. Ethical violations by leadership require formal reporting to ensure appropriate investigation and prevent further misconduct.", "difficulty": "hard", "tags": ["SJT", "ethics", "corruption"], "translations": {}}
{"id": "VR-SJT-0106", "type": "situational_test", "domain": "inclusivity", "scenario": "In a team meeting, you notice that Khadija, who speaks English as a second language, is being consistently talked over and her ideas aren't being heard.", "choices": ["Talk to her after the meeting about speaking up more", "Pause the discussion and specifically ask for Khadija's input", "Email her ideas to the team later", "Assume she'll speak up when ready"], "answer_index": 1, "answer": "Pause the discussion and specifically ask for Khadija's input", "explanation": "Actively creating space for all voices promotes inclusivity. Direct intervention ensures diverse perspectives are heard and valued while supporting colleagues who may face language or cultural barriers.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "participation"], "translations": {}}
{"id": "VR-SJT-0107", "type": "situational_test", "domain": "conflict", "scenario": "Two colleagues, Hamza and Sofia, are arguing loudly about project priorities in the open office space, disrupting everyone's work.", "choices": ["Let them work it out themselves", "Suggest they move the discussion to a private room to continue", "Take sides based on who you think is right", "Report them to HR immediately"], "answer_index": 1, "answer": "Suggest they move the discussion to a private room to continue", "explanation": "Redirecting conflict to appropriate space allows resolution while minimizing workplace disruption. This approach respects their need to resolve differences while protecting team productivity.", "difficulty": "easy", "tags": ["SJT", "conflict", "workplace_disruption"], "translations": {}}
{"id": "VR-SJT-0108", "type": "situational_test", "domain": "safety", "scenario": "You notice that the emergency exit in your office area is blocked by stacked boxes that were delivered this morning.", "choices": ["Send an email to the team about the blocked exit", "Move the boxes and report the safety hazard to facilities", "Wait for maintenance to notice and fix it", "Just remember to avoid that exit personally"], "answer_index": 1, "answer": "Move the boxes and report the safety hazard to facilities", "explanation": "Immediate action to remove safety hazards protects everyone's wellbeing. Taking personal responsibility while reporting through proper channels ensures both immediate and systematic resolution.", "difficulty": "easy", "tags": ["SJT", "safety", "emergency_preparedness"], "translations": {}}
{"id": "VR-SJT-0109", "type": "situational_test", "domain": "teamwork", "scenario": "Your team is behind schedule on a critical project. Teammate Nabil suggests working through the weekend, but you know Fatima has family commitments she can't change.", "choices": ["Tell Fatima she needs to prioritize work", "Propose redistributing weekend work among volunteers and finding alternative solutions", "Suggest the whole team skip the weekend work", "Work secretly over the weekend to cover for her"], "answer_index": 1, "answer": "Propose redistributing weekend work among volunteers and finding alternative solutions", "explanation": "Balancing team goals with individual needs through creative solutions demonstrates inclusive leadership. Finding alternatives that respect personal commitments while meeting deadlines strengthens team cohesion.", "difficulty": "medium", "tags": ["SJT", "teamwork", "work_life_balance"], "translations": {}}
{"id": "VR-SJT-0110", "type": "situational_test", "domain": "leadership", "scenario": "As team lead, you need to announce budget cuts that will affect some team perks and training opportunities that everyone was looking forward to.", "choices": ["Send an email with the decision and avoid discussion", "Call a team meeting, explain the situation transparently, and discuss alternatives together", "Blame upper management and distance yourself from the decision", "Implement changes gradually without announcement"], "answer_index": 1, "answer": "Call a team meeting, explain the situation transparently, and discuss alternatives together", "explanation": "Transparent communication and collaborative problem-solving build trust during difficult times. Open dialogue allows team input and demonstrates leadership accountability while exploring solutions together.", "difficulty": "easy", "tags": ["SJT", "leadership", "difficult_news"], "translations": {}}
{"id": "VR-SJT-0111", "type": "situational_test", "domain": "communication", "scenario": "You're presenting quarterly results to senior management when CEO Amina interrupts with criticism about data accuracy, questioning your competence in front of the entire leadership team.", "choices": ["Defend your work vigorously and challenge her assessment", "Acknowledge the concern, offer to verify data immediately, and schedule follow-up to address issues", "Agree completely and apologize profusely", "Deflect blame to your data sources"], "answer_index": 1, "answer": "Acknowledge the concern, offer to verify data immediately, and schedule follow-up to address issues", "explanation": "Professional response under pressure demonstrates competence and accountability. Acknowledging concerns while proposing solutions maintains credibility and shows commitment to accuracy and improvement.", "difficulty": "hard", "tags": ["SJT", "communication", "pressure_handling"], "translations": {}}
{"id": "VR-SJT-0112", "type": "situational_test", "domain": "customer_service", "scenario": "A regular customer, Mrs. Alami, is demanding a refund for a product that's clearly been used extensively and is outside the return policy timeframe.", "choices": ["Simply refuse based on policy", "Explain the policy clearly, but offer alternative solutions like store credit or repair services", "Give the full refund to avoid confrontation", "Pass her to a manager without attempting to help"], "answer_index": 1, "answer": "Explain the policy clearly, but offer alternative solutions like store credit or repair services", "explanation": "Balancing policy adherence with customer satisfaction through creative alternatives demonstrates excellent service. Finding win-win solutions maintains relationships while upholding business standards.", "difficulty": "medium", "tags": ["SJT", "customer_service", "policy_flexibility"], "translations": {}}
{"id": "VR-SJT-0113", "type": "situational_test", "domain": "ethics", "scenario": "Your colleague Karim asks you to clock out for him while he leaves early for a personal appointment, promising to return the favor someday.", "choices": ["Agree this one time since it's a small favor", "Decline politely and suggest he speak with his supervisor about flexible arrangements", "Agree but demand immediate compensation", "Report him for asking you to commit time fraud"], "answer_index": 1, "answer": "Decline politely and suggest he speak with his supervisor about flexible arrangements", "explanation": "Refusing unethical requests while offering constructive alternatives demonstrates integrity. Suggesting proper channels for flexibility shows support for the colleague while maintaining ethical standards.", "difficulty": "medium", "tags": ["SJT", "ethics", "time_fraud"], "translations": {}}
{"id": "VR-SJT-0114", "type": "situational_test", "domain": "inclusivity", "scenario": "During lunch, some colleagues make jokes about religious practices that make you uncomfortable, even though they claim it's all in good fun.", "choices": ["Join in to fit in with the group", "Speak up calmly about how these jokes might affect others, regardless of intent", "Leave the conversation without comment", "Lecture them about sensitivity"], "answer_index": 1, "answer": "Speak up calmly about how these jokes might affect others, regardless of intent", "explanation": "Addressing exclusionary behavior constructively promotes inclusivity. Speaking up about potentially harmful jokes, regardless of intent, helps create a more welcoming environment for all colleagues.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "religious_sensitivity"], "translations": {}}
{"id": "VR-SJT-0115", "type": "situational_test", "domain": "conflict", "scenario": "Two department heads, Yousra and Omar, are in a heated dispute about resource allocation that's affecting multiple projects and team morale across the organization.", "choices": ["Support whoever has more organizational power", "Facilitate a structured discussion focused on project needs and propose data-driven solutions", "Avoid taking any position and work around the conflict", "Escalate immediately to the CEO without attempting resolution"], "answer_index": 1, "answer": "Facilitate a structured discussion focused on project needs and propose data-driven solutions", "explanation": "Structured conflict resolution focusing on organizational needs rather than personalities creates sustainable solutions. Data-driven approaches help move beyond positions to address underlying resource allocation challenges.", "difficulty": "hard", "tags": ["SJT", "conflict", "resource_allocation"], "translations": {}}
{"id": "VR-SJT-0116", "type": "situational_test", "domain": "safety", "scenario": "You witness your supervisor Driss instructing new employees to bypass safety training requirements to meet urgent production deadlines.", "choices": ["Talk to Driss privately about the risks", "Document the incident and report it to the safety committee and higher management", "Threaten to report him unless he changes immediately", "Follow orders but refuse to participate personally"], "answer_index": 1, "answer": "Document the incident and report it to the safety committee and higher management", "explanation": "Serious safety violations by leadership require formal reporting to protect all workers. Bypassing safety training creates significant liability and endangers employees, requiring immediate escalation through proper channels.", "difficulty": "hard", "tags": ["SJT", "safety", "training_violations"], "translations": {}}
{"id": "VR-SJT-0117", "type": "situational_test", "domain": "teamwork", "scenario": "Your cross-functional team includes Meryem from IT who consistently misses meetings and deliverables, but she's the only one with the technical expertise your project needs.", "choices": ["Work around her schedule and lower expectations", "Meet with Meryem to understand barriers and develop a structured plan with clear expectations and support", "Replace her with someone less skilled but more reliable", "Complain to her manager about her performance"], "answer_index": 1, "answer": "Meet with Meryem to understand barriers and develop a structured plan with clear expectations and support", "explanation": "Addressing performance issues through direct communication and structured support maintains critical expertise while improving team function. Understanding barriers allows for collaborative solutions.", "difficulty": "hard", "tags": ["SJT", "teamwork", "performance_management"], "translations": {}}
{"id": "VR-SJT-0118", "type": "situational_test", "domain": "leadership", "scenario": "As department manager, you learn that your top performer Hassan is interviewing with competitors due to lack of career advancement opportunities in your organization.", "choices": ["Ignore it since he hasn't officially given notice", "Schedule a career development discussion to explore internal opportunities and address his concerns", "Counter-offer with immediate promotion and raise", "Start looking for his replacement"], "answer_index": 1, "answer": "Schedule a career development discussion to explore internal opportunities and address his concerns", "explanation": "Proactive leadership addressing talent retention through career development demonstrates investment in employees. Understanding and addressing concerns about advancement opportunities can prevent valuable talent loss.", "difficulty": "medium", "tags": ["SJT", "leadership", "talent_retention"], "translations": {}}
{"id": "VR-SJT-0119", "type": "situational_test", "domain": "communication", "scenario": "You need to deliver bad news to your team: the client has rejected the proposal you've all worked on for months and wants significant changes.", "choices": ["Send a brief email with the client's feedback", "Gather the team, present the facts clearly, acknowledge their efforts, and focus on next steps", "Delay sharing the news until you have a complete solution", "Share the news but emphasize how disappointed you are"], "answer_index": 1, "answer": "Gather the team, present the facts clearly, acknowledge their efforts, and focus on next steps", "explanation": "Clear, empathetic communication that acknowledges effort while focusing on solutions maintains team morale during setbacks. Face-to-face delivery shows respect for the team's investment and commitment.", "difficulty": "easy", "tags": ["SJT", "communication", "bad_news"], "translations": {}}
{"id": "VR-SJT-0120", "type": "situational_test", "domain": "customer_service", "scenario": "A VIP customer, Mr. Tazi, is demanding that you violate company data privacy policies to provide him with information about his competitors who are also your clients.", "choices": ["Provide minimal information since he's a VIP", "Explain privacy policies firmly but offer alternative ways to serve his legitimate business needs", "Refuse completely without offering alternatives", "Refer him to legal department"], "answer_index": 1, "answer": "Explain privacy policies firmly but offer alternative ways to serve his legitimate business needs", "explanation": "Maintaining ethical standards while preserving customer relationships through alternative solutions demonstrates professional integrity. Finding ethical ways to serve VIP clients protects all customer relationships.", "difficulty": "hard", "tags": ["SJT", "customer_service", "data_privacy"], "translations": {}}
{"id": "VR-SJT-0121", "type": "situational_test", "domain": "ethics", "scenario": "You accidentally gain access to salary information for your colleagues and discover significant pay disparities that seem unfair.", "choices": ["Share the information with affected colleagues", "Report your concerns to HR through proper channels without sharing specific details inappropriately", "Ignore what you've seen", "Use the information to negotiate your own salary"], "answer_index": 1, "answer": "Report your concerns to HR through proper channels without sharing specific details inappropriately", "explanation": "Addressing systemic issues through proper channels while respecting confidentiality demonstrates ethical leadership. Reporting concerns about pay equity protects colleagues while following appropriate procedures.", "difficulty": "easy", "tags": ["SJT", "ethics", "pay_equity"], "translations": {}}
{"id": "VR-SJT-0122", "type": "situational_test", "domain": "inclusivity", "scenario": "In a hiring committee, you notice that qualified candidates with Arabic names are consistently being screened out early in the process while less qualified candidates with Western names advance.", "choices": ["Vote for more Arabic candidates to balance it out", "Raise concerns with the committee and suggest implementing blind resume screening processes", "Document the pattern but stay quiet to avoid conflict", "Focus only on qualifications and ignore the pattern"], "answer_index": 1, "answer": "Raise concerns with the committee and suggest implementing blind resume screening processes", "explanation": "Addressing systemic bias through process improvements ensures fair hiring practices. Implementing blind screening removes unconscious bias while maintaining focus on qualifications and merit.", "difficulty": "hard", "tags": ["SJT", "inclusivity", "hiring_bias"], "translations": {}}
{"id": "VR-SJT-0123", "type": "situational_test", "domain": "conflict", "scenario": "Your colleague Zahra publicly criticized your project approach in front of clients, undermining your credibility and creating tension in the client relationship.", "choices": ["Respond immediately in front of the clients", "Speak with Zahra privately first to understand her concerns and establish professional boundaries", "Ignore it to avoid escalation", "Report her to management immediately"], "answer_index": 1, "answer": "Speak with Zahra privately first to understand her concerns and establish professional boundaries", "explanation": "Private discussion to address both the immediate issue and prevent future occurrences maintains professionalism while protecting client relationships. Understanding concerns may reveal legitimate issues requiring attention.", "difficulty": "medium", "tags": ["SJT", "conflict", "professional_boundaries"], "translations": {}}
{"id": "VR-SJT-0124", "type": "situational_test", "domain": "safety", "scenario": "During a site inspection, you notice that some safety equipment hasn't been updated according to recent regulatory changes, but the deadline for compliance isn't for another month.", "choices": ["Wait until closer to the deadline", "Initiate immediate update process and document the current status for compliance tracking", "Report it as a violation immediately", "Update only the most critical items"], "answer_index": 1, "answer": "Initiate immediate update process and document the current status for compliance tracking", "explanation": "Proactive safety management prevents last-minute compliance issues and demonstrates commitment to employee safety. Early action ensures adequate time for proper implementation and testing.", "difficulty": "medium", "tags": ["SJT", "safety", "regulatory_compliance"], "translations": {}}
{"id": "VR-SJT-0125", "type": "situational_test", "domain": "teamwork", "scenario": "Your team is celebrating a major project success, but you notice that Reda, who contributed significantly, seems left out of the recognition and celebrations.", "choices": ["Invite Reda to join quietly", "Publicly acknowledge Reda's contributions and encourage the team to include him in celebrations", "Celebrate with Reda separately later", "Assume he prefers not to participate"], "answer_index": 1, "answer": "Publicly acknowledge Reda's contributions and encourage the team to include him in celebrations", "explanation": "Ensuring all contributors receive appropriate recognition builds strong team culture and morale. Public acknowledgment validates contributions and encourages inclusive celebration practices.", "difficulty": "easy", "tags": ["SJT", "teamwork", "recognition"], "translations": {}}
{"id": "VR-SJT-0126", "type": "situational_test", "domain": "leadership", "scenario": "As regional manager, you discover that one of your location managers, Latifa, has been consistently manipulating performance reports to hide operational problems from upper management.", "choices": ["Give her a chance to fix the problems quietly", "Conduct thorough investigation, address the issues formally, and implement systems to prevent future occurrences", "Report her immediately for termination", "Take over her responsibilities gradually"], "answer_index": 1, "answer": "Conduct thorough investigation, address the issues formally, and implement systems to prevent future occurrences", "explanation": "Comprehensive approach that addresses immediate integrity issues while preventing future problems demonstrates strong leadership. Proper investigation ensures fair process while protecting organizational interests.", "difficulty": "hard", "tags": ["SJT", "leadership", "integrity_violations"], "translations": {}}
{"id": "VR-SJT-0127", "type": "situational_test", "domain": "communication", "scenario": "You're leading a conference call with international partners when technical issues cause your audio to cut out repeatedly, disrupting the important discussion.", "choices": ["Keep trying to reconnect repeatedly", "Switch to chat or email to continue key points and reschedule when technical issues are resolved", "Have someone else take over immediately", "End the call abruptly"], "answer_index": 1, "answer": "Switch to chat or email to continue key points and reschedule when technical issues are resolved", "explanation": "Adapting communication method while maintaining professionalism ensures progress despite technical challenges. Alternative channels allow continued collaboration while respecting participants' time.", "difficulty": "medium", "tags": ["SJT", "communication", "technical_issues"], "translations": {}}
{"id": "VR-SJT-0128", "type": "situational_test", "domain": "customer_service", "scenario": "A customer, Mrs. Bennani, compliments your service but mentions that another employee was rude to her earlier. She's not making a formal complaint but seems upset.", "choices": ["Just accept the compliment and ignore the criticism", "Thank her for the feedback, apologize for her experience, and discretely follow up with the colleague for improvement", "Defend your colleague immediately", "Ask her to file a formal complaint"], "answer_index": 1, "answer": "Thank her for the feedback, apologize for her experience, and discretely follow up with the colleague for improvement", "explanation": "Addressing all feedback constructively improves overall service quality and demonstrates commitment to customer satisfaction. Professional follow-up ensures service improvements while maintaining colleague relationships.", "difficulty": "easy", "tags": ["SJT", "customer_service", "feedback_handling"], "translations": {}}
{"id": "VR-SJT-0129", "type": "situational_test", "domain": "ethics", "scenario": "Your friend Khalid, who works for a competitor, casually mentions details about their upcoming product launch during a social gathering.", "choices": ["Listen carefully and share the information with your team", "Politely redirect the conversation and don't use the information professionally", "Tell Khalid he shouldn't share such information", "Pretend you didn't hear anything"], "answer_index": 1, "answer": "Politely redirect the conversation and don't use the information professionally", "explanation": "Maintaining ethical boundaries while preserving personal relationships demonstrates integrity. Avoiding use of inadvertently shared competitive information protects both professional ethics and personal friendships.", "difficulty": "medium", "tags": ["SJT", "ethics", "competitive_information"], "translations": {}}
{"id": "VR-SJT-0130", "type": "situational_test", "domain": "inclusivity", "scenario": "During team building activities, you notice that several colleagues consistently choose activities that exclude Mostafa, who uses a wheelchair, without considering accessibility.", "choices": ["Participate in the current activities without comment", "Suggest alternative activities that everyone can participate in and raise awareness about inclusive planning", "Only invite Mostafa to activities he can join", "Ask Mostafa to suggest activities"], "answer_index": 1, "answer": "Suggest alternative activities that everyone can participate in and raise awareness about inclusive planning", "explanation": "Proactively creating inclusive environments ensures all team members can participate fully. Suggesting accessible alternatives demonstrates thoughtful leadership and promotes inclusive team culture.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "accessibility"], "translations": {}}
{"id": "VR-SJT-0131", "type": "situational_test", "domain": "conflict", "scenario": "During a brainstorming session, Salma and Kamal keep shooting down each other's ideas, creating a negative atmosphere that's stifling creativity.", "choices": ["Let them work it out themselves", "Establish ground rules for constructive feedback and redirect focus to building on ideas", "Take sides with the better ideas", "End the brainstorming session"], "answer_index": 1, "answer": "Establish ground rules for constructive feedback and redirect focus to building on ideas", "explanation": "Establishing structure that channels conflict constructively maintains productive collaboration. Ground rules for feedback help transform destructive criticism into valuable creative input.", "difficulty": "easy", "tags": ["SJT", "conflict", "creative_collaboration"], "translations": {}}
{"id": "VR-SJT-0132", "type": "situational_test", "domain": "safety", "scenario": "You see a small oil spill in the parking garage that poses a slip hazard, but it's not in your department's area of responsibility.", "choices": ["Report it to facilities and walk around it", "Clean it up if possible and notify the responsible department to prevent future incidents", "Put up a warning sign and leave", "Ignore it since it's not your responsibility"], "answer_index": 1, "answer": "Clean it up if possible and notify the responsible department to prevent future incidents", "explanation": "Taking immediate action to address safety hazards regardless of departmental boundaries demonstrates commitment to colleague safety. Proactive response prevents accidents while ensuring proper follow-up.", "difficulty": "easy", "tags": ["SJT", "safety", "hazard_response"], "translations": {}}
{"id": "VR-SJT-0133", "type": "situational_test", "domain": "teamwork", "scenario": "Your team has been assigned a high-visibility project, but Imane, a key team member, reveals she's going through a difficult personal situation that may affect her availability.", "choices": ["Remove her from the project to avoid risks", "Work with Imane to adjust her responsibilities while ensuring team coverage and offering support resources", "Expect her to handle both without accommodations", "Complete her work secretly to protect her"], "answer_index": 1, "answer": "Work with Imane to adjust her responsibilities while ensuring team coverage and offering support resources", "explanation": "Supporting team members through difficult times while maintaining project success demonstrates compassionate leadership. Flexible arrangements preserve valuable expertise while ensuring team objectives are met.", "difficulty": "medium", "tags": ["SJT", "teamwork", "personal_challenges"], "translations": {}}
{"id": "VR-SJT-0134", "type": "situational_test", "domain": "leadership", "scenario": "You've been promoted to team leader and notice that team meetings are unproductive, with people frequently interrupting each other and going off-topic.", "choices": ["Cancel meetings and rely on email updates", "Establish clear meeting structure with agenda, time limits, and participation guidelines", "Let people figure out better behavior naturally", "Have one-on-one meetings instead"], "answer_index": 1, "answer": "Establish clear meeting structure with agenda, time limits, and participation guidelines", "explanation": "Establishing structure that enables productive collaboration demonstrates effective leadership. Clear guidelines help teams focus their energy on achieving objectives rather than managing dysfunction.", "difficulty": "easy", "tags": ["SJT", "leadership", "meeting_management"], "translations": {}}
{"id": "VR-SJT-0135", "type": "situational_test", "domain": "communication", "scenario": "You must present budget cut recommendations to the board that will result in layoffs, including some of your colleagues who are counting on you to advocate for them.", "choices": ["Advocate strongly against any cuts regardless of data", "Present objective analysis with alternatives explored, acknowledging impact while focusing on organizational sustainability", "Present the cuts without acknowledging human impact", "Refuse to make the presentation"], "answer_index": 1, "answer": "Present objective analysis with alternatives explored, acknowledging impact while focusing on organizational sustainability", "explanation": "Balancing personal relationships with professional responsibilities through transparent, data-driven communication demonstrates integrity. Acknowledging human impact while presenting necessary business decisions shows ethical leadership.", "difficulty": "hard", "tags": ["SJT", "communication", "difficult_decisions"], "translations": {}}
{"id": "VR-SJT-0136", "type": "situational_test", "domain": "customer_service", "scenario": "A long-term client, Mr. Idrissi, is threatening to cancel his contract because of one poor service experience, despite years of generally good service.", "choices": ["Point out all the good service over the years", "Acknowledge the specific incident, take responsibility, outline improvement measures, and reinforce the long-term relationship value", "Offer immediate discounts to keep the business", "Accept his decision without trying to retain him"], "answer_index": 1, "answer": "Acknowledge the specific incident, take responsibility, outline improvement measures, and reinforce the long-term relationship value", "explanation": "Addressing immediate concerns while leveraging relationship history constructively demonstrates professional service recovery. Taking responsibility and outlining improvements shows commitment to service excellence.", "difficulty": "medium", "tags": ["SJT", "customer_service", "relationship_recovery"], "translations": {}}
{"id": "VR-SJT-0137", "type": "situational_test", "domain": "ethics", "scenario": "You discover that your company's star performer, Sami, has been falsifying expense reports to cover personal purchases, but removing him would jeopardize a major client contract.", "choices": ["Handle it quietly to avoid business disruption", "Report the violations through proper channels regardless of business impact, as integrity cannot be compromised", "Demand reimbursement but ignore the fraud", "Wait until after the contract is secured"], "answer_index": 1, "answer": "Report the violations through proper channels regardless of business impact, as integrity cannot be compromised", "explanation": "Maintaining ethical standards regardless of short-term business consequences protects organizational integrity. Allowing fraud to continue for business convenience sets dangerous precedents and undermines ethical culture.", "difficulty": "hard", "tags": ["SJT", "ethics", "fraud_detection"], "translations": {}}
{"id": "VR-SJT-0138", "type": "situational_test", "domain": "inclusivity", "scenario": "You're organizing a company social event and realize that scheduling it during Ramadan would exclude Muslim colleagues from full participation.", "choices": ["Keep the original plan since it affects only some people", "Reschedule the event or modify the format to accommodate religious observances", "Have two separate events", "Cancel the event entirely"], "answer_index": 1, "answer": "Reschedule the event or modify the format to accommodate religious observances", "explanation": "Adapting plans to ensure everyone can participate fully demonstrates inclusive leadership. Considering religious observances in event planning shows respect for diverse team members and strengthens team cohesion.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "religious_accommodation"], "translations": {}}
{"id": "VR-SJT-0139", "type": "situational_test", "domain": "conflict", "scenario": "Two departments are blaming each other for a project failure, with each providing evidence that the other department is at fault. The finger-pointing is escalating.", "choices": ["Investigate to determine who is really at fault", "Facilitate a joint review session focused on process improvement rather than blame assignment", "Support the department with stronger evidence", "Let upper management decide"], "answer_index": 1, "answer": "Facilitate a joint review session focused on process improvement rather than blame assignment", "explanation": "Shifting focus from blame to solutions promotes collaboration and learning. Process improvement approach helps departments work together to prevent future failures rather than perpetuating adversarial relationships.", "difficulty": "medium", "tags": ["SJT", "conflict", "process_improvement"], "translations": {}}
{"id": "VR-SJT-0140", "type": "situational_test", "domain": "safety", "scenario": "During a fire drill, you notice that Mehdi, a new employee, doesn't know the evacuation procedures and is going in the wrong direction.", "choices": ["Point him toward the exit and continue with your own evacuation", "Guide him to the correct evacuation route and note the need for better safety orientation", "Report the training gap to HR later", "Assume someone else will help him"], "answer_index": 1, "answer": "Guide him to the correct evacuation route and note the need for better safety orientation", "explanation": "Immediate assistance during emergencies protects colleague safety while identifying systemic training gaps. Personal intervention ensures immediate safety while noting improvements needed in orientation procedures.", "difficulty": "medium", "tags": ["SJT", "safety", "emergency_procedures"], "translations": {}}
{"id": "VR-SJT-0141", "type": "situational_test", "domain": "teamwork", "scenario": "Your team has successfully completed a challenging project ahead of schedule. Everyone contributed, but Nour did exceptional work that really made the difference.", "choices": ["Give all credit to the team equally", "Celebrate the team success while also specifically acknowledging Nour's exceptional contribution", "Focus recognition primarily on Nour", "Let management decide how to handle recognition"], "answer_index": 1, "answer": "Celebrate the team success while also specifically acknowledging Nour's exceptional contribution", "explanation": "Balancing team recognition with individual merit encourages both collaboration and excellence. Acknowledging exceptional contributions while celebrating team success motivates continued high performance and team spirit.", "difficulty": "easy", "tags": ["SJT", "teamwork", "performance_recognition"], "translations": {}}
{"id": "VR-SJT-0142", "type": "situational_test", "domain": "leadership", "scenario": "Your team is consistently missing deadlines despite having adequate resources. You suspect the issue is poor time management and lack of prioritization skills.", "choices": ["Extend all deadlines to reduce pressure", "Implement time management training and establish clearer project planning processes with regular check-ins", "Replace team members who can't meet deadlines", "Take over all planning yourself"], "answer_index": 1, "answer": "Implement time management training and establish clearer project planning processes with regular check-ins", "explanation": "Addressing root causes through skill development and improved processes demonstrates effective leadership. Providing training and better systems empowers team members to succeed rather than lowering standards or replacing people.", "difficulty": "medium", "tags": ["SJT", "leadership", "skill_development"], "translations": {}}
{"id": "VR-SJT-0143", "type": "situational_test", "domain": "communication", "scenario": "You need to explain a complex technical process to a client who has no technical background, and they seem confused by your initial explanation.", "choices": ["Repeat the same explanation more slowly", "Use simpler language, analogies, and visual aids to make the concept more accessible", "Tell them it's too complex for non-technical people", "Have a technical colleague explain it instead"], "answer_index": 1, "answer": "Use simpler language, analogies, and visual aids to make the concept more accessible", "explanation": "Adapting communication style to audience needs enhances understanding and demonstrates professional competence. Using multiple communication methods ensures complex concepts are accessible to all stakeholders.", "difficulty": "easy", "tags": ["SJT", "communication", "technical_explanation"], "translations": {}}
{"id": "VR-SJT-0144", "type": "situational_test", "domain": "customer_service", "scenario": "A premium customer, Mrs. Fassi, is demanding special treatment that would require bending company policies significantly, and she's threatening to take her substantial business elsewhere.", "choices": ["Bend the rules to keep the business", "Explore creative solutions within policy boundaries and escalate to appropriate level for policy exception consideration", "Rigidly apply policies without consideration", "Pass the decision entirely to management"], "answer_index": 1, "answer": "Explore creative solutions within policy boundaries and escalate to appropriate level for policy exception consideration", "explanation": "Maximizing customer satisfaction within ethical boundaries while using proper escalation demonstrates professional service excellence. Finding creative solutions preserves valuable relationships while maintaining policy integrity.", "difficulty": "hard", "tags": ["SJT", "customer_service", "policy_exceptions"], "translations": {}}
{"id": "VR-SJT-0145", "type": "situational_test", "domain": "ethics", "scenario": "During a vendor selection process, you learn that one of the bidding companies has hired your former colleague Zineb, who has inside knowledge of your company's evaluation criteria.", "choices": ["Ignore it since Zineb no longer works for your company", "Disclose the potential conflict to the procurement team and ensure the evaluation process remains fair and transparent", "Automatically disqualify that vendor", "Use this as an opportunity to get better terms"], "answer_index": 1, "answer": "Disclose the potential conflict to the procurement team and ensure the evaluation process remains fair and transparent", "explanation": "Transparency ensures fair procurement processes while allowing proper evaluation of potential conflicts. Disclosure protects the organization's interests while maintaining ethical procurement standards.", "difficulty": "medium", "tags": ["SJT", "ethics", "procurement_conflict"], "translations": {}}
{"id": "VR-SJT-0146", "type": "situational_test", "domain": "inclusivity", "scenario": "You're leading a diverse team where some members consistently communicate in Arabic during meetings, excluding colleagues who don't speak the language from important discussions.", "choices": ["Ban Arabic in the workplace", "Establish a common language policy for meetings while respecting cultural diversity and providing support for non-native speakers", "Have separate meetings for different language groups", "Ask non-Arabic speakers to learn the language"], "answer_index": 1, "answer": "Establish a common language policy for meetings while respecting cultural diversity and providing support for non-native speakers", "explanation": "Creating inclusive environment while respecting cultural diversity requires structured approach that ensures all team members can participate effectively. Language policies should promote inclusion without suppressing cultural identity.", "difficulty": "hard", "tags": ["SJT", "inclusivity", "language_barriers"], "translations": {}}
{"id": "VR-SJT-0147", "type": "situational_test", "domain": "conflict", "scenario": "Your mentor and advocate, Ahmed, is in a serious conflict with your direct supervisor Samira over strategic direction. You're caught in the middle and both expect your support.", "choices": ["Support Ahmed since he's been your mentor", "Maintain professional relationships with both while focusing on objective analysis of the strategic issues rather than personal loyalty", "Support Samira since she's your direct supervisor", "Avoid both until the conflict resolves"], "answer_index": 1, "answer": "Maintain professional relationships with both while focusing on objective analysis of the strategic issues rather than personal loyalty", "explanation": "Maintaining integrity and professionalism while contributing constructively to resolution demonstrates maturity and ethical leadership. Objective analysis serves organizational interests better than personal loyalty.", "difficulty": "hard", "tags": ["SJT", "conflict", "divided_loyalties"], "translations": {}}
{"id": "VR-SJT-0148", "type": "situational_test", "domain": "safety", "scenario": "You discover that cost-cutting measures have resulted in skipping important safety inspections, but reporting this could result in significant financial losses and potential layoffs.", "choices": ["Handle it quietly within the team", "Report the safety violations through proper channels, as safety cannot be compromised regardless of financial impact", "Wait for the next budget cycle to address it", "Focus on the most critical safety items only"], "answer_index": 1, "answer": "Report the safety violations through proper channels, as safety cannot be compromised regardless of financial impact", "explanation": "Safety violations must be reported regardless of financial consequences as they pose risks to employee safety and legal compliance. Financial considerations never override safety requirements.", "difficulty": "hard", "tags": ["SJT", "safety", "financial_pressure"], "translations": {}}
{"id": "VR-SJT-0149", "type": "situational_test", "domain": "teamwork", "scenario": "Your cross-cultural team includes members from different continents working across time zones. Some team members consistently schedule meetings at times convenient only for their location, causing others to join at very inconvenient hours.", "choices": ["Let the largest office determine meeting times", "Implement a rotating meeting schedule that shares the inconvenience fairly among all team members", "Have separate regional meetings", "Move to asynchronous communication only"], "answer_index": 1, "answer": "Implement a rotating meeting schedule that shares the inconvenience fairly among all team members", "explanation": "Equitable approach that demonstrates respect for all team members regardless of location strengthens global team cohesion. Sharing inconvenience fairly shows commitment to inclusive collaboration.", "difficulty": "hard", "tags": ["SJT", "teamwork", "global_collaboration"], "translations": {}}
{"id": "VR-SJT-0150", "type": "situational_test", "domain": "leadership", "scenario": "As senior leader, you must decide whether to pursue a profitable opportunity that would benefit the company financially but could harm local environmental conditions in the community where many employees live.", "choices": ["Prioritize profits since that's the business purpose", "Conduct thorough impact assessment and engage stakeholders to find solutions that balance profitability with environmental responsibility", "Reject the opportunity to avoid any environmental risk", "Let the board make the decision without input"], "answer_index": 1, "answer": "Conduct thorough impact assessment and engage stakeholders to find solutions that balance profitability with environmental responsibility", "explanation": "Comprehensive approach that seeks win-win solutions through stakeholder engagement demonstrates responsible leadership. Balancing financial success with environmental stewardship protects long-term organizational sustainability.", "difficulty": "hard", "tags": ["SJT", "leadership", "environmental_responsibility"], "translations": {}}
{"total_items": 150, "domains": {"teamwork": 24, "leadership": 24, "communication": 21, "customer_service": 21, "ethics": 21, "inclusivity": 15, "conflict": 15, "safety": 9}, "difficulty_distribution": {"easy": 60, "medium": 60, "hard": 30}}
