{"id": "SJT-0001", "domain": "teamwork", "scenario": "Your team is working on a critical project deadline when you notice that Amina, a new team member, hasn't been included in important planning discussions. She appears frustrated and disengaged.", "choices": ["Ignore it since she's new and will learn by observation", "Speak privately with the team lead about including Amina more actively", "Wait until after the deadline to address the inclusion issues", "Make a joke to lighten the mood and help her feel welcome"], "answer_index": 1, "answer": "Speak privately with the team lead about including Amina more actively", "explanation": "Addressing inclusion issues proactively with leadership ensures team cohesion and maximizes everyone's contribution during critical periods.", "difficulty": "medium", "tags": ["SJT", "teamwork", "inclusivity"], "translations": {}}
{"id": "SJT-0002", "domain": "leadership", "scenario": "As a project manager, you discover that two key deliverables are behind schedule, and your team is showing signs of burnout. Stakeholders are asking for status updates daily.", "choices": ["Push the team harder to meet the original deadline", "Negotiate a revised timeline with stakeholders while supporting your team", "Reassign work to other departments without consulting anyone", "Tell stakeholders everything is on track to buy more time"], "answer_index": 1, "answer": "Negotiate a revised timeline with stakeholders while supporting your team", "explanation": "Transparent communication with stakeholders while protecting team wellbeing demonstrates strong leadership and builds long-term trust.", "difficulty": "hard", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0003", "domain": "ethics", "scenario": "During a vendor selection process, you learn that your manager has a personal relationship with one of the bidding companies. The vendor's proposal is competitive but not the best option.", "choices": ["Report the conflict of interest to HR or senior management", "Say nothing since the proposal is competitive", "Suggest your manager recuse themselves from the decision", "Document everything but wait to see what happens"], "answer_index": 0, "answer": "Report the conflict of interest to HR or senior management", "explanation": "Potential conflicts of interest must be reported immediately to maintain ethical standards and protect the organization's reputation.", "difficulty": "hard", "tags": ["SJT", "ethics", "integrity"], "translations": {}}
{"id": "SJT-0004", "domain": "customer_service", "scenario": "A long-standing client, Hassan, is demanding a refund for services already delivered, claiming the work doesn't meet his expectations. Your review shows the work meets contractual requirements.", "choices": ["Firmly deny the refund request and cite the contract", "Offer a partial refund to maintain the relationship", "Schedule a meeting to understand his concerns and find a solution", "Transfer him to your supervisor immediately"], "answer_index": 2, "answer": "Schedule a meeting to understand his concerns and find a solution", "explanation": "Understanding client concerns shows professionalism and often leads to solutions that satisfy both parties while preserving the relationship.", "difficulty": "medium", "tags": ["SJT", "customer_service", "communication"], "translations": {}}
{"id": "SJT-0005", "domain": "communication", "scenario": "During a video conference with international colleagues, Youssef keeps interrupting others and speaking over them. The meeting is becoming unproductive.", "choices": ["Mute his microphone without explanation", "Send him a private message asking him to let others speak", "Continue the meeting and address it privately afterward", "Publicly ask him to wait his turn to speak"], "answer_index": 1, "answer": "Send him a private message asking him to let others speak", "explanation": "Private, respectful communication maintains dignity while addressing the issue immediately to improve meeting effectiveness.", "difficulty": "easy", "tags": ["SJT", "communication", "professionalism"], "translations": {}}
{"id": "SJT-0006", "domain": "conflict", "scenario": "Two departments are blaming each other for a project delay. As the mediator, you've heard both sides present very different versions of events.", "choices": ["Side with the department that has more evidence", "Focus on solutions rather than blame and create a joint action plan", "Schedule separate meetings with each department first", "Escalate the matter to senior management immediately"], "answer_index": 1, "answer": "Focus on solutions rather than blame and create a joint action plan", "explanation": "Solution-focused mediation stops the blame cycle and gets teams working together toward resolution.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0007", "domain": "inclusivity", "scenario": "During team lunch discussions, some colleagues make comments that could make Fatima, who observes religious dietary restrictions, feel excluded from social activities.", "choices": ["Join the conversation to fit in with the group", "Suggest the team consider inclusive restaurant options for future outings", "Tell Fatima privately that she can always bring her own food", "Report the colleagues for discrimination"], "answer_index": 1, "answer": "Suggest the team consider inclusive restaurant options for future outings", "explanation": "Proactively promoting inclusive practices benefits everyone and creates a welcoming environment for all team members.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "teamwork"], "translations": {}}
{"id": "SJT-0008", "domain": "safety", "scenario": "You notice that Karim, a colleague, is not following the required safety protocols in the laboratory, potentially putting himself and others at risk.", "choices": ["Remind him about the safety protocols immediately", "Report it to the safety officer without speaking to him first", "Wait to see if a supervisor notices and addresses it", "Mind your own business since it's not your responsibility"], "answer_index": 0, "answer": "Remind him about the safety protocols immediately", "explanation": "Safety issues require immediate action. Direct communication can prevent accidents while maintaining collegial relationships.", "difficulty": "easy", "tags": ["SJT", "safety", "teamwork"], "translations": {}}
{"id": "SJT-0009", "domain": "teamwork", "scenario": "Your team is working on a group presentation when you discover that Nadia has made significant changes to the shared document without consulting anyone, altering the agreed-upon direction.", "choices": ["Revert her changes and lock the document", "Call a team meeting to discuss the changes and realign on direction", "Work around her changes without addressing the issue", "Complain to other team members about her actions"], "answer_index": 1, "answer": "Call a team meeting to discuss the changes and realign on direction", "explanation": "Open team discussion ensures everyone's input is valued while maintaining collaborative decision-making processes.", "difficulty": "medium", "tags": ["SJT", "teamwork", "communication"], "translations": {}}
{"id": "SJT-0010", "domain": "leadership", "scenario": "As a team lead, you need to deliver difficult feedback to Omar, a high-performing employee who has been dismissive toward junior colleagues.", "choices": ["Ignore it since his technical performance is excellent", "Give the feedback in front of the team as a learning opportunity", "Schedule a private one-on-one meeting to address the behavior", "Ask HR to handle the conversation"], "answer_index": 2, "answer": "Schedule a private one-on-one meeting to address the behavior", "explanation": "Private feedback conversations preserve dignity while addressing important behavioral issues that impact team dynamics.", "difficulty": "medium", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0011", "domain": "ethics", "scenario": "A colleague asks you to clock in for them because they're running late due to a personal emergency. This would violate company policy but they seem genuinely distressed.", "choices": ["Help them this one time since it's an emergency", "Explain that you can't violate policy but offer to speak with the supervisor", "Refuse and suggest they contact HR about emergency leave options", "Clock them in but ask them not to make it a habit"], "answer_index": 2, "answer": "Refuse and suggest they contact HR about emergency leave options", "explanation": "Maintaining policy integrity while directing them to appropriate resources shows both ethical behavior and genuine concern for their situation.", "difficulty": "medium", "tags": ["SJT", "ethics", "professionalism"], "translations": {}}
{"id": "SJT-0012", "domain": "customer_service", "scenario": "A customer, Aicha, is raising her voice and using inappropriate language because her order is delayed. Other customers are watching and seem uncomfortable.", "choices": ["Match her energy to show you won't be intimidated", "Calmly acknowledge her frustration and move the conversation to a private area", "Tell her that abusive behavior won't be tolerated", "Get a manager immediately without trying to resolve it"], "answer_index": 1, "answer": "Calmly acknowledge her frustration and move the conversation to a private area", "explanation": "De-escalation through empathy and privacy protection addresses the customer's needs while maintaining a professional environment for others.", "difficulty": "medium", "tags": ["SJT", "customer_service", "conflict"], "translations": {}}
{"id": "SJT-0013", "domain": "communication", "scenario": "You're presenting quarterly results to executives when the CEO interrupts with a question that reveals a significant error in your data analysis.", "choices": ["Defend your analysis and suggest reviewing it later", "Acknowledge the error immediately and propose next steps", "Deflect by saying the data came from another department", "Continue the presentation and address it privately afterward"], "answer_index": 1, "answer": "Acknowledge the error immediately and propose next steps", "explanation": "Immediate acknowledgment of errors demonstrates integrity and professionalism, building trust through transparency.", "difficulty": "hard", "tags": ["SJT", "communication", "ethics"], "translations": {}}
{"id": "SJT-0014", "domain": "conflict", "scenario": "Meryem and Rachid, two team members, have been having heated arguments during meetings about project priorities, making everyone else uncomfortable.", "choices": ["Let them work it out between themselves", "Suggest they continue their discussion offline after the meeting", "Address the behavior directly during the meeting", "Report both of them to HR for unprofessional conduct"], "answer_index": 1, "answer": "Suggest they continue their discussion offline after the meeting", "explanation": "Redirecting conflict to appropriate venues maintains meeting productivity while allowing for necessary discussions to continue privately.", "difficulty": "easy", "tags": ["SJT", "conflict", "teamwork"], "translations": {}}
{"id": "SJT-0015", "domain": "inclusivity", "scenario": "During a team building activity, you notice that Sofia, who uses a wheelchair, cannot participate in the planned physical activities. She seems disappointed but hasn't said anything.", "choices": ["Suggest alternative activities that everyone can participate in", "Continue with the planned activities since they were already organized", "Ask Sofia privately if she wants to participate in something else", "Ignore the situation since she hasn't complained"], "answer_index": 0, "answer": "Suggest alternative activities that everyone can participate in", "explanation": "Proactively ensuring inclusive activities demonstrates leadership and consideration for all team members' abilities and comfort.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "leadership"], "translations": {}}
{"id": "SJT-0016", "domain": "safety", "scenario": "While working late in the office, you notice that the emergency exit door has been propped open with a chair, violating safety regulations. No one else is around.", "choices": ["Close the door and remove the chair immediately", "Leave a note for the cleaning staff to address it", "Ignore it since it's probably for ventilation", "Take a photo and email the facilities manager"], "answer_index": 0, "answer": "Close the door and remove the chair immediately", "explanation": "Safety violations require immediate action regardless of who's around. Emergency exits must remain unobstructed for everyone's protection.", "difficulty": "easy", "tags": ["SJT", "safety", "responsibility"], "translations": {}}
{"id": "SJT-0017", "domain": "teamwork", "scenario": "During a brainstorming session, Mehdi keeps shooting down everyone's ideas without offering alternatives. The team's energy is declining.", "choices": ["Ask him to suggest solutions rather than just pointing out problems", "Continue the session and address his behavior later", "Remove him from the brainstorming session", "Ask the team to ignore his comments"], "answer_index": 0, "answer": "Ask him to suggest solutions rather than just pointing out problems", "explanation": "Redirecting negative behavior toward constructive contribution maintains team momentum while addressing the issue immediately.", "difficulty": "easy", "tags": ["SJT", "teamwork", "communication"], "translations": {}}
{"id": "SJT-0018", "domain": "leadership", "scenario": "Your team missed an important deadline due to unclear requirements from the client. The client is threatening to cancel the contract. Senior management is demanding answers.", "choices": ["Blame the client for providing unclear requirements", "Take full responsibility and present a plan to recover", "Blame team members for not asking better questions", "Suggest that the deadline was unrealistic from the start"], "answer_index": 1, "answer": "Take full responsibility and present a plan to recover", "explanation": "Leadership accountability combined with proactive solutions demonstrates maturity and maintains stakeholder confidence during crises.", "difficulty": "hard", "tags": ["SJT", "leadership", "responsibility"], "translations": {}}
{"id": "SJT-0019", "domain": "ethics", "scenario": "You discover that your department's budget includes charges for services that were never provided. Your manager says it's a 'standard practice' and tells you not to worry about it.", "choices": ["Follow your manager's advice since they have more experience", "Report the discrepancies to the appropriate authorities", "Document everything but wait for someone else to discover it", "Ask for clarification about the 'standard practice'"], "answer_index": 1, "answer": "Report the discrepancies to the appropriate authorities", "explanation": "Financial irregularities must be reported regardless of internal pressure. Ethical obligations supersede hierarchical loyalty.", "difficulty": "hard", "tags": ["SJT", "ethics", "integrity"], "translations": {}}
{"id": "SJT-0020", "domain": "customer_service", "scenario": "A customer, Khalid, is requesting a service that's outside your company's standard offerings. He's willing to pay extra and says he's been a loyal customer for 10 years.", "choices": ["Decline immediately since it's not a standard service", "Explore creative solutions within company guidelines", "Make an exception since he's a loyal customer", "Refer him to a competitor who might offer that service"], "answer_index": 1, "answer": "Explore creative solutions within company guidelines", "explanation": "Creative problem-solving within established boundaries shows customer commitment while maintaining operational integrity.", "difficulty": "medium", "tags": ["SJT", "customer_service", "problem_solving"], "translations": {}}
{"id": "SJT-0021", "domain": "communication", "scenario": "In a email thread with multiple stakeholders, Zineb accidentally shared confidential salary information. She hasn't realized her mistake yet.", "choices": ["Reply to all asking everyone to disregard the information", "Contact Zineb privately to alert her about the mistake", "Forward the email to HR immediately", "Do nothing and hope no one noticed"], "answer_index": 1, "answer": "Contact Zineb privately to alert her about the mistake", "explanation": "Private notification allows for immediate damage control while preserving professional relationships and minimizing embarrassment.", "difficulty": "easy", "tags": ["SJT", "communication", "professionalism"], "translations": {}}
{"id": "SJT-0022", "domain": "conflict", "scenario": "During a project review, the marketing and engineering teams start blaming each other for delays. Tensions are rising and the meeting is becoming unproductive.", "choices": ["End the meeting and reschedule when emotions cool down", "Focus the discussion on identifying solutions rather than assigning blame", "Ask each team to prepare written statements for the next meeting", "Take a break and meet with team leads separately"], "answer_index": 1, "answer": "Focus the discussion on identifying solutions rather than assigning blame", "explanation": "Redirecting from blame to solutions maintains meeting momentum while addressing the underlying issues constructively.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0023", "domain": "inclusivity", "scenario": "At a company social event, several colleagues are making jokes about different cultural practices. Ahmed, who comes from one of the cultures being discussed, looks uncomfortable but hasn't said anything.", "choices": ["Join in with the jokes to fit in with the group", "Change the subject to something more neutral", "Speak up about the inappropriateness of the jokes", "Check with Ahmed privately to see if he's okay"], "answer_index": 2, "answer": "Speak up about the inappropriateness of the jokes", "explanation": "Taking a stand against inappropriate behavior demonstrates leadership and creates a more inclusive environment for everyone.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "ethics"], "translations": {}}
{"id": "SJT-0024", "domain": "safety", "scenario": "You see a delivery truck blocking the emergency vehicle access route. The driver is inside the building making a delivery and the truck will only be there for a few more minutes.", "choices": ["Wait for the driver to return since it's only temporary", "Go inside and ask the driver to move the truck immediately", "Call security to have the truck moved", "Take a photo and report it to management later"], "answer_index": 1, "answer": "Go inside and ask the driver to move the truck immediately", "explanation": "Emergency access routes must never be blocked, even temporarily. Immediate action prevents potential catastrophic delays in emergency situations.", "difficulty": "easy", "tags": ["SJT", "safety", "responsibility"], "translations": {}}
{"id": "SJT-0025", "domain": "teamwork", "scenario": "Your team is working remotely and you notice that Layla consistently misses virtual meetings or joins very late, affecting project coordination. She hasn't given any explanation.", "choices": ["Address it publicly in the next team meeting", "Speak with her privately to understand any challenges", "Report her attendance issues to your manager", "Stop including her in critical meetings"], "answer_index": 1, "answer": "Speak with her privately to understand any challenges", "explanation": "Private conversation allows for understanding potential challenges while maintaining professional relationships and finding supportive solutions.", "difficulty": "easy", "tags": ["SJT", "teamwork", "communication"], "translations": {}}
{"id": "SJT-0026", "domain": "leadership", "scenario": "As a department head, you need to implement new cost-cutting measures that will eliminate overtime opportunities. Your team relies on overtime pay to supplement their income.", "choices": ["Implement the changes without explanation to avoid arguments", "Meet with the team to explain the situation and explore alternatives", "Delay implementation until you find a way to avoid the cuts", "Let HR handle the communication about the changes"], "answer_index": 1, "answer": "Meet with the team to explain the situation and explore alternatives", "explanation": "Transparent communication about difficult decisions while seeking collaborative solutions demonstrates respectful leadership and builds trust.", "difficulty": "hard", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0027", "domain": "ethics", "scenario": "A vendor offers you expensive sports tickets as a 'thank you' for your business. Your company policy prohibits gifts over a certain value, but the tickets would be a great opportunity to network.", "choices": ["Accept the tickets since networking benefits the company", "Decline the tickets and explain the company policy", "Accept the tickets but report them to your manager", "Ask the vendor to give the tickets to your manager instead"], "answer_index": 1, "answer": "Decline the tickets and explain the company policy", "explanation": "Following ethical guidelines consistently builds trust and protects both personal and organizational integrity.", "difficulty": "medium", "tags": ["SJT", "ethics", "professionalism"], "translations": {}}
{"id": "SJT-0028", "domain": "customer_service", "scenario": "A customer, Salma, is demanding to speak with your manager about a policy she disagrees with. Your manager is in an important meeting and asked not to be disturbed.", "choices": ["Interrupt your manager's meeting to get guidance", "Explain the situation and ask if she can wait or schedule a callback", "Tell her the manager is unavailable and end the conversation", "Transfer her to another department to handle the complaint"], "answer_index": 1, "answer": "Explain the situation and ask if she can wait or schedule a callback", "explanation": "Balancing customer needs with operational requirements while offering alternatives demonstrates professional service management.", "difficulty": "easy", "tags": ["SJT", "customer_service", "communication"], "translations": {}}
{"id": "SJT-0029", "domain": "communication", "scenario": "During a presentation to external clients, you realize that the financial projections you're showing contain a significant error that makes your proposal look much more attractive than it actually is.", "choices": ["Continue the presentation and correct it in follow-up materials", "Stop immediately and correct the error in front of the clients", "Finish the presentation quickly and call them later", "Mention that the figures are 'preliminary' and subject to review"], "answer_index": 1, "answer": "Stop immediately and correct the error in front of the clients", "explanation": "Immediate transparency about errors builds trust and credibility, which are essential for long-term business relationships.", "difficulty": "hard", "tags": ["SJT", "communication", "ethics"], "translations": {}}
{"id": "SJT-0030", "domain": "conflict", "scenario": "Two team members, Ilias and Hanane, have very different work styles and their approaches are causing friction. Their conflict is starting to affect other team members.", "choices": ["Assign them to different projects to avoid future conflicts", "Facilitate a conversation to help them understand each other's styles", "Ask the team to vote on which approach to use", "Let them figure it out on their own"], "answer_index": 1, "answer": "Facilitate a conversation to help them understand each other's styles", "explanation": "Mediated dialogue helps team members understand and appreciate different work styles, turning potential conflict into team strength.", "difficulty": "medium", "tags": ["SJT", "conflict", "teamwork"], "translations": {}}
{"id": "SJT-0031", "domain": "inclusivity", "scenario": "During a team meeting, an older colleague, Said, makes comments suggesting that younger employees lack work ethic and commitment. Several younger team members appear offended.", "choices": ["Agree with Said to maintain harmony with senior staff", "Challenge his statements and promote understanding across generations", "Change the subject without addressing the comments", "Speak with the younger employees privately afterward"], "answer_index": 1, "answer": "Challenge his statements and promote understanding across generations", "explanation": "Addressing generational bias directly while promoting mutual understanding creates a more inclusive and respectful workplace for everyone.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "communication"], "translations": {}}
{"id": "SJT-0032", "domain": "safety", "scenario": "During a fire drill, you notice that several employees are not taking the drill seriously and are walking slowly or stopping to chat. This could be dangerous in a real emergency.", "choices": ["Join them in treating it casually since it's just a drill", "Encourage them to treat the drill seriously for safety reasons", "Report their behavior to management after the drill", "Ignore them and focus on your own evacuation"], "answer_index": 1, "answer": "Encourage them to treat the drill seriously for safety reasons", "explanation": "Safety training effectiveness depends on realistic practice. Encouraging proper behavior during drills can save lives in real emergencies.", "difficulty": "easy", "tags": ["SJT", "safety", "leadership"], "translations": {}}
{"id": "SJT-0033", "domain": "teamwork", "scenario": "Your team is behind schedule on a project and everyone is stressed. Driss suggests cutting corners on quality testing to meet the deadline. Other team members seem to be considering this option.", "choices": ["Support the suggestion to maintain team unity", "Advocate for maintaining quality standards despite the delay", "Suggest a compromise with minimal testing", "Ask the project manager to make the decision"], "answer_index": 1, "answer": "Advocate for maintaining quality standards despite the delay", "explanation": "Upholding quality standards protects the organization's reputation and client relationships, even when facing schedule pressures.", "difficulty": "medium", "tags": ["SJT", "teamwork", "ethics"], "translations": {}}
{"id": "SJT-0034", "domain": "leadership", "scenario": "As a supervisor, you discover that one of your direct reports, Khadija, has been struggling with personal issues that are affecting her work performance. She hasn't asked for help but clearly needs support.", "choices": ["Wait for her to ask for help rather than intruding", "Offer support and discuss available resources privately", "Document the performance issues in case formal action is needed", "Assign her lighter workload without discussing it"], "answer_index": 1, "answer": "Offer support and discuss available resources privately", "explanation": "Proactive, compassionate leadership that offers support while respecting privacy helps employees through difficult times and maintains team effectiveness.", "difficulty": "medium", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0035", "domain": "ethics", "scenario": "You accidentally gain access to confidential information about planned layoffs in your department. The information isn't official yet, but it affects several of your colleagues.", "choices": ["Share the information privately with affected colleagues", "Keep the information confidential until it's officially announced", "Ask your manager about the information you accidentally saw", "Anonymously leak the information to help people prepare"], "answer_index": 1, "answer": "Keep the information confidential until it's officially announced", "explanation": "Maintaining confidentiality of sensitive information is crucial for trust and organizational integrity, regardless of how the information was obtained.", "difficulty": "hard", "tags": ["SJT", "ethics", "professionalism"], "translations": {}}
{"id": "SJT-0036", "domain": "customer_service", "scenario": "A corporate client, represented by Nour, is requesting a discount that would eliminate your profit margin on the project. They claim budget constraints but the work still needs to be done.", "choices": ["Accept the discount to maintain the relationship", "Decline and risk losing the client", "Negotiate alternative solutions that provide value while maintaining profitability", "Offer the discount this time but increase prices on future projects"], "answer_index": 2, "answer": "Negotiate alternative solutions that provide value while maintaining profitability", "explanation": "Creative problem-solving that addresses client needs while protecting business sustainability demonstrates professional client management.", "difficulty": "hard", "tags": ["SJT", "customer_service", "leadership"], "translations": {}}
{"id": "SJT-0037", "domain": "communication", "scenario": "During a virtual team meeting, you notice that Bilal has been multitasking and seems distracted. When asked for his input, he admits he wasn't paying attention.", "choices": ["Continue the meeting and brief him privately afterward", "Recap the discussion for him in front of everyone", "Ask him to focus or leave the meeting", "Ignore the situation and move on"], "answer_index": 0, "answer": "Continue the meeting and brief him privately afterward", "explanation": "Maintaining meeting flow while addressing the issue privately preserves professional relationships and ensures everyone stays informed.", "difficulty": "easy", "tags": ["SJT", "communication", "professionalism"], "translations": {}}
{"id": "SJT-0038", "domain": "conflict", "scenario": "The sales and operations teams are in disagreement about product delivery timelines. Sales promises faster delivery to win clients, while operations says the timelines are unrealistic.", "choices": ["Side with sales since they drive revenue", "Support operations since they understand the process", "Facilitate a joint meeting to establish realistic timelines everyone can commit to", "Escalate the issue to senior management"], "answer_index": 2, "answer": "Facilitate a joint meeting to establish realistic timelines everyone can commit to", "explanation": "Collaborative problem-solving creates sustainable solutions that serve both customer needs and operational realities.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0039", "domain": "inclusivity", "scenario": "During a brainstorming session, you notice that Samira, who is less fluent in the meeting language, is trying to contribute but seems hesitant and is often interrupted when she speaks.", "choices": ["Continue the meeting normally since everyone should adapt", "Deliberately ask for her input and ensure she has time to express her ideas", "Suggest she submit her ideas in writing after the meeting", "Speak with her privately afterward to get her thoughts"], "answer_index": 1, "answer": "Deliberately ask for her input and ensure she has time to express her ideas", "explanation": "Actively ensuring all voices are heard creates an inclusive environment where diverse perspectives can contribute to better outcomes.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "teamwork"], "translations": {}}
{"id": "SJT-0040", "domain": "safety", "scenario": "While visiting a client site, you observe that workers are not wearing required personal protective equipment. Your client contact mentions that they're behind schedule and 'can't waste time' on safety gear.", "choices": ["Focus on your business and ignore the safety issues", "Politely suggest they prioritize safety compliance", "Report the safety violations to relevant authorities", "Refuse to continue the meeting until safety protocols are followed"], "answer_index": 1, "answer": "Politely suggest they prioritize safety compliance", "explanation": "Professional advocacy for safety standards demonstrates corporate responsibility while maintaining business relationships through respectful communication.", "difficulty": "medium", "tags": ["SJT", "safety", "ethics"], "translations": {}}
{"id": "SJT-0041", "domain": "teamwork", "scenario": "Your cross-functional team includes members from different time zones. Some team members consistently schedule meetings that exclude colleagues in certain regions, citing urgency.", "choices": ["Accept it since urgent matters can't wait for everyone", "Advocate for rotating meeting times to include all team members", "Suggest asynchronous communication for non-urgent decisions", "Let the excluded members complain if they have issues"], "answer_index": 1, "answer": "Advocate for rotating meeting times to include all team members", "explanation": "Ensuring equitable participation across time zones strengthens team cohesion and leverages diverse perspectives for better decision-making.", "difficulty": "medium", "tags": ["SJT", "teamwork", "inclusivity"], "translations": {}}
{"id": "SJT-0042", "domain": "leadership", "scenario": "Your team exceeded their quarterly goals, but you know that Yasmine did significantly more work than others while some team members contributed minimally. Everyone expects equal recognition.", "choices": ["Give everyone equal recognition to maintain team harmony", "Recognize contributions proportionally based on actual performance", "Recognize the team as a whole without individual distinctions", "Let Yasmine know privately that you appreciate her extra effort"], "answer_index": 1, "answer": "Recognize contributions proportionally based on actual performance", "explanation": "Fair recognition based on contribution motivates high performers and sets clear expectations for team standards.", "difficulty": "hard", "tags": ["SJT", "leadership", "ethics"], "translations": {}}
{"id": "SJT-0043", "domain": "ethics", "scenario": "A competitor's employee contacts you with an offer to share confidential information about their company's upcoming product launch in exchange for consideration for a job.", "choices": ["Accept the information since it would benefit your company", "Decline and report the incident to your management", "Listen to the information but don't act on it", "Tell them to apply through normal channels without sharing information"], "answer_index": 1, "answer": "Decline and report the incident to your management", "explanation": "Rejecting industrial espionage attempts and reporting them protects your organization's ethical reputation and legal standing.", "difficulty": "hard", "tags": ["SJT", "ethics", "integrity"], "translations": {}}
{"id": "SJT-0044", "domain": "customer_service", "scenario": "A client, Farid, calls to complain about a service issue that was caused by his team's failure to provide necessary information. He's demanding compensation for the resulting delays.", "choices": ["Immediately offer compensation to satisfy the client", "Explain diplomatically how the issue occurred and work toward a solution", "Firmly tell him the problem was his fault", "Transfer him to a manager without attempting resolution"], "answer_index": 1, "answer": "Explain diplomatically how the issue occurred and work toward a solution", "explanation": "Tactful education about cause-and-effect while focusing on solutions maintains relationships while addressing misconceptions professionally.", "difficulty": "medium", "tags": ["SJT", "customer_service", "communication"], "translations": {}}
{"id": "SJT-0045", "domain": "communication", "scenario": "You're giving a presentation when a senior executive challenges your methodology in front of other stakeholders. You believe your approach is correct but realize you don't have supporting data readily available.", "choices": ["Defend your methodology confidently and provide data later", "Acknowledge the question and offer to provide detailed analysis afterward", "Admit you might be wrong and defer to their expertise", "Deflect by asking others for their opinions"], "answer_index": 1, "answer": "Acknowledge the question and offer to provide detailed analysis afterward", "explanation": "Professional acknowledgment of valid questions while committing to thorough follow-up demonstrates confidence and thoroughness.", "difficulty": "medium", "tags": ["SJT", "communication", "professionalism"], "translations": {}}
{"id": "SJT-0046", "domain": "conflict", "scenario": "During a team retrospective, Mounia and Tarik start arguing about who was responsible for a project setback. Their argument is becoming personal and other team members are becoming uncomfortable.", "choices": ["Let them work through their differences publicly", "Intervene and redirect focus to learning and improvement", "End the retrospective early", "Ask other team members to mediate"], "answer_index": 1, "answer": "Intervene and redirect focus to learning and improvement", "explanation": "Facilitating constructive dialogue prevents personal conflicts from derailing team learning and maintains a professional environment.", "difficulty": "easy", "tags": ["SJT", "conflict", "teamwork"], "translations": {}}
{"id": "SJT-0047", "domain": "inclusivity", "scenario": "Your company is planning a team event at a venue that is not accessible to employees with mobility challenges. When you point this out, the organizer says it's too late to change venues.", "choices": ["Accept the decision since the venue is already booked", "Insist on finding an accessible alternative venue", "Suggest the affected employees participate virtually", "Organize a separate, accessible event for affected employees"], "answer_index": 1, "answer": "Insist on finding an accessible alternative venue", "explanation": "Ensuring accessibility for all employees is a fundamental inclusion requirement that demonstrates organizational values in action.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "ethics"], "translations": {}}
{"id": "SJT-0048", "domain": "safety", "scenario": "You notice that the first aid kit in your work area is nearly empty and hasn't been restocked despite previous requests. A colleague mentions they cut themselves but the kit lacks proper supplies.", "choices": ["Tell them to use whatever is available in the kit", "Help them find supplies elsewhere and escalate the restocking issue", "Suggest they go to a pharmacy to buy their own supplies", "Document the incident for future reference"], "answer_index": 1, "answer": "Help them find supplies elsewhere and escalate the restocking issue", "explanation": "Immediate care for injury combined with systematic issue resolution ensures both current safety and future preparedness.", "difficulty": "easy", "tags": ["SJT", "safety", "responsibility"], "translations": {}}
{"id": "SJT-0049", "domain": "teamwork", "scenario": "Your agile development team has been consistently missing sprint commitments. During the retrospective, some members blame external dependencies while others point to overcommitment.", "choices": ["Focus only on external factors since they're easier to address", "Examine both internal capacity planning and external dependency management", "Assign blame to whoever is most responsible for the delays", "Suggest reducing sprint commitments without analyzing root causes"], "answer_index": 1, "answer": "Examine both internal capacity planning and external dependency management", "explanation": "Comprehensive analysis of all contributing factors leads to sustainable solutions and prevents recurring issues.", "difficulty": "medium", "tags": ["SJT", "teamwork", "problem_solving"], "translations": {}}
{"id": "SJT-0050", "domain": "leadership", "scenario": "As a project manager, you're informed that the budget for your project has been cut by 30%, but the scope and timeline remain unchanged. Your team is already working at capacity.", "choices": ["Accept the constraints and hope the team can adapt", "Negotiate scope reduction or timeline extension with stakeholders", "Tell the team they need to work harder to meet the demands", "Look for ways to cut corners on quality or process"], "answer_index": 1, "answer": "Negotiate scope reduction or timeline extension with stakeholders", "explanation": "Realistic project management requires balancing scope, time, and budget constraints through stakeholder negotiation rather than compromising team welfare or quality.", "difficulty": "hard", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0051", "domain": "ethics", "scenario": "You discover that a colleague, Amine, has been inflating their expense reports by including personal meals as business expenses. The amounts are relatively small but the pattern is consistent.", "choices": ["Ignore it since the amounts are small", "Speak with Amine directly about the inappropriate expenses", "Report the expense fraud to management or HR", "Document the evidence but wait to see if it continues"], "answer_index": 2, "answer": "Report the expense fraud to management or HR", "explanation": "Financial fraud, regardless of amount, must be reported to maintain organizational integrity and prevent escalation of unethical behavior.", "difficulty": "medium", "tags": ["SJT", "ethics", "integrity"], "translations": {}}
{"id": "SJT-0052", "domain": "customer_service", "scenario": "During a service call, a client named Leila becomes frustrated with technical difficulties and starts criticizing your company's reliability. Her complaints are valid but her tone is becoming aggressive.", "choices": ["Match her tone to show you won't be intimidated", "Acknowledge her frustration and focus on resolving the technical issues", "End the call and have a supervisor contact her later", "Defend your company's reputation vigorously"], "answer_index": 1, "answer": "Acknowledge her frustration and focus on resolving the technical issues", "explanation": "Empathetic acknowledgment combined with solution-focused action de-escalates tension while addressing the underlying service issue.", "difficulty": "medium", "tags": ["SJT", "customer_service", "conflict"], "translations": {}}
{"id": "SJT-0053", "domain": "communication", "scenario": "During a client presentation, you realize that the slides you're showing contain outdated information that could mislead the client about current capabilities.", "choices": ["Continue with the presentation and send corrections later", "Stop and explain that some information needs updating", "Rush through the slides quickly without drawing attention to them", "Blame the outdated information on a team member"], "answer_index": 1, "answer": "Stop and explain that some information needs updating", "explanation": "Transparency about outdated information demonstrates integrity and prevents client decisions based on inaccurate data.", "difficulty": "medium", "tags": ["SJT", "communication", "ethics"], "translations": {}}
{"id": "SJT-0054", "domain": "conflict", "scenario": "Jamila and Kamal, two department heads, disagree about resource allocation for the next quarter. Their disagreement is causing delays in budget planning and affecting their teams' morale.", "choices": ["Let them resolve it themselves since they're both experienced", "Suggest they present their cases to senior management for decision", "Facilitate a mediation session to find a compromise solution", "Recommend splitting resources equally between their departments"], "answer_index": 2, "answer": "Facilitate a mediation session to find a compromise solution", "explanation": "Structured mediation often reveals creative solutions that satisfy both parties' core needs while maintaining working relationships.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0055", "domain": "inclusivity", "scenario": "During a company celebration, the entertainment and food choices primarily reflect one cultural tradition. You notice that employees from other cultural backgrounds seem less engaged in the festivities.", "choices": ["Enjoy the celebration since it was already planned", "Suggest incorporating diverse cultural elements in future events", "Organize a separate event for underrepresented cultures", "Point out the lack of cultural diversity to the organizers immediately"], "answer_index": 1, "answer": "Suggest incorporating diverse cultural elements in future events", "explanation": "Constructive feedback about inclusive planning helps create more welcoming environments for all employees in future celebrations.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "communication"], "translations": {}}
{"id": "SJT-0056", "domain": "safety", "scenario": "While working in a shared workspace, you notice that Soukaina consistently leaves her workstation cluttered with cables and equipment, creating a tripping hazard for others.", "choices": ["Move her equipment yourself to clear the walkway", "Speak with her about organizing her workspace for safety", "Report the safety hazard to facilities management", "Put up warning signs around her workspace"], "answer_index": 1, "answer": "Speak with her about organizing her workspace for safety", "explanation": "Direct, collegial communication about safety concerns often leads to immediate resolution while maintaining professional relationships.", "difficulty": "easy", "tags": ["SJT", "safety", "communication"], "translations": {}}
{"id": "SJT-0057", "domain": "teamwork", "scenario": "Your project team needs to decide between two technical approaches. Half the team strongly supports Option A, while the other half advocates for Option B. Both options have merit and drawbacks.", "choices": ["Go with the option supported by the most senior team members", "Take a vote and implement the majority choice", "Analyze both options objectively and choose based on project criteria", "Suggest a hybrid approach combining elements of both options"], "answer_index": 2, "answer": "Analyze both options objectively and choose based on project criteria", "explanation": "Objective analysis based on project requirements leads to better technical decisions than popularity contests or seniority-based choices.", "difficulty": "medium", "tags": ["SJT", "teamwork", "problem_solving"], "translations": {}}
{"id": "SJT-0058", "domain": "leadership", "scenario": "As a team supervisor, you learn that Yousra, one of your high-performing employees, is being recruited by a competitor offering significantly higher compensation.", "choices": ["Try to convince her to stay by promising future opportunities", "Accept her departure gracefully and wish her well", "Discuss her situation with HR to explore retention options", "Ask her to train her replacement before leaving"], "answer_index": 2, "answer": "Discuss her situation with HR to explore retention options", "explanation": "Systematic exploration of retention possibilities shows value for good employees while following proper organizational processes.", "difficulty": "medium", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0059", "domain": "ethics", "scenario": "You're asked to provide a reference for a former colleague, Reda, who was a poor performer but is a good person. He's struggling to find employment and asks you to focus only on his positive qualities.", "choices": ["Give a completely positive reference to help him find work", "Provide an honest assessment of both strengths and weaknesses", "Decline to provide a reference", "Give a positive reference but mention it's based on personal qualities only"], "answer_index": 1, "answer": "Provide an honest assessment of both strengths and weaknesses", "explanation": "Professional references require honesty to maintain trust with future employers while being fair to both the candidate and hiring organizations.", "difficulty": "hard", "tags": ["SJT", "ethics", "communication"], "translations": {}}
{"id": "SJT-0060", "domain": "customer_service", "scenario": "A long-term client, Ibrahim, requests a service modification that would require significant additional work but offers no additional compensation, citing their long relationship with your company.", "choices": ["Agree to the request to maintain the long-term relationship", "Explain the additional costs associated with the modification", "Refuse the request since there's no additional compensation", "Offer a discounted rate as a compromise"], "answer_index": 1, "answer": "Explain the additional costs associated with the modification", "explanation": "Transparent communication about service costs educates clients about value while preserving business sustainability and professional relationships.", "difficulty": "medium", "tags": ["SJT", "customer_service", "communication"], "translations": {}}
{"id": "SJT-0061", "domain": "communication", "scenario": "During a team video call, you notice that Chaimae's microphone is picking up background noise from her environment, making it difficult for others to focus on the discussion.", "choices": ["Send her a private message asking her to mute when not speaking", "Publicly ask her to check her audio settings", "Ignore it and hope she notices on her own", "Continue the meeting and address it afterwards"], "answer_index": 0, "answer": "Send her a private message asking her to mute when not speaking", "explanation": "Private communication about technical issues preserves dignity while solving the immediate problem for all meeting participants.", "difficulty": "easy", "tags": ["SJT", "communication", "professionalism"], "translations": {}}
{"id": "SJT-0062", "domain": "conflict", "scenario": "During a project deadline crunch, the design and development teams are blaming each other for delays. Each team claims the other provided incomplete or late deliverables.", "choices": ["Focus on completing the project first, then address the blame later", "Investigate the timeline to determine who is actually at fault", "Bring both teams together to focus on solutions for the remaining work", "Escalate to management to make a definitive judgment"], "answer_index": 2, "answer": "Bring both teams together to focus on solutions for the remaining work", "explanation": "Solution-focused collaboration during crises maximizes chance of meeting deadlines while building better inter-team relationships.", "difficulty": "medium", "tags": ["SJT", "conflict", "teamwork"], "translations": {}}
{"id": "SJT-0063", "domain": "inclusivity", "scenario": "During a team lunch, colleagues are discussing weekend plans that all involve activities requiring significant physical mobility. Hamza, who has limited mobility, doesn't participate in the conversation.", "choices": ["Continue the conversation since it's just casual talk", "Suggest some alternative activities that would be accessible to everyone", "Change the subject to something more inclusive", "Ask Hamza privately what he likes to do on weekends"], "answer_index": 1, "answer": "Suggest some alternative activities that would be accessible to everyone", "explanation": "Proactively promoting inclusive social activities ensures all team members can participate in relationship-building opportunities.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "teamwork"], "translations": {}}
{"id": "SJT-0064", "domain": "safety", "scenario": "You discover that the building's smoke detectors haven't been tested in over a year, despite regulations requiring quarterly testing. The facilities manager is aware but says it's 'not a priority right now.'", "choices": ["Accept their decision since they're responsible for building management", "Research the regulations and present the compliance requirements", "Report the safety violation to the appropriate authorities", "Test the detectors yourself to ensure they work"], "answer_index": 1, "answer": "Research the regulations and present the compliance requirements", "explanation": "Providing factual information about safety compliance helps facilities management prioritize appropriately while maintaining professional relationships.", "difficulty": "medium", "tags": ["SJT", "safety", "communication"], "translations": {}}
{"id": "SJT-0065", "domain": "teamwork", "scenario": "Your remote team has been working well together, but recently Abdelkader has been less responsive to messages and hasn't been participating actively in virtual meetings. His work quality remains good.", "choices": ["Ignore it since his work quality is still acceptable", "Address his participation publicly during the next team meeting", "Schedule a private video call to check in with him", "Report the change in behavior to your manager"], "answer_index": 2, "answer": "Schedule a private video call to check in with him", "explanation": "Personal check-ins demonstrate care for team members while identifying potential issues early before they impact team performance.", "difficulty": "easy", "tags": ["SJT", "teamwork", "communication"], "translations": {}}
{"id": "SJT-0066", "domain": "leadership", "scenario": "Your department is being restructured and you need to inform your team that some roles will be eliminated. The decision has been made by senior management and cannot be changed.", "choices": ["Wait until the last moment to minimize anxiety", "Communicate the news immediately with available details and support resources", "Let HR handle all communication about the restructuring", "Inform team members individually based on how it affects them"], "answer_index": 1, "answer": "Communicate the news immediately with available details and support resources", "explanation": "Transparent, timely communication with support resources helps teams process difficult news while maintaining trust and dignity.", "difficulty": "hard", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0067", "domain": "ethics", "scenario": "A supplier offers to provide additional services at no charge in exchange for a positive reference that you know their service quality doesn't warrant.", "choices": ["Accept the free services but give an honest reference", "Decline the offer and maintain objectivity", "Accept both the services and provide the positive reference", "Negotiate for services while giving a neutral reference"], "answer_index": 1, "answer": "Decline the offer and maintain objectivity", "explanation": "Maintaining independent judgment and honest assessment is crucial for professional credibility and ethical business relationships.", "difficulty": "medium", "tags": ["SJT", "ethics", "integrity"], "translations": {}}
{"id": "SJT-0068", "domain": "customer_service", "scenario": "A client, Malika, is requesting a full refund for services delivered six months ago, claiming dissatisfaction. Your company policy allows refunds within 30 days, but she's been a valuable long-term client.", "choices": ["Apply the policy strictly and deny the refund", "Make an exception due to her client value and grant the full refund", "Offer a credit toward future services as a compromise", "Escalate to management without making any commitment"], "answer_index": 2, "answer": "Offer a credit toward future services as a compromise", "explanation": "Creative solutions that acknowledge client value while respecting policy boundaries often satisfy both business and customer relationship needs.", "difficulty": "medium", "tags": ["SJT", "customer_service", "problem_solving"], "translations": {}}
{"id": "SJT-0069", "domain": "communication", "scenario": "You're facilitating a brainstorming session when Othmane presents an idea that you immediately recognize as impractical due to budget constraints, but others seem excited about it.", "choices": ["Let the discussion continue and address practicality later", "Immediately point out the budget constraints to save time", "Ask probing questions to help the group discover the constraints", "Support the idea publicly but speak to Othmane privately afterward"], "answer_index": 2, "answer": "Ask probing questions to help the group discover the constraints", "explanation": "Guided discovery through questions maintains creative energy while helping teams reach realistic conclusions organically.", "difficulty": "medium", "tags": ["SJT", "communication", "leadership"], "translations": {}}
{"id": "SJT-0070", "domain": "conflict", "scenario": "Two project stakeholders, Aicha and Nabil, have conflicting requirements for the same feature. Both requirements are valid from their respective departmental perspectives, but implementing both would exceed the budget.", "choices": ["Choose the requirement from the more senior stakeholder", "Implement the less expensive requirement", "Facilitate a meeting to find a solution that addresses both needs within budget", "Ask the project sponsor to make the decision"], "answer_index": 2, "answer": "Facilitate a meeting to find a solution that addresses both needs within budget", "explanation": "Collaborative problem-solving often reveals creative solutions that satisfy core needs of all stakeholders within constraints.", "difficulty": "hard", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0071", "domain": "inclusivity", "scenario": "During a company presentation, a colleague uses terminology that could be considered insensitive to people with disabilities. The presenter doesn't seem aware of the impact of their language choice.", "choices": ["Speak up immediately during the presentation", "Send them feedback privately after the presentation", "Report the incident to HR", "Ignore it since it wasn't intentionally offensive"], "answer_index": 1, "answer": "Send them feedback privately after the presentation", "explanation": "Private feedback allows for education and awareness building while maintaining professional relationships and avoiding public embarrassment.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "communication"], "translations": {}}
{"id": "SJT-0072", "domain": "safety", "scenario": "During a workplace inspection, you notice that several emergency exits have storage boxes placed in front of them. The facility manager says they'll address it 'when they have time.'", "choices": ["Accept their response since they're the authority", "Offer to help move the boxes immediately", "Document the violation and report it to safety authorities", "Move the boxes yourself without permission"], "answer_index": 1, "answer": "Offer to help move the boxes immediately", "explanation": "Emergency exit blockages require immediate action. Offering assistance shows initiative while respecting authority relationships.", "difficulty": "easy", "tags": ["SJT", "safety", "teamwork"], "translations": {}}
{"id": "SJT-0073", "domain": "teamwork", "scenario": "Your team is using a new collaboration tool that some members are struggling to adopt. Productivity is suffering as people revert to old methods or skip collaboration entirely.", "choices": ["Force everyone to use the new tool by disabling old methods", "Provide additional training and support for struggling team members", "Abandon the new tool and return to previous methods", "Let each person choose their preferred method"], "answer_index": 1, "answer": "Provide additional training and support for struggling team members", "explanation": "Supporting team members through technology transitions ensures successful adoption and maintains team productivity and cohesion.", "difficulty": "easy", "tags": ["SJT", "teamwork", "leadership"], "translations": {}}
{"id": "SJT-0074", "domain": "leadership", "scenario": "As a department head, you discover that another department has been using your team's resources without permission, causing delays in your projects. The other department head is at your same level.", "choices": ["Confront them aggressively to establish boundaries", "Discuss the issue professionally and establish clear resource-sharing protocols", "Report them to senior management immediately", "Restrict access to your resources without discussion"], "answer_index": 1, "answer": "Discuss the issue professionally and establish clear resource-sharing protocols", "explanation": "Professional dialogue between peers to establish clear boundaries and protocols prevents future conflicts while maintaining working relationships.", "difficulty": "medium", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0075", "domain": "ethics", "scenario": "A client offers you a consulting opportunity outside of work that would be well-paid but potentially compete with your employer's services. Your employment contract is ambiguous about such situations.", "choices": ["Accept the opportunity since the contract is unclear", "Decline automatically to avoid any potential conflict", "Discuss the opportunity with your manager before deciding", "Accept but keep it secret from your employer"], "answer_index": 2, "answer": "Discuss the opportunity with your manager before deciding", "explanation": "Transparent communication about potential conflicts of interest demonstrates integrity and allows for appropriate guidance on ethical boundaries.", "difficulty": "hard", "tags": ["SJT", "ethics", "communication"], "translations": {}}
{"id": "SJT-0076", "domain": "customer_service", "scenario": "A customer, Yassine, is requesting a refund for a service that was delivered according to specifications, but he claims it doesn't meet his business needs. He's threatening negative reviews if denied.", "choices": ["Give the refund to avoid negative reviews", "Deny the refund and explain that threats won't influence decisions", "Offer alternative solutions that might address his business needs", "Escalate the threat to legal counsel"], "answer_index": 2, "answer": "Offer alternative solutions that might address his business needs", "explanation": "Focusing on solving the underlying business problem often resolves customer dissatisfaction more effectively than simply granting or denying refunds.", "difficulty": "hard", "tags": ["SJT", "customer_service", "problem_solving"], "translations": {}}
{"id": "SJT-0077", "domain": "communication", "scenario": "During a status meeting, you realize that the project timeline you presented last week was overly optimistic due to new complications that have emerged.", "choices": ["Continue with the original timeline and work harder to meet it", "Immediately update stakeholders on the revised timeline with explanations", "Wait until next week's meeting to provide an update", "Blame the complications on external factors"], "answer_index": 1, "answer": "Immediately update stakeholders on the revised timeline with explanations", "explanation": "Prompt communication about changes allows stakeholders to adjust their plans and demonstrates professional accountability.", "difficulty": "medium", "tags": ["SJT", "communication", "leadership"], "translations": {}}
{"id": "SJT-0078", "domain": "conflict", "scenario": "Your team is split on whether to adopt a new technology. Half see it as essential for competitiveness, while others view it as an unnecessary risk. The debate is consuming meeting time.", "choices": ["Make the decision yourself to end the debate", "Conduct a detailed cost-benefit analysis and present findings to the team", "Put it to a vote and implement the majority decision", "Table the discussion until next quarter"], "answer_index": 1, "answer": "Conduct a detailed cost-benefit analysis and present findings to the team", "explanation": "Objective analysis provides a factual basis for decision-making and often resolves philosophical differences through data.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0079", "domain": "inclusivity", "scenario": "During a team building event, you notice that the activities require strong English language skills. Some team members whose first language isn't English seem to be struggling to participate fully.", "choices": ["Continue with planned activities since English is the business language", "Suggest modifications to make activities more accessible to all participants", "Pair struggling participants with English-fluent teammates", "Switch to activities that rely less on language skills"], "answer_index": 1, "answer": "Suggest modifications to make activities more accessible to all participants", "explanation": "Proactively adapting activities to ensure equal participation demonstrates inclusive leadership and maximizes team building benefits.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "leadership"], "translations": {}}
{"id": "SJT-0080", "domain": "safety", "scenario": "You witness a coworker, Mohamed, operating machinery without proper safety gear during a busy production period. Supervisors are focused on meeting urgent deadlines.", "choices": ["Wait for supervisors to notice and address it", "Stop Mohamed immediately and insist he use proper safety gear", "Report it to supervisors after the deadline pressure passes", "Offer to help speed up the work so he has time for safety procedures"], "answer_index": 1, "answer": "Stop Mohamed immediately and insist he use proper safety gear", "explanation": "Safety requirements cannot be compromised for production deadlines. Immediate intervention prevents potential serious injury.", "difficulty": "easy", "tags": ["SJT", "safety", "responsibility"], "translations": {}}
{"id": "SJT-0081", "domain": "teamwork", "scenario": "Your project team includes members across multiple time zones. Some team members in certain regions consistently miss critical communications because they arrive outside business hours.", "choices": ["Accept that some time zones will be disadvantaged", "Rotate communication timing to fairly distribute the burden", "Require all team members to check communications outside business hours", "Use only asynchronous communication methods"], "answer_index": 1, "answer": "Rotate communication timing to fairly distribute the burden", "explanation": "Equitable distribution of inconvenience demonstrates fair leadership and ensures all team members can participate effectively.", "difficulty": "medium", "tags": ["SJT", "teamwork", "inclusivity"], "translations": {}}
{"id": "SJT-0082", "domain": "leadership", "scenario": "A team member, Safaa, has been consistently delivering excellent work but recently requested to work on different types of projects for professional development. Your current project needs her expertise.", "choices": ["Deny the request since her current contribution is essential", "Work with her to transition her knowledge while exploring development opportunities", "Grant the request immediately to keep her motivated", "Promise to consider it after the current project ends"], "answer_index": 1, "answer": "Work with her to transition her knowledge while exploring development opportunities", "explanation": "Balancing immediate project needs with employee development shows strategic leadership that supports both current and future success.", "difficulty": "hard", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0083", "domain": "ethics", "scenario": "You discover that a popular industry practice your company follows may actually violate newly updated regulations. Changing practices would be expensive and put you at a competitive disadvantage.", "choices": ["Continue current practices until enforcement actions force change", "Research the regulations thoroughly and recommend compliance regardless of cost", "Seek legal advice about minimum compliance requirements", "Lobby with industry groups to change the regulations"], "answer_index": 1, "answer": "Research the regulations thoroughly and recommend compliance regardless of cost", "explanation": "Proactive compliance demonstrates ethical leadership and protects the organization from legal and reputational risks.", "difficulty": "hard", "tags": ["SJT", "ethics", "leadership"], "translations": {}}
{"id": "SJT-0084", "domain": "customer_service", "scenario": "A customer, Layla, has been arguing with multiple team members about a policy decision. She's now demanding to speak with someone 'more senior' and is becoming increasingly agitated.", "choices": ["Stand firm on the policy and refuse escalation", "Escalate to a supervisor while briefing them on the situation", "Offer a one-time exception to resolve the situation", "End the interaction and ask her to return when calmer"], "answer_index": 1, "answer": "Escalate to a supervisor while briefing them on the situation", "explanation": "Professional escalation with proper context allows senior staff to make informed decisions while de-escalating customer frustration.", "difficulty": "easy", "tags": ["SJT", "customer_service", "communication"], "translations": {}}
{"id": "SJT-0085", "domain": "communication", "scenario": "During a presentation to external partners, a colleague asks you a technical question that you don't know the answer to. Several important stakeholders are present.", "choices": ["Give your best guess to maintain credibility", "Admit you don't know and offer to follow up with accurate information", "Deflect the question to someone else on your team", "Say that the information is proprietary and can't be shared"], "answer_index": 1, "answer": "Admit you don't know and offer to follow up with accurate information", "explanation": "Honest acknowledgment of knowledge limits followed by commitment to accurate follow-up builds more credibility than guessing.", "difficulty": "medium", "tags": ["SJT", "communication", "ethics"], "translations": {}}
{"id": "SJT-0086", "domain": "conflict", "scenario": "Two departments are disagreeing about the priority of a shared resource. Each claims their project is more critical to the organization's success.", "choices": ["Allocate the resource to the department with the higher-ranking manager", "Review both projects' business impact and allocate based on objective criteria", "Split the resource equally between both departments", "Escalate the decision to senior leadership immediately"], "answer_index": 1, "answer": "Review both projects' business impact and allocate based on objective criteria", "explanation": "Objective evaluation based on business impact ensures resources are allocated for maximum organizational benefit.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0087", "domain": "inclusivity", "scenario": "During a company social event, you notice that employees who don't drink alcohol seem to be left out of conversations and networking opportunities that center around the bar area.", "choices": ["Suggest adding non-alcoholic social spaces and activities", "Encourage non-drinking employees to join bar conversations anyway", "Accept that some employees may be less included in social events", "Recommend eliminating alcohol from company events entirely"], "answer_index": 0, "answer": "Suggest adding non-alcoholic social spaces and activities", "explanation": "Creating diverse social opportunities ensures all employees can participate in networking and relationship-building regardless of personal choices.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "leadership"], "translations": {}}
{"id": "SJT-0088", "domain": "safety", "scenario": "During a fire drill, you notice that the designated fire warden for your floor is absent and no one seems to be taking charge of ensuring everyone evacuates properly.", "choices": ["Follow evacuation procedures and assume others will handle coordination", "Take initiative to help coordinate the evacuation for your area", "Look for the backup fire warden before taking any action", "Report the absence to building management after the drill"], "answer_index": 1, "answer": "Take initiative to help coordinate the evacuation for your area", "explanation": "Emergency situations require immediate leadership action to ensure everyone's safety, even without formal authority.", "difficulty": "easy", "tags": ["SJT", "safety", "leadership"], "translations": {}}
{"id": "SJT-0089", "domain": "teamwork", "scenario": "Your agile team has been consistently missing sprint goals. Some members blame unrealistic planning, while others point to execution issues during development.", "choices": ["Focus only on improving execution since planning is already done", "Examine both planning accuracy and execution effectiveness", "Reduce sprint commitments to ensure success", "Replace team members who can't meet commitments"], "answer_index": 1, "answer": "Examine both planning accuracy and execution effectiveness", "explanation": "Comprehensive analysis of all potential contributing factors leads to more effective solutions than focusing on single issues.", "difficulty": "medium", "tags": ["SJT", "teamwork", "problem_solving"], "translations": {}}
{"id": "SJT-0090", "domain": "leadership", "scenario": "Your department's budget has been approved for new equipment, but you learn that another department facing budget cuts could really benefit from some of those funds.", "choices": ["Use your budget as approved since it was allocated to your department", "Propose reallocating some funds to help the other department", "Offer to share equipment rather than transferring funds", "Suggest the other department appeal their budget allocation"], "answer_index": 1, "answer": "Propose reallocating some funds to help the other department", "explanation": "Collaborative resource sharing that considers broader organizational needs demonstrates strategic leadership beyond departmental boundaries.", "difficulty": "hard", "tags": ["SJT", "leadership", "ethics"], "translations": {}}
{"id": "SJT-0091", "domain": "ethics", "scenario": "You're offered a promotion that would require relocating to oversee operations in a region where your company has been accused of environmental violations. The promotion is career-advancing but ethically concerning.", "choices": ["Accept the promotion and work to improve environmental practices", "Decline the promotion due to ethical concerns", "Accept but request guarantees about environmental improvements", "Research the allegations thoroughly before deciding"], "answer_index": 3, "answer": "Research the allegations thoroughly before deciding", "explanation": "Informed decision-making based on facts rather than assumptions allows for ethical choices while avoiding premature judgments.", "difficulty": "hard", "tags": ["SJT", "ethics", "leadership"], "translations": {}}
{"id": "SJT-0092", "domain": "customer_service", "scenario": "A long-term client, Khalid, is consistently late with payments but always pays eventually. They're now requesting extended payment terms for a large project.", "choices": ["Grant the extension based on their payment history", "Deny the extension to protect cash flow", "Negotiate a compromise with partial upfront payment", "Require payment guarantees before proceeding"], "answer_index": 2, "answer": "Negotiate a compromise with partial upfront payment", "explanation": "Balanced solutions that acknowledge client history while protecting business interests often strengthen long-term relationships.", "difficulty": "medium", "tags": ["SJT", "customer_service", "leadership"], "translations": {}}
{"id": "SJT-0093", "domain": "communication", "scenario": "You're leading a meeting where one participant, Nour, dominates the conversation while others seem hesitant to contribute. Time is running short for covering all agenda items.", "choices": ["Let Nour continue since they're providing valuable input", "Politely redirect conversation to include other participants", "End Nour's comments and move to the next agenda item", "Schedule a follow-up meeting for additional discussion"], "answer_index": 1, "answer": "Politely redirect conversation to include other participants", "explanation": "Inclusive facilitation ensures all voices are heard while maintaining meeting effectiveness and respecting all participants.", "difficulty": "easy", "tags": ["SJT", "communication", "leadership"], "translations": {}}
{"id": "SJT-0094", "domain": "conflict", "scenario": "The marketing and product teams disagree about feature priorities for the next release. Marketing wants customer-requested features, while product wants technical improvements.", "choices": ["Let the senior-most person decide", "Analyze the business impact of each option", "Implement both sets of features to satisfy everyone", "Postpone the decision until next planning cycle"], "answer_index": 1, "answer": "Analyze the business impact of each option", "explanation": "Data-driven analysis of business impact provides objective criteria for resolving conflicting priorities effectively.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0095", "domain": "inclusivity", "scenario": "A team meeting is scheduled during a religious holiday observed by some but not all team members. The agenda includes important decisions that require everyone's input.", "choices": ["Proceed with the meeting since it affects only some team members", "Reschedule the meeting to accommodate everyone", "Hold the meeting but brief absent members afterward", "Use a hybrid approach allowing virtual participation"], "answer_index": 1, "answer": "Reschedule the meeting to accommodate everyone", "explanation": "Rescheduling important decision-making meetings demonstrates respect for religious diversity and ensures full team participation.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "leadership"], "translations": {}}
{"id": "SJT-0096", "domain": "safety", "scenario": "A vendor working at your facility repeatedly ignores safety protocols despite reminders. Their work quality is good, but their behavior poses risks to others.", "choices": ["Continue reminding them about safety protocols", "Report the vendor to their company management", "Require a safety monitor to supervise their work", "Terminate the vendor relationship for safety violations"], "answer_index": 1, "answer": "Report the vendor to their company management", "explanation": "Escalating persistent safety violations to vendor management ensures appropriate authority can address the behavior effectively.", "difficulty": "medium", "tags": ["SJT", "safety", "leadership"], "translations": {}}
{"id": "SJT-0097", "domain": "teamwork", "scenario": "Your team has been working remotely successfully, but some members are now requesting to return to office work while others want to remain remote. This is creating coordination challenges.", "choices": ["Require everyone to work in the same mode for consistency", "Develop hybrid coordination practices that accommodate both preferences", "Let each person choose but accept reduced coordination", "Survey the team and implement the majority preference"], "answer_index": 1, "answer": "Develop hybrid coordination practices that accommodate both preferences", "explanation": "Adaptive coordination systems that accommodate different work preferences can maintain team effectiveness while respecting individual needs.", "difficulty": "hard", "tags": ["SJT", "teamwork", "leadership"], "translations": {}}
{"id": "SJT-0098", "domain": "leadership", "scenario": "Your team successfully completed a high-visibility project, but you know that one team member, Amal, contributed significantly more than others. Recognition decisions will affect team morale.", "choices": ["Give equal recognition to maintain team harmony", "Recognize contributions proportionally based on actual work", "Recognize the team collectively without individual highlights", "Let team members nominate each other for recognition"], "answer_index": 1, "answer": "Recognize contributions proportionally based on actual work", "explanation": "Fair recognition based on actual contribution maintains motivation for high performers while setting clear expectations for team standards.", "difficulty": "hard", "tags": ["SJT", "leadership", "ethics"], "translations": {}}
{"id": "SJT-0099", "domain": "ethics", "scenario": "You're asked to provide data for a report that you know will be used to make decisions about potential layoffs. The data could be presented in ways that either support or discourage workforce reductions.", "choices": ["Present data objectively without considering potential uses", "Present data in a way that protects employee jobs", "Decline to provide the data to avoid being involved", "Add context about potential impacts of different interpretations"], "answer_index": 0, "answer": "Present data objectively without considering potential uses", "explanation": "Professional integrity requires objective data presentation regardless of personal preferences about how it might be used.", "difficulty": "hard", "tags": ["SJT", "ethics", "leadership"], "translations": {}}
{"id": "SJT-0100", "domain": "customer_service", "scenario": "A customer, Fatima, is requesting a service modification that would require your team to work overtime during a holiday weekend. She's offering to pay premium rates but the request came very late.", "choices": ["Accept the premium work to maximize revenue", "Decline due to the holiday timing and short notice", "Check with team members about their willingness to work before committing", "Offer the service but with an additional rush charge"], "answer_index": 2, "answer": "Check with team members about their willingness to work before committing", "explanation": "Consulting with team members about holiday work respects their personal time while allowing for informed business decisions.", "difficulty": "medium", "tags": ["SJT", "customer_service", "leadership"], "translations": {}}
{"id": "SJT-0101", "domain": "communication", "scenario": "During a quarterly review presentation, your supervisor interrupts to correct information you're presenting in front of senior leadership. You believe your information is accurate.", "choices": ["Defend your position immediately to maintain credibility", "Acknowledge their input and offer to verify the information afterward", "Concede to avoid conflict even though you believe you're right", "Ask them to clarify their concerns privately after the meeting"], "answer_index": 1, "answer": "Acknowledge their input and offer to verify the information afterward", "explanation": "Professional acknowledgment while maintaining commitment to accuracy demonstrates respect for hierarchy and dedication to truth.", "difficulty": "medium", "tags": ["SJT", "communication", "professionalism"], "translations": {}}
{"id": "SJT-0102", "domain": "conflict", "scenario": "Two experienced team members, Rachid and Aicha, have fundamentally different approaches to problem-solving that often lead to lengthy debates during project planning sessions.", "choices": ["Assign them to separate projects to avoid conflicts", "Facilitate structured discussions that leverage both perspectives", "Let them debate and choose the best solution afterward", "Implement a rotation system where each leads alternate projects"], "answer_index": 1, "answer": "Facilitate structured discussions that leverage both perspectives", "explanation": "Channeling different perspectives through structured dialogue can produce superior solutions while managing interpersonal dynamics.", "difficulty": "medium", "tags": ["SJT", "conflict", "teamwork"], "translations": {}}
{"id": "SJT-0103", "domain": "inclusivity", "scenario": "Your company's dress code policy requires 'professional business attire' but some employees' cultural or religious clothing doesn't fit traditional Western business standards, causing confusion.", "choices": ["Enforce the policy strictly to maintain professionalism", "Propose updating the policy to be more culturally inclusive", "Handle exceptions case-by-case to avoid policy changes", "Eliminate the dress code entirely"], "answer_index": 1, "answer": "Propose updating the policy to be more culturally inclusive", "explanation": "Systematic policy updates that embrace cultural diversity create clear guidelines while promoting genuine inclusion.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "leadership"], "translations": {}}
{"id": "SJT-0104", "domain": "safety", "scenario": "You notice that ergonomic workstation setups vary significantly across your office, with some employees using improvised solutions that could cause injury over time.", "choices": ["Let employees manage their own workspace setup", "Propose a ergonomic assessment program for all workstations", "Address only obvious safety hazards as they're reported", "Require all employees to use identical standard setups"], "answer_index": 1, "answer": "Propose a ergonomic assessment program for all workstations", "explanation": "Proactive ergonomic assessment prevents workplace injuries and demonstrates care for employee long-term health and productivity.", "difficulty": "easy", "tags": ["SJT", "safety", "leadership"], "translations": {}}
{"id": "SJT-0105", "domain": "teamwork", "scenario": "Your distributed team includes members in time zones spanning 12 hours. Scheduling meetings that work for everyone has become nearly impossible.", "choices": ["Rotate meeting times systematically to share the burden", "Schedule meetings for the majority and brief others afterward", "Use only asynchronous communication to avoid scheduling conflicts", "Split into regional sub-teams with periodic cross-team meetings"], "answer_index": 0, "answer": "Rotate meeting times systematically to share the burden", "explanation": "Systematic rotation ensures fair distribution of inconvenience while maintaining team cohesion and participation.", "difficulty": "medium", "tags": ["SJT", "teamwork", "inclusivity"], "translations": {}}
{"id": "SJT-0106", "domain": "leadership", "scenario": "Your department is being asked to take on additional responsibilities due to budget cuts, but your team is already at capacity. Senior management expects you to 'make it work.'", "choices": ["Accept the additional work and figure out how to manage it later", "Present a clear analysis of capacity constraints and recommend solutions", "Delegate the new responsibilities to your team without additional resources", "Refuse the additional work to protect your team"], "answer_index": 1, "answer": "Present a clear analysis of capacity constraints and recommend solutions", "explanation": "Professional leadership requires honest assessment of constraints coupled with constructive solutions rather than just accepting impossible demands.", "difficulty": "hard", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0107", "domain": "ethics", "scenario": "You discover that your company's marketing materials contain claims about product capabilities that are technically true but misleading to typical customers.", "choices": ["Continue using the materials since they're technically accurate", "Propose revising the materials to be clearer and more transparent", "Stop using the materials immediately", "Add disclaimers to clarify the technical limitations"], "answer_index": 1, "answer": "Propose revising the materials to be clearer and more transparent", "explanation": "Ethical marketing requires not just technical accuracy but genuine transparency that helps customers make informed decisions.", "difficulty": "medium", "tags": ["SJT", "ethics", "communication"], "translations": {}}
{"id": "SJT-0108", "domain": "customer_service", "scenario": "A client, Hassan, is requesting access to detailed data about their account that would require significant manual effort to compile. They're threatening to cancel their contract if denied.", "choices": ["Provide the data to avoid losing the client", "Explain the effort required and offer a summary instead", "Refuse the request since it's not contractually required", "Charge a fee for the manual data compilation"], "answer_index": 1, "answer": "Explain the effort required and offer a summary instead", "explanation": "Transparent communication about constraints while offering alternatives often satisfies client needs more effectively than simple yes/no responses.", "difficulty": "medium", "tags": ["SJT", "customer_service", "communication"], "translations": {}}
{"id": "SJT-0109", "domain": "communication", "scenario": "You're presenting project results when a stakeholder asks for data that would reveal poor performance by a specific team member. Others in the meeting could identify the individual.", "choices": ["Provide the specific data since transparency is important", "Present aggregated data that doesn't identify individuals", "Defer the question and provide data privately later", "Explain that individual performance data isn't appropriate for this forum"], "answer_index": 3, "answer": "Explain that individual performance data isn't appropriate for this forum", "explanation": "Protecting individual privacy while maintaining appropriate transparency demonstrates professional discretion and respect for personnel matters.", "difficulty": "medium", "tags": ["SJT", "communication", "ethics"], "translations": {}}
{"id": "SJT-0110", "domain": "conflict", "scenario": "Your organization is implementing a new software system. The IT department wants to roll it out gradually for stability, while operations wants immediate full deployment to stop supporting two systems.", "choices": ["Support IT's cautious approach for technical reasons", "Support operations' efficiency concerns", "Facilitate a compromise that addresses both departments' core concerns", "Let senior management decide between the approaches"], "answer_index": 2, "answer": "Facilitate a compromise that addresses both departments' core concerns", "explanation": "Understanding and addressing the underlying concerns of both parties often reveals solutions that satisfy everyone's core needs.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0111", "domain": "inclusivity", "scenario": "During a job interview process, one candidate mentions accommodations they would need for a disability. Some team members express concerns about potential impacts on team productivity.", "choices": ["Address team concerns by explaining reasonable accommodation requirements", "Exclude the candidate to avoid team friction", "Hire the candidate without discussing accommodations with the team", "Postpone the decision until you can assess the accommodation costs"], "answer_index": 0, "answer": "Address team concerns by explaining reasonable accommodation requirements", "explanation": "Education about accommodation requirements helps teams understand legal obligations while promoting inclusive attitudes.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "leadership"], "translations": {}}
{"id": "SJT-0112", "domain": "safety", "scenario": "A popular shortcut route through the building bypasses security checkpoints. Many employees use it to save time, and restricting it would cause significant inconvenience.", "choices": ["Allow the practice since it's widely accepted", "Block the route immediately for security compliance", "Install additional security measures at the shortcut location", "Educate employees about security risks while keeping the route open"], "answer_index": 2, "answer": "Install additional security measures at the shortcut location", "explanation": "Balancing security requirements with employee convenience through improved infrastructure demonstrates practical problem-solving.", "difficulty": "medium", "tags": ["SJT", "safety", "leadership"], "translations": {}}
{"id": "SJT-0113", "domain": "teamwork", "scenario": "Your team has been assigned to work with a partner organization whose work culture and communication style are very different from yours, causing friction and misunderstandings.", "choices": ["Maintain your team's approach and expect them to adapt", "Adapt completely to their style to avoid conflicts", "Develop hybrid approaches that accommodate both cultures", "Request a different partner organization"], "answer_index": 2, "answer": "Develop hybrid approaches that accommodate both cultures", "explanation": "Cultural bridge-building through hybrid approaches leverages the strengths of both styles while minimizing conflict.", "difficulty": "hard", "tags": ["SJT", "teamwork", "inclusivity"], "translations": {}}
{"id": "SJT-0114", "domain": "leadership", "scenario": "One of your high-performing team members, Youssef, is showing signs of burnout from taking on too much responsibility. He insists he can handle everything and resists delegation.", "choices": ["Respect his assessment and let him continue", "Force him to delegate tasks to protect his wellbeing", "Gradually reassign some responsibilities without his input", "Have a direct conversation about workload and sustainability"], "answer_index": 3, "answer": "Have a direct conversation about workload and sustainability", "explanation": "Direct dialogue about burnout risks shows care for employee wellbeing while addressing performance sustainability concerns.", "difficulty": "medium", "tags": ["SJT", "leadership", "communication"], "translations": {}}
{"id": "SJT-0115", "domain": "ethics", "scenario": "You're asked to implement a cost-cutting measure that would technically comply with regulations but significantly reduce service quality for customers.", "choices": ["Implement the cuts since they comply with regulations", "Refuse to implement cuts that harm customer service", "Propose alternative cost-cutting measures that preserve service quality", "Implement the cuts but communicate transparently with customers"], "answer_index": 2, "answer": "Propose alternative cost-cutting measures that preserve service quality", "explanation": "Creative problem-solving that addresses financial pressures while maintaining service standards demonstrates strategic thinking and customer focus.", "difficulty": "hard", "tags": ["SJT", "ethics", "leadership"], "translations": {}}
{"id": "SJT-0116", "domain": "customer_service", "scenario": "A client, Amira, has been consistently difficult to work with, making unreasonable demands and treating staff poorly. However, they represent significant revenue for your company.", "choices": ["Continue tolerating the behavior for the revenue", "Set clear boundaries about acceptable behavior", "Gradually reduce service levels to encourage them to leave", "End the relationship immediately despite the revenue loss"], "answer_index": 1, "answer": "Set clear boundaries about acceptable behavior", "explanation": "Professional boundaries protect staff welfare while giving clients opportunity to maintain relationships through appropriate behavior.", "difficulty": "hard", "tags": ["SJT", "customer_service", "leadership"], "translations": {}}
{"id": "SJT-0117", "domain": "communication", "scenario": "During a team retrospective, several sensitive issues about management decisions are raised. Some team members want to document these concerns formally, while others prefer informal discussion.", "choices": ["Document everything for transparency", "Keep discussions informal to avoid potential backlash", "Document issues that affect work quality but keep interpersonal matters informal", "Ask the team to vote on what should be documented"], "answer_index": 2, "answer": "Document issues that affect work quality but keep interpersonal matters informal", "explanation": "Balanced documentation that focuses on work impact while protecting relationships enables productive follow-up without creating unnecessary conflict.", "difficulty": "medium", "tags": ["SJT", "communication", "teamwork"], "translations": {}}
{"id": "SJT-0118", "domain": "conflict", "scenario": "The finance and marketing departments disagree about budget allocation for a major campaign. Finance wants to reduce costs, while marketing argues that cuts will eliminate effectiveness.", "choices": ["Side with finance to control costs", "Support marketing's effectiveness argument", "Require both departments to present data supporting their positions", "Compromise by splitting the difference"], "answer_index": 2, "answer": "Require both departments to present data supporting their positions", "explanation": "Data-driven decision making provides objective criteria for resolving resource allocation conflicts effectively.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0119", "domain": "inclusivity", "scenario": "Your team's informal lunch discussions often focus on topics that exclude team members who don't share the same interests or cultural references.", "choices": ["Let conversations flow naturally without intervention", "Suggest more inclusive conversation topics during team lunches", "Organize structured lunch activities instead of free conversation", "Encourage separate interest groups to form"], "answer_index": 1, "answer": "Suggest more inclusive conversation topics during team lunches", "explanation": "Gentle guidance toward inclusive topics helps build team relationships while ensuring all members can participate in social bonding.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "teamwork"], "translations": {}}
{"id": "SJT-0120", "domain": "safety", "scenario": "A new employee, Salma, is not following established safety procedures despite training. Her supervisor seems unaware of the issue.", "choices": ["Document the violations and report to HR", "Speak with Salma directly about following safety procedures", "Inform her supervisor about the safety concerns", "Report the issue to the safety committee"], "answer_index": 1, "answer": "Speak with Salma directly about following safety procedures", "explanation": "Direct peer coaching about safety shows immediate concern for everyone's wellbeing while giving the individual chance to correct behavior.", "difficulty": "easy", "tags": ["SJT", "safety", "communication"], "translations": {}}
{"id": "SJT-0121", "domain": "teamwork", "scenario": "Your team is transitioning to a new project management methodology. Some members are enthusiastic while others are resistant to change and slowing down adoption.", "choices": ["Force everyone to adopt the new methodology immediately", "Address concerns and provide additional support for resistant members", "Allow teams to continue with their preferred methods", "Implement the change gradually with pilot groups"], "answer_index": 1, "answer": "Address concerns and provide additional support for resistant members", "explanation": "Understanding and addressing resistance while providing support leads to more successful organizational change.", "difficulty": "medium", "tags": ["SJT", "teamwork", "leadership"], "translations": {}}
{"id": "SJT-0122", "domain": "leadership", "scenario": "During budget planning, two department heads are competing for limited resources. Both have compelling arguments for their needs.", "choices": ["Allocate resources based on seniority", "Split resources equally between departments", "Evaluate proposals based on strategic business impact", "Let senior management make the decision"], "answer_index": 2, "answer": "Evaluate proposals based on strategic business impact", "explanation": "Objective evaluation based on business strategy ensures resources are allocated for maximum organizational benefit.", "difficulty": "hard", "tags": ["SJT", "leadership", "decision_making"], "translations": {}}
{"id": "SJT-0123", "domain": "ethics", "scenario": "You're asked to provide a positive reference for a former colleague who was adequate but not exceptional. They desperately need the job and have asked you to emphasize only positives.", "choices": ["Give an entirely positive reference to help them", "Provide an honest, balanced assessment", "Decline to provide a reference", "Focus only on personal qualities, not work performance"], "answer_index": 1, "answer": "Provide an honest, balanced assessment", "explanation": "Professional integrity requires honest references that serve both the candidate and potential employer fairly.", "difficulty": "medium", "tags": ["SJT", "ethics", "communication"], "translations": {}}
{"id": "SJT-0124", "domain": "customer_service", "scenario": "A client, Omar, is asking for services that are outside your company's capabilities. He's offering to pay significantly above market rates.", "choices": ["Accept the project and figure out how to deliver later", "Decline the project and explain your limitations", "Refer him to a competitor who can handle the work", "Negotiate a modified scope that fits your capabilities"], "answer_index": 3, "answer": "Negotiate a modified scope that fits your capabilities", "explanation": "Offering alternative solutions within your capabilities can meet client needs while maintaining service quality and business integrity.", "difficulty": "medium", "tags": ["SJT", "customer_service", "problem_solving"], "translations": {}}
{"id": "SJT-0125", "domain": "communication", "scenario": "During a presentation, you notice that several audience members are looking confused by technical terminology you're using. Time is limited to cover all material.", "choices": ["Continue with the planned presentation to cover everything", "Pause to explain terminology and adjust remaining content", "Ask if anyone has questions but continue with current pace", "Speed up to fit in explanations and all content"], "answer_index": 1, "answer": "Pause to explain terminology and adjust remaining content", "explanation": "Ensuring audience understanding is more valuable than covering all planned material when comprehension is compromised.", "difficulty": "easy", "tags": ["SJT", "communication", "adaptability"], "translations": {}}
{"id": "SJT-0126", "domain": "conflict", "scenario": "Your organization is merging with another company. Employees from both sides are showing resistance and territorial behavior.", "choices": ["Let the teams work out their differences naturally", "Organize joint activities to build relationships", "Keep teams separate to avoid conflicts", "Focus only on work integration, not cultural issues"], "answer_index": 1, "answer": "Organize joint activities to build relationships", "explanation": "Proactive relationship building during mergers helps overcome territorial behavior and creates collaborative foundations.", "difficulty": "medium", "tags": ["SJT", "conflict", "leadership"], "translations": {}}
{"id": "SJT-0127", "domain": "inclusivity", "scenario": "Your team's brainstorming sessions are dominated by the most outspoken members, while quieter colleagues rarely contribute ideas.", "choices": ["Accept that some people are naturally more vocal", "Implement structured techniques to ensure everyone contributes", "Ask quiet members to speak up more", "Create separate sessions for different personality types"], "answer_index": 1, "answer": "Implement structured techniques to ensure everyone contributes", "explanation": "Structured facilitation techniques can create equal opportunities for contribution regardless of personality type.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "teamwork"], "translations": {}}
{"id": "SJT-0128", "domain": "safety", "scenario": "You discover that cost-cutting measures have reduced safety training frequency. Employees are starting to take shortcuts because they're unsure of proper procedures.", "choices": ["Document the issue and wait for incident reports", "Propose restoring adequate safety training in the budget", "Create informal peer training to supplement reduced formal training", "Report the safety training cuts to regulatory authorities"], "answer_index": 1, "answer": "Propose restoring adequate safety training in the budget", "explanation": "Advocating for proper safety training addresses the root cause and prevents accidents more effectively than reactive measures.", "difficulty": "medium", "tags": ["SJT", "safety", "leadership"], "translations": {}}
{"id": "SJT-0129", "domain": "teamwork", "scenario": "Your global team includes members who work during different holidays and observances. Scheduling and project timing conflicts arise regularly.", "choices": ["Use a standardized calendar based on the company's main location", "Create a shared calendar that includes all team members' observances", "Let each region handle its own scheduling", "Rotate project deadlines to distribute holiday impacts"], "answer_index": 1, "answer": "Create a shared calendar that includes all team members' observances", "explanation": "Inclusive scheduling that acknowledges all team members' observances promotes respect and enables better project planning.", "difficulty": "easy", "tags": ["SJT", "teamwork", "inclusivity"], "translations": {}}
{"id": "SJT-0130", "domain": "leadership", "scenario": "A talented employee, Zineb, has been offered a position with more responsibility at another company. She values the work here but wants career growth.", "choices": ["Let her go since she's already decided", "Offer a counter-offer matching the other company's proposal", "Explore internal opportunities for advancement", "Ask her to train a replacement before leaving"], "answer_index": 2, "answer": "Explore internal opportunities for advancement", "explanation": "Investigating internal growth opportunities addresses the core motivation for leaving and may benefit both the employee and organization.", "difficulty": "medium", "tags": ["SJT", "leadership", "retention"], "translations": {}}
{"id": "SJT-0131", "domain": "ethics", "scenario": "Your company wins a contract partially because a competitor's proposal was leaked to you by an insider. Using this information gives you an unfair advantage.", "choices": ["Use the information since it was freely provided", "Report the leak to the appropriate authorities", "Ignore the leaked information and proceed normally", "Withdraw from the bidding process"], "answer_index": 1, "answer": "Report the leak to the appropriate authorities", "explanation": "Reporting unethical information sharing maintains competitive integrity and protects your organization from legal liability.", "difficulty": "hard", "tags": ["SJT", "ethics", "integrity"], "translations": {}}
{"id": "SJT-0132", "domain": "customer_service", "scenario": "A long-term client, Hamza, has been consistently late with payments but always pays eventually. They're now requesting credit terms that exceed your normal policy.", "choices": ["Approve the extended terms based on payment history", "Apply standard credit policies regardless of history", "Negotiate a compromise with partial upfront payment", "Require additional guarantees for extended terms"], "answer_index": 2, "answer": "Negotiate a compromise with partial upfront payment", "explanation": "Balanced solutions that acknowledge relationship history while managing business risk often strengthen long-term partnerships.", "difficulty": "medium", "tags": ["SJT", "customer_service", "risk_management"], "translations": {}}
{"id": "SJT-0133", "domain": "communication", "scenario": "You need to deliver news about organizational changes that will affect many employees. Some of the changes are still being finalized.", "choices": ["Wait until all details are finalized before communicating", "Share what you know and commit to updates as details are confirmed", "Share general information without specifics", "Let senior management handle all communication"], "answer_index": 1, "answer": "Share what you know and commit to updates as details are confirmed", "explanation": "Transparent communication with commitment to updates builds trust during uncertain times while acknowledging the ongoing nature of change.", "difficulty": "medium", "tags": ["SJT", "communication", "change_management"], "translations": {}}
{"id": "SJT-0134", "domain": "conflict", "scenario": "Your team is working with an external vendor whose project management style conflicts with your internal processes, causing friction and delays.", "choices": ["Insist the vendor adapt to your processes", "Adapt your processes to match the vendor's style", "Develop hybrid processes that accommodate both approaches", "Replace the vendor with one that matches your style"], "answer_index": 2, "answer": "Develop hybrid processes that accommodate both approaches", "explanation": "Collaborative process development that accommodates both styles can leverage strengths while minimizing friction.", "difficulty": "hard", "tags": ["SJT", "conflict", "collaboration"], "translations": {}}
{"id": "SJT-0135", "domain": "inclusivity", "scenario": "Your company's employee resource groups are well-developed for some demographics but lacking for others. This creates unequal access to networking and development opportunities.", "choices": ["Focus resources on the most successful existing groups", "Support development of resource groups for underrepresented demographics", "Eliminate all resource groups to ensure equality", "Let groups form organically without organizational support"], "answer_index": 1, "answer": "Support development of resource groups for underrepresented demographics", "explanation": "Proactive support for underrepresented groups helps create equitable access to networking and development opportunities.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "leadership"], "translations": {}}
{"id": "SJT-0136", "domain": "safety", "scenario": "Budget constraints have delayed replacement of aging safety equipment. The equipment still functions but doesn't meet the latest safety standards.", "choices": ["Continue using equipment until it fails", "Prioritize replacement of the most critical safety equipment", "Request emergency budget allocation for all replacements", "Document the risk and wait for budget approval"], "answer_index": 1, "answer": "Prioritize replacement of the most critical safety equipment", "explanation": "Risk-based prioritization ensures the most important safety improvements are made within budget constraints.", "difficulty": "medium", "tags": ["SJT", "safety", "resource_management"], "translations": {}}
{"id": "SJT-0137", "domain": "teamwork", "scenario": "Your team has been assigned to work on a project with aggressive deadlines. Team members are concerned about work-life balance and potential burnout.", "choices": ["Push through the deadline period and address balance later", "Negotiate more realistic deadlines with stakeholders", "Hire temporary help to distribute the workload", "Rotate team members to prevent individual burnout"], "answer_index": 1, "answer": "Negotiate more realistic deadlines with stakeholders", "explanation": "Addressing unrealistic expectations proactively protects team wellbeing while setting sustainable precedents for future projects.", "difficulty": "hard", "tags": ["SJT", "teamwork", "leadership"], "translations": {}}
{"id": "SJT-0138", "domain": "leadership", "scenario": "You're promoted to manage a team that includes former peers who were also candidates for your position. Some seem resentful of your promotion.", "choices": ["Assert authority immediately to establish leadership", "Address the situation openly with the team", "Ignore the resentment and focus on work", "Give resentful team members preferential treatment"], "answer_index": 1, "answer": "Address the situation openly with the team", "explanation": "Open dialogue about transition dynamics helps address concerns while establishing collaborative leadership foundations.", "difficulty": "hard", "tags": ["SJT", "leadership", "transition"], "translations": {}}
{"id": "SJT-0139", "domain": "ethics", "scenario": "You discover that a supplier has been overcharging your company for services through billing errors that always favor them. The amount is significant over time.", "choices": ["Quietly negotiate better rates going forward", "Demand refunds for all overcharges", "Switch to a different supplier immediately", "Report the supplier for fraudulent billing practices"], "answer_index": 1, "answer": "Demand refunds for all overcharges", "explanation": "Addressing systematic overcharging directly protects organizational resources while maintaining business relationship integrity.", "difficulty": "medium", "tags": ["SJT", "ethics", "financial_integrity"], "translations": {}}
{"id": "SJT-0140", "domain": "customer_service", "scenario": "A customer, Nadia, is requesting a full refund for services delivered months ago, claiming dissatisfaction that was never previously communicated.", "choices": ["Deny the refund since the work was completed satisfactorily", "Grant the refund to maintain customer relationship", "Investigate the original service delivery and customer experience", "Offer a partial refund as a compromise"], "answer_index": 2, "answer": "Investigate the original service delivery and customer experience", "explanation": "Understanding the complete situation helps determine appropriate resolution while demonstrating commitment to service quality.", "difficulty": "medium", "tags": ["SJT", "customer_service", "problem_solving"], "translations": {}}
{"id": "SJT-0141", "domain": "communication", "scenario": "You're mediating a discussion between departments with conflicting priorities. Both sides are presenting valid points but emotions are escalating.", "choices": ["Take a break and resume when emotions cool down", "Make a decision quickly to end the conflict", "Focus on finding common ground between the positions", "Let each side present their case without interruption"], "answer_index": 2, "answer": "Focus on finding common ground between the positions", "explanation": "Identifying shared interests and common ground can de-escalate tensions while building collaborative solutions.", "difficulty": "medium", "tags": ["SJT", "communication", "conflict"], "translations": {}}
{"id": "SJT-0142", "domain": "conflict", "scenario": "Your organization is undergoing layoffs. Remaining employees are stressed and productivity is declining due to fear and uncertainty.", "choices": ["Focus on maintaining normal operations", "Provide regular updates and support resources", "Avoid discussing the layoffs to prevent further anxiety", "Implement additional performance monitoring"], "answer_index": 1, "answer": "Provide regular updates and support resources", "explanation": "Transparent communication and support during organizational stress helps maintain morale and productivity among remaining employees.", "difficulty": "easy", "tags": ["SJT", "conflict", "communication"], "translations": {}}
{"id": "SJT-0143", "domain": "inclusivity", "scenario": "Your team's social events consistently exclude employees who don't drink alcohol, creating barriers to relationship building and networking.", "choices": ["Continue current events since most people enjoy them", "Alternate between alcohol-focused and alcohol-free events", "Make all team events alcohol-free", "Add alcohol-free options to existing events"], "answer_index": 1, "answer": "Alternate between alcohol-focused and alcohol-free events", "explanation": "Balanced event planning ensures all team members have equal opportunities for relationship building and networking.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "teamwork"], "translations": {}}
{"id": "SJT-0144", "domain": "safety", "scenario": "A safety incident has occurred due to inadequate lighting in a work area. A quick fix is available, but a permanent solution requires significant investment.", "choices": ["Implement only the quick fix to save costs", "Close the area until permanent improvements are made", "Implement the quick fix while planning permanent improvements", "Wait for budget approval for permanent improvements"], "answer_index": 2, "answer": "Implement the quick fix while planning permanent improvements", "explanation": "Immediate safety improvements combined with long-term planning demonstrates both urgency and commitment to comprehensive safety.", "difficulty": "easy", "tags": ["SJT", "safety", "problem_solving"], "translations": {}}
{"id": "SJT-0145", "domain": "teamwork", "scenario": "Your cross-functional team includes members with vastly different work styles and communication preferences, making collaboration challenging.", "choices": ["Let team members adapt to each other naturally", "Establish team norms that accommodate different work styles", "Assign tasks to minimize cross-functional interaction", "Focus only on results, not process differences"], "answer_index": 1, "answer": "Establish team norms that accommodate different work styles", "explanation": "Proactive norm-setting that acknowledges diverse work styles creates a framework for effective collaboration.", "difficulty": "medium", "tags": ["SJT", "teamwork", "communication"], "translations": {}}
{"id": "SJT-0146", "domain": "leadership", "scenario": "Your department needs to reduce costs by 15%. You can achieve this through layoffs, pay cuts, or eliminating certain programs.", "choices": ["Implement across-the-board pay cuts", "Eliminate programs with lowest ROI", "Reduce workforce through strategic layoffs", "Combine multiple approaches to minimize individual impact"], "answer_index": 3, "answer": "Combine multiple approaches to minimize individual impact", "explanation": "Balanced cost reduction strategies can achieve financial goals while minimizing severe impacts on any single group.", "difficulty": "hard", "tags": ["SJT", "leadership", "financial_management"], "translations": {}}
{"id": "SJT-0147", "domain": "ethics", "scenario": "You're asked to implement tracking software that monitors employee productivity but also captures personal information. Employees aren't aware of the full extent of monitoring.", "choices": ["Implement the software as requested", "Refuse to implement monitoring software", "Implement with full disclosure to employees", "Implement only productivity tracking, not personal information capture"], "answer_index": 2, "answer": "Implement with full disclosure to employees", "explanation": "Transparency about monitoring practices respects employee privacy rights while allowing informed consent for productivity initiatives.", "difficulty": "medium", "tags": ["SJT", "ethics", "privacy"], "translations": {}}
{"id": "SJT-0148", "domain": "customer_service", "scenario": "A major client, Driss, is threatening to end their contract due to a service disruption. They want immediate compensation and service credits.", "choices": ["Offer the requested compensation to save the relationship", "Investigate the disruption before offering compensation", "Deny compensation since disruptions happen", "Negotiate alternative forms of value beyond monetary compensation"], "answer_index": 1, "answer": "Investigate the disruption before offering compensation", "explanation": "Understanding the situation fully enables appropriate response while demonstrating commitment to service quality and fair resolution.", "difficulty": "medium", "tags": ["SJT", "customer_service", "problem_solving"], "translations": {}}
{"id": "SJT-0149", "domain": "communication", "scenario": "You need to present quarterly results that are below expectations to senior leadership. The data shows several concerning trends.", "choices": ["Focus on positive aspects and minimize concerning trends", "Present all data objectively with context and analysis", "Delay the presentation until you have more positive results", "Present only the most critical issues to save time"], "answer_index": 1, "answer": "Present all data objectively with context and analysis", "explanation": "Complete, objective reporting enables informed decision-making and builds credibility through transparency.", "difficulty": "easy", "tags": ["SJT", "communication", "leadership"], "translations": {}}
{"id": "SJT-0150", "domain": "conflict", "scenario": "Two high-performing employees, Khadija and Youssef, have personal conflicts that are starting to affect team dynamics and project delivery.", "choices": ["Ignore the conflict since they're both high performers", "Mediate a discussion between them", "Separate them onto different projects", "Address the impact on team performance"], "answer_index": 3, "answer": "Address the impact on team performance", "explanation": "Focusing on business impact while acknowledging personal dynamics helps resolve conflicts professionally.", "difficulty": "medium", "tags": ["SJT", "conflict", "teamwork"], "translations": {}}
{"id": "SJT-0151", "domain": "inclusivity", "scenario": "Your company's job descriptions use language that research shows may discourage certain demographics from applying. HR says changing them would be too much work.", "choices": ["Accept HR's decision and maintain current descriptions", "Research and propose specific language improvements", "Advocate for a company-wide review of job descriptions", "Focus on other diversity initiatives instead"], "answer_index": 2, "answer": "Advocate for a company-wide review of job descriptions", "explanation": "Systematic improvement of inclusive language in job descriptions can significantly improve diversity in candidate pools.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "hiring"], "translations": {}}
{"id": "SJT-0152", "domain": "safety", "scenario": "Employees are required to work in extreme weather conditions. Safety equipment is provided, but some workers are still expressing concerns about health risks.", "choices": ["Maintain current safety protocols since equipment is provided", "Review and enhance safety protocols for extreme weather", "Allow voluntary work during extreme weather only", "Temporarily halt operations during extreme weather"], "answer_index": 1, "answer": "Review and enhance safety protocols for extreme weather", "explanation": "Continuously improving safety protocols based on employee feedback demonstrates commitment to worker wellbeing beyond minimum standards.", "difficulty": "medium", "tags": ["SJT", "safety", "employee_welfare"], "translations": {}}
{"id": "SJT-0153", "domain": "teamwork", "scenario": "Your team has been assigned an intern, Imane, who is enthusiastic but makes frequent mistakes that require significant time to correct.", "choices": ["Assign simple tasks to minimize mistakes", "Provide intensive training and mentoring", "Document performance issues for evaluation", "Limit the intern's responsibilities to observation only"], "answer_index": 1, "answer": "Provide intensive training and mentoring", "explanation": "Investment in proper training and mentoring can develop intern capabilities while building long-term talent for the organization.", "difficulty": "easy", "tags": ["SJT", "teamwork", "mentoring"], "translations": {}}
{"id": "SJT-0154", "domain": "leadership", "scenario": "Your organization is implementing new technology that will make some job roles obsolete. Affected employees are anxious about their future.", "choices": ["Wait until implementation to address job changes", "Communicate early and provide retraining opportunities", "Focus only on employees in roles that will remain", "Implement changes gradually to delay job impacts"], "answer_index": 1, "answer": "Communicate early and provide retraining opportunities", "explanation": "Proactive communication and retraining demonstrates leadership commitment to employee development during technological transitions.", "difficulty": "easy", "tags": ["SJT", "leadership", "change_management"], "translations": {}}
{"id": "SJT-0155", "domain": "ethics", "scenario": "Your company has an opportunity to win a government contract, but the procurement process seems to favor companies with political connections rather than merit.", "choices": ["Participate normally and rely on proposal quality", "Investigate the procurement process before bidding", "Withdraw from the bidding process", "Focus efforts on private sector opportunities instead"], "answer_index": 1, "answer": "Investigate the procurement process before bidding", "explanation": "Due diligence on procurement fairness protects organizational integrity while ensuring compliance with ethical business practices.", "difficulty": "hard", "tags": ["SJT", "ethics", "government_relations"], "translations": {}}
{"id": "SJT-0156", "domain": "customer_service", "scenario": "A client, Laila, is requesting services that conflict with your company's values and sustainability commitments, but the project would be very profitable.", "choices": ["Accept the project since profit is the priority", "Decline the project due to values conflict", "Negotiate modifications that align with your values", "Accept the project but implement sustainability offsets"], "answer_index": 2, "answer": "Negotiate modifications that align with your values", "explanation": "Seeking creative solutions that align business opportunities with organizational values can achieve both financial and ethical objectives.", "difficulty": "medium", "tags": ["SJT", "customer_service", "ethics"], "translations": {}}
{"id": "SJT-0157", "domain": "communication", "scenario": "You're presenting to an international audience with varying levels of English proficiency. Some concepts are getting lost in translation.", "choices": ["Continue in English and provide written summaries", "Use simpler language and visual aids", "Arrange for professional translation services", "Focus on universal concepts that don't require language complexity"], "answer_index": 1, "answer": "Use simpler language and visual aids", "explanation": "Adapting communication style with clear language and visuals can improve understanding across language barriers more effectively than complex solutions.", "difficulty": "easy", "tags": ["SJT", "communication", "international"], "translations": {}}
{"id": "SJT-0158", "domain": "conflict", "scenario": "Your company is merging departments with different performance standards and evaluation criteria. Employees are confused about expectations.", "choices": ["Maintain existing standards for each group", "Implement the highest standards across all groups", "Develop new unified standards through collaborative process", "Let managers decide standards for their teams"], "answer_index": 2, "answer": "Develop new unified standards through collaborative process", "explanation": "Collaborative development of unified standards ensures fairness while incorporating best practices from all groups.", "difficulty": "medium", "tags": ["SJT", "conflict", "standardization"], "translations": {}}
{"id": "SJT-0159", "domain": "inclusivity", "scenario": "Your team's meeting times consistently conflict with religious observances for some team members, limiting their participation in important discussions.", "choices": ["Maintain current meeting times for consistency", "Rotate meeting times to share the impact", "Survey team members to find inclusive meeting times", "Record meetings for those who cannot attend"], "answer_index": 2, "answer": "Survey team members to find inclusive meeting times", "explanation": "Proactive scheduling that accommodates religious observances ensures equal participation opportunities for all team members.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "scheduling"], "translations": {}}
{"id": "SJT-0160", "domain": "safety", "scenario": "A safety audit reveals that employees are not reporting minor incidents and near-misses, potentially missing opportunities to prevent major accidents.", "choices": ["Implement penalties for unreported incidents", "Create a non-punitive reporting system with incentives", "Increase safety monitoring and surveillance", "Focus only on major incidents since they're more important"], "answer_index": 1, "answer": "Create a non-punitive reporting system with incentives", "explanation": "Encouraging voluntary incident reporting through positive reinforcement creates a culture of safety improvement rather than fear.", "difficulty": "medium", "tags": ["SJT", "safety", "reporting"], "translations": {}}
{"id": "SJT-0161", "domain": "teamwork", "scenario": "Your project team includes remote workers in different time zones. Coordinating meetings and collaborative work is becoming increasingly difficult.", "choices": ["Schedule meetings during core business hours only", "Rotate meeting times to share timezone burden", "Use asynchronous collaboration tools and minimize live meetings", "Focus on regional teams and reduce global collaboration"], "answer_index": 1, "answer": "Rotate meeting times to share timezone burden", "explanation": "Fair distribution of timezone inconvenience shows respect for all team members and maintains global collaboration effectiveness.", "difficulty": "medium", "tags": ["SJT", "teamwork", "remote_work"], "translations": {}}
{"id": "SJT-0162", "domain": "leadership", "scenario": "Budget constraints require eliminating one of three successful programs. Each program serves different stakeholders and has passionate advocates.", "choices": ["Eliminate the newest program since it has less history", "Choose based on objective cost-benefit analysis", "Combine elements from all programs into one", "Let stakeholders vote on which programs to keep"], "answer_index": 1, "answer": "Choose based on objective cost-benefit analysis", "explanation": "Data-driven decision making provides fair, defensible criteria for difficult resource allocation choices.", "difficulty": "hard", "tags": ["SJT", "leadership", "resource_allocation"], "translations": {}}
{"id": "SJT-0163", "domain": "ethics", "scenario": "You discover that a colleague has been padding their expense reports with small, hard-to-detect false claims over several months.", "choices": ["Confront them directly about the expense reports", "Report the issue to management or HR", "Document the evidence and monitor for continuation", "Discuss general expense policy compliance in team meetings"], "answer_index": 1, "answer": "Report the issue to management or HR", "explanation": "Financial misconduct requires formal reporting to protect organizational assets and ensure proper investigation.", "difficulty": "medium", "tags": ["SJT", "ethics", "financial_integrity"], "translations": {}}
{"id": "SJT-0164", "domain": "customer_service", "scenario": "A long-term client, Hassan, consistently pays late but always eventually pays in full. They're requesting extended payment terms that would worsen cash flow.", "choices": ["Grant extended terms to maintain the relationship", "Require upfront payment due to payment history", "Negotiate payment terms that work for both parties", "Decline extended terms and maintain current policy"], "answer_index": 2, "answer": "Negotiate payment terms that work for both parties", "explanation": "Collaborative solutions that address both cash flow concerns and client needs can strengthen long-term business relationships.", "difficulty": "medium", "tags": ["SJT", "customer_service", "financial_management"], "translations": {}}
{"id": "SJT-0165", "domain": "communication", "scenario": "You're leading a meeting where one participant, Farid, consistently interrupts others and dominates the discussion, preventing quieter members from contributing.", "choices": ["Address the behavior privately after the meeting", "Interrupt the interrupter to redirect conversation", "Implement structured discussion rules for everyone", "Let the group dynamics work themselves out"], "answer_index": 2, "answer": "Implement structured discussion rules for everyone", "explanation": "Establishing clear facilitation structures ensures equal participation opportunities while maintaining meeting effectiveness.", "difficulty": "easy", "tags": ["SJT", "communication", "meeting_management"], "translations": {}}
{"id": "SJT-0166", "domain": "conflict", "scenario": "Your department is being reorganized, and some employees will lose their preferred projects while others will gain advancement opportunities.", "choices": ["Implement changes quickly to minimize uncertainty", "Involve affected employees in planning the reorganization", "Focus communication on the benefits of reorganization", "Make changes gradually to ease the transition"], "answer_index": 1, "answer": "Involve affected employees in planning the reorganization", "explanation": "Participatory change management reduces resistance and leverages employee insights for more effective organizational transitions.", "difficulty": "medium", "tags": ["SJT", "conflict", "change_management"], "translations": {}}
{"id": "SJT-0167", "domain": "inclusivity", "scenario": "Your workplace has religious accommodation policies, but some employees complain that accommodating prayer times and holidays creates unfair workload distribution.", "choices": ["Eliminate religious accommodations to ensure fairness", "Educate complainers about religious accommodation laws", "Develop workload distribution strategies that account for accommodations", "Ignore complaints since accommodations are legally required"], "answer_index": 2, "answer": "Develop workload distribution strategies that account for accommodations", "explanation": "Proactive planning that accommodates religious needs while maintaining operational fairness creates an inclusive and efficient workplace.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "workload_management"], "translations": {}}
{"id": "SJT-0168", "domain": "safety", "scenario": "Cost pressures are mounting to skip certain safety inspections that haven't revealed problems in the past year.", "choices": ["Skip inspections that have been consistently clean", "Maintain all safety inspections regardless of cost", "Reduce inspection frequency rather than eliminate them", "Focus inspections on highest-risk areas only"], "answer_index": 1, "answer": "Maintain all safety inspections regardless of cost", "explanation": "Consistent safety inspection schedules prevent complacency and ensure early detection of potential problems before they become serious.", "difficulty": "easy", "tags": ["SJT", "safety", "cost_management"], "translations": {}}
{"id": "SJT-0169", "domain": "teamwork", "scenario": "Your team is working on a high-stakes project with tight deadlines. One team member, Aicha, is going through a difficult personal situation that's affecting their work quality.", "choices": ["Reassign their critical tasks to other team members", "Provide additional support and resources to help them succeed", "Maintain normal expectations since the project is critical", "Suggest they take personal leave until the situation improves"], "answer_index": 1, "answer": "Provide additional support and resources to help them succeed", "explanation": "Supporting team members through difficult times while maintaining project quality demonstrates leadership and builds long-term loyalty.", "difficulty": "medium", "tags": ["SJT", "teamwork", "support"], "translations": {}}
{"id": "SJT-0170", "domain": "leadership", "scenario": "You're implementing a new performance evaluation system. Some managers want to maintain the old system because they're comfortable with it.", "choices": ["Force immediate adoption of the new system", "Allow managers to choose which system they prefer", "Provide training and support for the new system adoption", "Postpone implementation until all managers agree"], "answer_index": 2, "answer": "Provide training and support for the new system adoption", "explanation": "Supporting managers through system transitions with training ensures successful implementation while addressing comfort concerns.", "difficulty": "easy", "tags": ["SJT", "leadership", "system_implementation"], "translations": {}}
{"id": "SJT-0171", "domain": "ethics", "scenario": "Your company is considering a partnership with a supplier that offers excellent prices but has questionable labor practices in their overseas operations.", "choices": ["Accept the partnership since labor practices aren't your direct responsibility", "Decline the partnership due to ethical concerns", "Partner with them but require labor practice improvements", "Investigate their practices more thoroughly before deciding"], "answer_index": 3, "answer": "Investigate their practices more thoroughly before deciding", "explanation": "Due diligence on partner practices ensures informed decision-making that aligns with organizational values and ethical standards.", "difficulty": "hard", "tags": ["SJT", "ethics", "supplier_relations"], "translations": {}}
{"id": "SJT-0172", "domain": "customer_service", "scenario": "A client, Meriem, is demanding immediate resolution to a complex technical issue that typically requires several days to resolve properly.", "choices": ["Implement a quick temporary fix to satisfy the client", "Explain the timeline needed for a proper solution", "Allocate additional resources to expedite the solution", "Offer compensation while working on the proper solution"], "answer_index": 1, "answer": "Explain the timeline needed for a proper solution", "explanation": "Setting realistic expectations about quality solutions builds trust and prevents recurring issues from inadequate quick fixes.", "difficulty": "medium", "tags": ["SJT", "customer_service", "expectation_management"], "translations": {}}
{"id": "SJT-0173", "domain": "communication", "scenario": "You need to announce layoffs that will affect 20% of your workforce. Rumors are already circulating and employee morale is declining.", "choices": ["Make the announcement immediately to stop rumors", "Wait until all details are finalized before announcing", "Address rumors without confirming layoff details", "Announce layoffs with support resources and transition plans"], "answer_index": 3, "answer": "Announce layoffs with support resources and transition plans", "explanation": "Comprehensive communication that includes support demonstrates leadership responsibility and helps affected employees transition more effectively.", "difficulty": "hard", "tags": ["SJT", "communication", "layoffs"], "translations": {}}
{"id": "SJT-0174", "domain": "conflict", "scenario": "Your organization's open office layout is creating productivity issues. Some employees love the collaboration while others find it distracting and stressful.", "choices": ["Maintain the open office since most people like it", "Create quiet zones within the open office space", "Allow flexible work arrangements including remote work", "Survey employees and implement the majority preference"], "answer_index": 1, "answer": "Create quiet zones within the open office space", "explanation": "Accommodating different work style needs within the existing space can optimize productivity for diverse preferences.", "difficulty": "easy", "tags": ["SJT", "conflict", "workspace_design"], "translations": {}}
{"id": "SJT-0175", "domain": "inclusivity", "scenario": "Your company's marketing materials and website primarily feature one demographic group, which doesn't reflect your diverse customer base or workforce.", "choices": ["Change materials gradually to avoid sudden shifts", "Immediately diversify all marketing materials", "Focus on demographics that represent the largest customer segments", "Conduct research on customer preferences before changing materials"], "answer_index": 1, "answer": "Immediately diversify all marketing materials", "explanation": "Prompt diversification of representation demonstrates authentic commitment to inclusivity and better connects with diverse audiences.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "marketing"], "translations": {}}
{"id": "SJT-0176", "domain": "safety", "scenario": "A workplace safety improvement would significantly benefit worker health but requires substantial investment that might delay other planned projects.", "choices": ["Postpone safety improvements until other projects are complete", "Implement safety improvements and delay less critical projects", "Look for lower-cost safety alternatives", "Phase in safety improvements gradually over time"], "answer_index": 1, "answer": "Implement safety improvements and delay less critical projects", "explanation": "Prioritizing worker safety over other projects demonstrates organizational values and prevents potential accidents and liabilities.", "difficulty": "easy", "tags": ["SJT", "safety", "prioritization"], "translations": {}}
{"id": "SJT-0177", "domain": "teamwork", "scenario": "Your team needs to deliver a project, but key team member, Rachid, has conflicting priorities from another department that's demanding their time.", "choices": ["Escalate to senior management to resolve priority conflicts", "Negotiate with the other department for shared resources", "Reassign project tasks to other available team members", "Request deadline extensions to accommodate resource constraints"], "answer_index": 1, "answer": "Negotiate with the other department for shared resources", "explanation": "Collaborative resource sharing often provides solutions that meet multiple organizational needs more effectively than escalation.", "difficulty": "medium", "tags": ["SJT", "teamwork", "resource_conflict"], "translations": {}}
{"id": "SJT-0178", "domain": "leadership", "scenario": "Your organization is transitioning to more sustainable practices, but the changes require significant upfront costs and may initially reduce profitability.", "choices": ["Postpone sustainability initiatives until profitability improves", "Implement changes gradually to minimize financial impact", "Proceed with full implementation despite short-term costs", "Focus only on sustainability changes that provide immediate cost savings"], "answer_index": 1, "answer": "Implement changes gradually to minimize financial impact", "explanation": "Phased sustainability implementation balances environmental responsibility with financial sustainability for long-term organizational success.", "difficulty": "medium", "tags": ["SJT", "leadership", "sustainability"], "translations": {}}
{"id": "SJT-0179", "domain": "ethics", "scenario": "You're offered an opportunity to obtain competitive intelligence about a rival company through questionable means that may not be strictly illegal.", "choices": ["Accept the intelligence since it's technically legal", "Decline the opportunity due to ethical concerns", "Accept the intelligence but verify it through legitimate sources", "Report the offer to appropriate authorities"], "answer_index": 1, "answer": "Decline the opportunity due to ethical concerns", "explanation": "Maintaining ethical standards beyond legal minimums protects organizational reputation and sets proper precedent for business conduct.", "difficulty": "medium", "tags": ["SJT", "ethics", "competitive_intelligence"], "translations": {}}
{"id": "SJT-0180", "domain": "customer_service", "scenario": "A major client, Karim, wants to expand their contract significantly but is requesting terms that would be unprofitable for your company.", "choices": ["Accept the expanded contract to maintain the relationship", "Decline the expansion and maintain current terms", "Negotiate terms that work for both parties", "Accept the terms but reduce service quality to maintain margins"], "answer_index": 2, "answer": "Negotiate terms that work for both parties", "explanation": "Collaborative negotiation can find mutually beneficial solutions that enable growth while maintaining business viability.", "difficulty": "medium", "tags": ["SJT", "customer_service", "contract_negotiation"], "translations": {}}
{"id": "SJT-0181", "domain": "communication", "scenario": "You need to deliver difficult feedback to a high-performing employee, Samira, whose interpersonal skills are creating team friction.", "choices": ["Focus feedback only on specific behavioral examples", "Discuss the impact on team dynamics and performance", "Provide feedback along with development resources", "Address the issue indirectly through team-building activities"], "answer_index": 2, "answer": "Provide feedback along with development resources", "explanation": "Constructive feedback paired with development support demonstrates investment in employee growth while addressing performance issues.", "difficulty": "medium", "tags": ["SJT", "communication", "feedback"], "translations": {}}
{"id": "SJT-0182", "domain": "conflict", "scenario": "Your team is split between two different approaches to a major project. Both approaches have merit, but the team needs to move forward with one unified direction.", "choices": ["Choose the approach favored by senior team members", "Implement a hybrid approach combining both methods", "Make a decision quickly to avoid further delays", "Facilitate a structured decision-making process with clear criteria"], "answer_index": 3, "answer": "Facilitate a structured decision-making process with clear criteria", "explanation": "Objective decision-making processes help teams reach consensus while ensuring all perspectives are properly evaluated.", "difficulty": "medium", "tags": ["SJT", "conflict", "decision_making"], "translations": {}}
{"id": "SJT-0183", "domain": "inclusivity", "scenario": "Your company's leadership development program has historically had low participation from certain demographic groups despite efforts to encourage diversity.", "choices": ["Continue current efforts and wait for natural improvement", "Research barriers and redesign the program to be more inclusive", "Create separate leadership programs for underrepresented groups", "Focus recruitment efforts on increasing diverse participation"], "answer_index": 1, "answer": "Research barriers and redesign the program to be more inclusive", "explanation": "Understanding and addressing systemic barriers creates more effective inclusion than simply increasing recruitment efforts.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "leadership_development"], "translations": {}}
{"id": "SJT-0184", "domain": "safety", "scenario": "Employees are required to use personal protective equipment, but compliance is inconsistent despite training and reminders.", "choices": ["Implement disciplinary measures for non-compliance", "Investigate why employees aren't using equipment consistently", "Increase supervision and monitoring of equipment use", "Provide additional training on equipment importance"], "answer_index": 1, "answer": "Investigate why employees aren't using equipment consistently", "explanation": "Understanding root causes of non-compliance enables targeted solutions that address practical barriers to safety compliance.", "difficulty": "easy", "tags": ["SJT", "safety", "compliance"], "translations": {}}
{"id": "SJT-0185", "domain": "teamwork", "scenario": "Your team includes both highly experienced professionals and recent graduates. The generation gap is creating communication and collaboration challenges.", "choices": ["Let team members work primarily with peers from similar backgrounds", "Create mentoring relationships between experienced and newer employees", "Provide communication training for all team members", "Focus on project outcomes rather than process differences"], "answer_index": 1, "answer": "Create mentoring relationships between experienced and newer employees", "explanation": "Structured mentoring leverages generational differences as strengths while building understanding and collaboration across experience levels.", "difficulty": "easy", "tags": ["SJT", "teamwork", "mentoring"], "translations": {}}
{"id": "SJT-0186", "domain": "leadership", "scenario": "Your organization needs to cut costs, and one option is to reduce employee benefits that are highly valued but expensive to maintain.", "choices": ["Cut benefits across the board to share the impact", "Eliminate the most expensive benefits regardless of employee preference", "Survey employees to understand which benefits they value most", "Find alternative ways to cut costs without affecting benefits"], "answer_index": 3, "answer": "Find alternative ways to cut costs without affecting benefits", "explanation": "Exploring all cost-reduction options before cutting valued benefits demonstrates leadership commitment to employee welfare.", "difficulty": "medium", "tags": ["SJT", "leadership", "cost_reduction"], "translations": {}}
{"id": "SJT-0187", "domain": "ethics", "scenario": "A vendor offers your company a significant discount in exchange for a testimonial about their services, but your experience with them has been mixed.", "choices": ["Accept the discount and provide a carefully worded positive testimonial", "Decline the offer due to concerns about testimonial authenticity", "Accept the discount but provide an honest, balanced testimonial", "Negotiate a discount without requiring a testimonial"], "answer_index": 2, "answer": "Accept the discount but provide an honest, balanced testimonial", "explanation": "Honest testimonials maintain integrity while allowing business relationships to continue based on authentic feedback.", "difficulty": "medium", "tags": ["SJT", "ethics", "vendor_relations"], "translations": {}}
{"id": "SJT-0188", "domain": "customer_service", "scenario": "A client, Yasmine, is consistently difficult to work with, making unreasonable demands and treating staff poorly, but they provide significant revenue.", "choices": ["Continue serving the client since revenue is important", "Terminate the relationship due to poor treatment of staff", "Set clear boundaries and communication protocols", "Assign only senior staff who can handle difficult clients"], "answer_index": 2, "answer": "Set clear boundaries and communication protocols", "explanation": "Professional boundaries protect staff while maintaining business relationships through structured interactions.", "difficulty": "medium", "tags": ["SJT", "customer_service", "difficult_clients"], "translations": {}}
{"id": "SJT-0189", "domain": "communication", "scenario": "You're presenting a new initiative to stakeholders who have different priorities and concerns. Some want quick implementation while others prefer careful planning.", "choices": ["Present only the benefits to gain support for quick implementation", "Address all concerns and propose a phased implementation approach", "Focus on stakeholders who support quick implementation", "Present multiple implementation options and let stakeholders choose"], "answer_index": 1, "answer": "Address all concerns and propose a phased implementation approach", "explanation": "Acknowledging diverse concerns while proposing balanced solutions builds broader stakeholder buy-in for successful implementation.", "difficulty": "medium", "tags": ["SJT", "communication", "stakeholder_management"], "translations": {}}
{"id": "SJT-0190", "domain": "conflict", "scenario": "Your company is implementing hot-desking to reduce office space costs, but employees are resistant to losing their personal workspace.", "choices": ["Implement hot-desking quickly to realize cost savings", "Provide storage solutions and technology to ease the transition", "Survey employees and modify the plan based on feedback", "Phase in hot-desking gradually with pilot groups"], "answer_index": 1, "answer": "Provide storage solutions and technology to ease the transition", "explanation": "Addressing practical concerns about workspace changes helps employees adapt while achieving organizational cost objectives.", "difficulty": "easy", "tags": ["SJT", "conflict", "workspace_change"], "translations": {}}
{"id": "SJT-0191", "domain": "inclusivity", "scenario": "Your team's informal networking happens through activities that don't appeal to or accommodate all team members, creating unequal access to relationship building.", "choices": ["Continue current activities since most people enjoy them", "Survey team members about preferred networking activities", "Rotate between different types of networking activities", "Create formal networking opportunities separate from informal ones"], "answer_index": 2, "answer": "Rotate between different types of networking activities", "explanation": "Varied networking opportunities ensure all team members have equal access to relationship building regardless of personal preferences.", "difficulty": "easy", "tags": ["SJT", "inclusivity", "networking"], "translations": {}}
{"id": "SJT-0192", "domain": "safety", "scenario": "A safety protocol slows down production significantly. Workers are under pressure to meet quotas and some are taking shortcuts around safety procedures.", "choices": ["Emphasize quota achievement and trust workers to be safe", "Adjust quotas to account for safety protocol time requirements", "Increase safety monitoring and enforcement", "Review and streamline safety protocols where possible"], "answer_index": 1, "answer": "Adjust quotas to account for safety protocol time requirements", "explanation": "Aligning performance expectations with safety requirements prevents workers from having to choose between safety and productivity.", "difficulty": "medium", "tags": ["SJT", "safety", "productivity"], "translations": {}}
{"id": "SJT-0193", "domain": "teamwork", "scenario": "Your team is working on a complex project that requires expertise from multiple departments. Coordination is challenging and deadlines are tight.", "choices": ["Create a dedicated project team with representatives from each department", "Assign one department as lead and have others provide support", "Use project management software to coordinate across departments", "Break the project into smaller, department-specific components"], "answer_index": 0, "answer": "Create a dedicated project team with representatives from each department", "explanation": "Cross-functional project teams improve coordination and communication while ensuring all necessary expertise is represented.", "difficulty": "medium", "tags": ["SJT", "teamwork", "project_management"], "translations": {}}
{"id": "SJT-0194", "domain": "leadership", "scenario": "You need to promote someone to a leadership role. You have two candidates: one with strong technical skills and another with strong people skills.", "choices": ["Promote the candidate with technical skills since expertise is crucial", "Promote the candidate with people skills since leadership requires it", "Evaluate both candidates against specific leadership competencies", "Create a shared leadership role for both candidates"], "answer_index": 2, "answer": "Evaluate both candidates against specific leadership competencies", "explanation": "Objective evaluation against defined leadership criteria ensures the best fit for the role's specific requirements.", "difficulty": "medium", "tags": ["SJT", "leadership", "promotion"], "translations": {}}
{"id": "SJT-0195", "domain": "ethics", "scenario": "Your company has the opportunity to win a large contract by underbidding competitors, but this would require reducing quality standards below your normal practice.", "choices": ["Submit the low bid and find ways to maintain quality within budget", "Bid at normal margins and maintain quality standards", "Submit the low bid with clear quality disclaimers", "Decline to bid on the project"], "answer_index": 1, "answer": "Bid at normal margins and maintain quality standards", "explanation": "Maintaining quality standards protects organizational reputation and long-term relationships even when it means losing short-term opportunities.", "difficulty": "medium", "tags": ["SJT", "ethics", "bidding"], "translations": {}}
{"id": "SJT-0196", "domain": "customer_service", "scenario": "A long-term client, Amina, wants to renegotiate their contract to include services you don't currently offer. They're threatening to leave if you can't accommodate them.", "choices": ["Agree to provide services even though you lack expertise", "Decline the additional services and risk losing the client", "Propose partnering with other providers to deliver the services", "Offer alternative services within your current capabilities"], "answer_index": 2, "answer": "Propose partnering with other providers to deliver the services", "explanation": "Strategic partnerships can extend service capabilities while maintaining quality and meeting client needs effectively.", "difficulty": "medium", "tags": ["SJT", "customer_service", "partnerships"], "translations": {}}
{"id": "SJT-0197", "domain": "communication", "scenario": "You need to communicate a policy change that will be unpopular with employees. The change is necessary for compliance but will create additional work.", "choices": ["Focus communication on compliance requirements", "Acknowledge the inconvenience and explain the reasoning", "Implement the change gradually with minimal communication", "Present the change along with efforts to minimize impact"], "answer_index": 3, "answer": "Present the change along with efforts to minimize impact", "explanation": "Transparent communication that acknowledges challenges while demonstrating efforts to minimize impact builds employee understanding and cooperation.", "difficulty": "easy", "tags": ["SJT", "communication", "policy_change"], "translations": {}}
{"id": "SJT-0198", "domain": "conflict", "scenario": "Your organization is restructuring and two departments will be merged. Both departments have strong cultures and are resistant to integration.", "choices": ["Force rapid integration to overcome resistance", "Allow departments to maintain separate cultures within the new structure", "Facilitate cultural integration through joint activities and shared goals", "Focus on operational integration and ignore cultural differences"], "answer_index": 2, "answer": "Facilitate cultural integration through joint activities and shared goals", "explanation": "Proactive cultural integration through shared experiences creates stronger unified teams than forced or ignored cultural differences.", "difficulty": "medium", "tags": ["SJT", "conflict", "cultural_integration"], "translations": {}}
{"id": "SJT-0199", "domain": "inclusivity", "scenario": "Your organization's promotion criteria appear to be neutral but consistently result in advancement patterns that favor certain groups over others.", "choices": ["Continue with current criteria since they appear fair", "Analyze criteria for hidden bias and adjust as needed", "Add diversity targets to promotion decisions", "Create separate advancement tracks for different groups"], "answer_index": 1, "answer": "Analyze criteria for hidden bias and adjust as needed", "explanation": "Examining and addressing systemic bias in promotion criteria creates more equitable advancement opportunities while maintaining merit-based decisions.", "difficulty": "medium", "tags": ["SJT", "inclusivity", "promotion_equity"], "translations": {}}
{"id": "SJT-0200", "domain": "safety", "scenario": "Your workplace safety record is good, but you've identified additional improvements that would be costly and provide incremental benefits rather than major risk reduction.", "choices": ["Focus resources on areas with higher risk reduction potential", "Implement all safety improvements regardless of cost", "Delay improvements until they become more cost-effective", "Implement the most cost-effective improvements first"], "answer_index": 3, "answer": "Implement the most cost-effective improvements first", "explanation": "Prioritizing cost-effective safety improvements ensures continuous progress while maximizing safety benefits within resource constraints.", "difficulty": "medium", "tags": ["SJT", "safety", "cost_effectiveness"], "translations": {}}
